pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * DMA_SADDR - TCD Source Address
 ******************************************************************************/

/*!
 * @brief DMA_SADDR - TCD Source Address (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DMA_SADDR register
 */
/*@{*/
#define DMA_RD_SADDR(base, index) (DMA_SADDR_REG(base, index))
#define DMA_WR_SADDR(base, index, value) (DMA_SADDR_REG(base, index) = (value))
#define DMA_RMW_SADDR(base, index, mask, value) (DMA_WR_SADDR(base, index, (DMA_RD_SADDR(base, index) & ~(mask)) | (value)))
#define DMA_SET_SADDR(base, index, value) (BME_OR32(&DMA_SADDR_REG(base, index), (uint32_t)(value)))
#define DMA_CLR_SADDR(base, index, value) (BME_AND32(&DMA_SADDR_REG(base, index), (uint32_t)(~(value))))
#define DMA_TOG_SADDR(base, index, value) (BME_XOR32(&DMA_SADDR_REG(base, index), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * DMA_SOFF - TCD Signed Source Address Offset
 ******************************************************************************/

/*!
 * @brief DMA_SOFF - TCD Signed Source Address Offset (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire DMA_SOFF register
 */
/*@{*/
#define DMA_RD_SOFF(base, index) (DMA_SOFF_REG(base, index))
#define DMA_WR_SOFF(base, index, value) (DMA_SOFF_REG(base, index) = (value))
#define DMA_RMW_SOFF(base, index, mask, value) (DMA_WR_SOFF(base, index, (DMA_RD_SOFF(base, index) & ~(mask)) | (value)))
#define DMA_SET_SOFF(base, index, value) (BME_OR16(&DMA_SOFF_REG(base, index), (uint16_t)(value)))
#define DMA_CLR_SOFF(base, index, value) (BME_AND16(&DMA_SOFF_REG(base, index), (uint16_t)(~(value))))
#define DMA_TOG_SOFF(base, index, value) (BME_XOR16(&DMA_SOFF_REG(base, index), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * DMA_ATTR - TCD Transfer Attributes
 ******************************************************************************/

/*!
 * @brief DMA_ATTR - TCD Transfer Attributes (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire DMA_ATTR register
 */
/*@{*/
#define DMA_RD_ATTR(base, index) (DMA_ATTR_REG(base, index))
#define DMA_WR_ATTR(base, index, value) (DMA_ATTR_REG(base, index) = (value))
#define DMA_RMW_ATTR(base, index, mask, value) (DMA_WR_ATTR(base, index, (DMA_RD_ATTR(base, index) & ~(mask)) | (value)))
#define DMA_SET_ATTR(base, index, value) (BME_OR16(&DMA_ATTR_REG(base, index), (uint16_t)(value)))
#define DMA_CLR_ATTR(base, index, value) (BME_AND16(&DMA_ATTR_REG(base, index), (uint16_t)(~(value))))
#define DMA_TOG_ATTR(base, index, value) (BME_XOR16(&DMA_ATTR_REG(base, index), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual DMA_ATTR bitfields
 */

/*!
 * @name Register DMA_ATTR, field DSIZE[2:0] (RW)
 *
 * See the SSIZE definition
 */
/*@{*/
/*! @brief Read current value of the DMA_ATTR_DSIZE field. */
#define DMA_RD_ATTR_DSIZE(base, index) ((DMA_ATTR_REG(base, index) & DMA_ATTR_DSIZE_MASK) >> DMA_ATTR_DSIZE_SHIFT)
#define DMA_BRD_ATTR_DSIZE(base, index) (BME_UBFX16(&DMA_ATTR_REG(base, index), DMA_ATTR_DSIZE_SHIFT, DMA_ATTR_DSIZE_WIDTH))

/*! @brief Set the DSIZE field to a new value. */
#define DMA_WR_ATTR_DSIZE(base, index, value) (DMA_RMW_ATTR(base, index, DMA_ATTR_DSIZE_MASK, DMA_ATTR_DSIZE(value)))
#define DMA_BWR_ATTR_DSIZE(base, index, value) (BME_BFI16(&DMA_ATTR_REG(base, index), ((uint16_t)(value) << DMA_ATTR_DSIZE_SHIFT), DMA_ATTR_DSIZE_SHIFT, DMA_ATTR_DSIZE_WIDTH))
/*@}*/

/*!
 * @name Register DMA_ATTR, field DMOD[7:3] (RW)
 *
 * See the SMOD definition
 */
/*@{*/
/*! @brief Read current value of the DMA_ATTR_DMOD field. */
#define DMA_RD_ATTR_DMOD(base, index) ((DMA_ATTR_REG(base, index) & DMA_ATTR_DMOD_MASK) >> DMA_ATTR_DMOD_SHIFT)
#define DMA_BRD_ATTR_DMOD(base, index) (BME_UBFX16(&DMA_ATTR_REG(base, index), DMA_ATTR_DMOD_SHIFT, DMA_ATTR_DMOD_WIDTH))

/*! @brief Set the DMOD field to a new value. */
#define DMA_WR_ATTR_DMOD(base, index, value) (DMA_RMW_ATTR(base, index, DMA_ATTR_DMOD_MASK, DMA_ATTR_DMOD(value)))
#define DMA_BWR_ATTR_DMOD(base, index, value) (BME_BFI16(&DMA_ATTR_REG(base, index), ((uint16_t)(value) << DMA_ATTR_DMOD_SHIFT), DMA_ATTR_DMOD_SHIFT, DMA_ATTR_DMOD_WIDTH))
/*@}*/

/*!
 * @name Register DMA_ATTR, field SSIZE[10:8] (RW)
 *
 * Using a Reserved value causes a configuration error.
 *
 * Values:
 * - 0b000 - 8-bit
 * - 0b001 - 16-bit
 * - 0b010 - 32-bit
 * - 0b011 - Reserved
 * - 0b100 - 16-byte
 * - 0b101 - 32-byte
 * - 0b110 - Reserved
 * - 0b111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the DMA_ATTR_SSIZE field. */
#define DMA_RD_ATTR_SSIZE(base, index) ((DMA_ATTR_REG(base, index) & DMA_ATTR_SSIZE_MASK) >> DMA_ATTR_SSIZE_SHIFT)
#define DMA_BRD_ATTR_SSIZE(base, index) (BME_UBFX16(&DMA_ATTR_REG(base, index), DMA_ATTR_SSIZE_SHIFT, DMA_ATTR_SSIZE_WIDTH))

/*! @brief Set the SSIZE field to a new value. */
#define DMA_WR_ATTR_SSIZE(base, index, value) (DMA_RMW_ATTR(base, index, DMA_ATTR_SSIZE_MASK, DMA_ATTR_SSIZE(value)))
#define DMA_BWR_ATTR_SSIZE(base, index, value) (BME_BFI16(&DMA_ATTR_REG(base, index), ((uint16_t)(value) << DMA_ATTR_SSIZE_SHIFT), DMA_ATTR_SSIZE_SHIFT, DMA_ATTR_SSIZE_WIDTH))
/*@}*/

/*!
 * @name Register DMA_ATTR, field SMOD[15:11] (RW)
 *
 * Values:
 * - 0b00000 - Source address modulo feature is disabled
 */
/*@{*/
/*! @brief Read current value of the DMA_ATTR_SMOD field. */
#define DMA_RD_ATTR_SMOD(base, index) ((DMA_ATTR_REG(base, index) & DMA_ATTR_SMOD_MASK) >> DMA_ATTR_SMOD_SHIFT)
#define DMA_BRD_ATTR_SMOD(base, index) (BME_UBFX16(&DMA_ATTR_REG(base, index), DMA_ATTR_SMOD_SHIFT, DMA_ATTR_SMOD_WIDTH))

/*! @brief Set the SMOD field to a new value. */
#define DMA_WR_ATTR_SMOD(base, index, value) (DMA_RMW_ATTR(base, index, DMA_ATTR_SMOD_MASK, DMA_ATTR_SMOD(value)))
#define DMA_BWR_ATTR_SMOD(base, index, value) (BME_BFI16(&DMA_ATTR_REG(base, index), ((uint16_t)(value) << DMA_ATTR_SMOD_SHIFT), DMA_ATTR_SMOD_SHIFT, DMA_ATTR_SMOD_WIDTH))
/*@}*/

