pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the LRC_EN field to a new value. */
#define EMVSIM_WR_CTRL_LRC_EN(base, value) (EMVSIM_RMW_CTRL(base, EMVSIM_CTRL_LRC_EN_MASK, EMVSIM_CTRL_LRC_EN(value)))
#define EMVSIM_BWR_CTRL_LRC_EN(base, value) (BME_BFI32(&EMVSIM_CTRL_REG(base), ((uint32_t)(value) << EMVSIM_CTRL_LRC_EN_SHIFT), EMVSIM_CTRL_LRC_EN_SHIFT, EMVSIM_CTRL_LRC_EN_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_CTRL, field CRC_EN[29] (RW)
 *
 * This bit enables the calculation of the 16-bit CRC value for both receiver
 * and transmitter. The result of the calculation is continuously compared to the
 * expected remainder and reflected in the CRC_OK bit in the RX_STATUS register.
 * Clearing this bit resets the current CRC residual value in the EMV SIM hardware.
 *
 * Values:
 * - 0b0 - 16-bit Cyclic Redundancy Checking disabled (default)
 * - 0b1 - 16-bit Cyclic Redundancy Checking enabled
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_CTRL_CRC_EN field. */
#define EMVSIM_RD_CTRL_CRC_EN(base) ((EMVSIM_CTRL_REG(base) & EMVSIM_CTRL_CRC_EN_MASK) >> EMVSIM_CTRL_CRC_EN_SHIFT)
#define EMVSIM_BRD_CTRL_CRC_EN(base) (BME_UBFX32(&EMVSIM_CTRL_REG(base), EMVSIM_CTRL_CRC_EN_SHIFT, EMVSIM_CTRL_CRC_EN_WIDTH))

/*! @brief Set the CRC_EN field to a new value. */
#define EMVSIM_WR_CTRL_CRC_EN(base, value) (EMVSIM_RMW_CTRL(base, EMVSIM_CTRL_CRC_EN_MASK, EMVSIM_CTRL_CRC_EN(value)))
#define EMVSIM_BWR_CTRL_CRC_EN(base, value) (BME_BFI32(&EMVSIM_CTRL_REG(base), ((uint32_t)(value) << EMVSIM_CTRL_CRC_EN_SHIFT), EMVSIM_CTRL_CRC_EN_SHIFT, EMVSIM_CTRL_CRC_EN_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_CTRL, field XMT_CRC_LRC[30] (RW)
 *
 * This bit specifies whether or not to transmit the redundancy checking data
 * (LRC or CRC) at the end of a transmission (that is, when the FIFO becomes empty).
 *
 * Values:
 * - 0b0 - No CRC or LRC value is transmitted (default)
 * - 0b1 - Transmit LRC or CRC info when FIFO empties (whichever is enabled)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_CTRL_XMT_CRC_LRC field. */
#define EMVSIM_RD_CTRL_XMT_CRC_LRC(base) ((EMVSIM_CTRL_REG(base) & EMVSIM_CTRL_XMT_CRC_LRC_MASK) >> EMVSIM_CTRL_XMT_CRC_LRC_SHIFT)
#define EMVSIM_BRD_CTRL_XMT_CRC_LRC(base) (BME_UBFX32(&EMVSIM_CTRL_REG(base), EMVSIM_CTRL_XMT_CRC_LRC_SHIFT, EMVSIM_CTRL_XMT_CRC_LRC_WIDTH))

/*! @brief Set the XMT_CRC_LRC field to a new value. */
#define EMVSIM_WR_CTRL_XMT_CRC_LRC(base, value) (EMVSIM_RMW_CTRL(base, EMVSIM_CTRL_XMT_CRC_LRC_MASK, EMVSIM_CTRL_XMT_CRC_LRC(value)))
#define EMVSIM_BWR_CTRL_XMT_CRC_LRC(base, value) (BME_BFI32(&EMVSIM_CTRL_REG(base), ((uint32_t)(value) << EMVSIM_CTRL_XMT_CRC_LRC_SHIFT), EMVSIM_CTRL_XMT_CRC_LRC_SHIFT, EMVSIM_CTRL_XMT_CRC_LRC_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_CTRL, field BWT_EN[31] (RW)
 *
 * Writing a '1' to this bit will enable the BWT and BGT functions. The BWT and
 * BGT functions can then be individually selected using the interrupt mask.
 *
 * Values:
 * - 0b0 - Disable BWT, BGT Counters (default)
 * - 0b1 - Enable BWT, BGT Counters
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_CTRL_BWT_EN field. */
#define EMVSIM_RD_CTRL_BWT_EN(base) ((EMVSIM_CTRL_REG(base) & EMVSIM_CTRL_BWT_EN_MASK) >> EMVSIM_CTRL_BWT_EN_SHIFT)
#define EMVSIM_BRD_CTRL_BWT_EN(base) (BME_UBFX32(&EMVSIM_CTRL_REG(base), EMVSIM_CTRL_BWT_EN_SHIFT, EMVSIM_CTRL_BWT_EN_WIDTH))

/*! @brief Set the BWT_EN field to a new value. */
#define EMVSIM_WR_CTRL_BWT_EN(base, value) (EMVSIM_RMW_CTRL(base, EMVSIM_CTRL_BWT_EN_MASK, EMVSIM_CTRL_BWT_EN(value)))
#define EMVSIM_BWR_CTRL_BWT_EN(base, value) (BME_BFI32(&EMVSIM_CTRL_REG(base), ((uint32_t)(value) << EMVSIM_CTRL_BWT_EN_SHIFT), EMVSIM_CTRL_BWT_EN_SHIFT, EMVSIM_CTRL_BWT_EN_WIDTH))
/*@}*/

/*******************************************************************************
 * EMVSIM_INT_MASK - Interrupt Mask Register
 ******************************************************************************/

/*!
 * @brief EMVSIM_INT_MASK - Interrupt Mask Register (RW)
 *
 * Reset value: 0x00007FFFU
 */
/*!
 * @name Constants and macros for entire EMVSIM_INT_MASK register
 */
/*@{*/
#define EMVSIM_RD_INT_MASK(base) (EMVSIM_INT_MASK_REG(base))
#define EMVSIM_WR_INT_MASK(base, value) (EMVSIM_INT_MASK_REG(base) = (value))
#define EMVSIM_RMW_INT_MASK(base, mask, value) (EMVSIM_WR_INT_MASK(base, (EMVSIM_RD_INT_MASK(base) & ~(mask)) | (value)))
#define EMVSIM_SET_INT_MASK(base, value) (BME_OR32(&EMVSIM_INT_MASK_REG(base), (uint32_t)(value)))
#define EMVSIM_CLR_INT_MASK(base, value) (BME_AND32(&EMVSIM_INT_MASK_REG(base), (uint32_t)(~(value))))
#define EMVSIM_TOG_INT_MASK(base, value) (BME_XOR32(&EMVSIM_INT_MASK_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual EMVSIM_INT_MASK bitfields
 */

/*!
 * @name Register EMVSIM_INT_MASK, field RDT_IM[0] (RW)
 *
 * Used to enable/disable the ability of the RDTF flag in the RX_STATUS register
 * to generate EMV SIM interrupts.
 *
 * Values:
 * - 0b0 - RDTF interrupt enabled
 * - 0b1 - RDTF interrupt masked (default)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_INT_MASK_RDT_IM field. */
#define EMVSIM_RD_INT_MASK_RDT_IM(base) ((EMVSIM_INT_MASK_REG(base) & EMVSIM_INT_MASK_RDT_IM_MASK) >> EMVSIM_INT_MASK_RDT_IM_SHIFT)
#define EMVSIM_BRD_INT_MASK_RDT_IM(base) (BME_UBFX32(&EMVSIM_INT_MASK_REG(base), EMVSIM_INT_MASK_RDT_IM_SHIFT, EMVSIM_INT_MASK_RDT_IM_WIDTH))

/*! @brief Set the RDT_IM field to a new value. */
#define EMVSIM_WR_INT_MASK_RDT_IM(base, value) (EMVSIM_RMW_INT_MASK(base, EMVSIM_INT_MASK_RDT_IM_MASK, EMVSIM_INT_MASK_RDT_IM(value)))
#define EMVSIM_BWR_INT_MASK_RDT_IM(base, value) (BME_BFI32(&EMVSIM_INT_MASK_REG(base), ((uint32_t)(value) << EMVSIM_INT_MASK_RDT_IM_SHIFT), EMVSIM_INT_MASK_RDT_IM_SHIFT, EMVSIM_INT_MASK_RDT_IM_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_INT_MASK, field TC_IM[1] (RW)
 *
 * Used to enable/disable the ability of the TCF flag in the TX_STATUS register
 * to generate EMV SIM interrupts.
 *
 * Values:
 * - 0b0 - TCF interrupt enabled
 * - 0b1 - TCF interrupt masked (default)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_INT_MASK_TC_IM field. */
#define EMVSIM_RD_INT_MASK_TC_IM(base) ((EMVSIM_INT_MASK_REG(base) & EMVSIM_INT_MASK_TC_IM_MASK) >> EMVSIM_INT_MASK_TC_IM_SHIFT)
#define EMVSIM_BRD_INT_MASK_TC_IM(base) (BME_UBFX32(&EMVSIM_INT_MASK_REG(base), EMVSIM_INT_MASK_TC_IM_SHIFT, EMVSIM_INT_MASK_TC_IM_WIDTH))

