pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the TC_IM field to a new value. */
#define EMVSIM_WR_INT_MASK_TC_IM(base, value) (EMVSIM_RMW_INT_MASK(base, EMVSIM_INT_MASK_TC_IM_MASK, EMVSIM_INT_MASK_TC_IM(value)))
#define EMVSIM_BWR_INT_MASK_TC_IM(base, value) (BME_BFI32(&EMVSIM_INT_MASK_REG(base), ((uint32_t)(value) << EMVSIM_INT_MASK_TC_IM_SHIFT), EMVSIM_INT_MASK_TC_IM_SHIFT, EMVSIM_INT_MASK_TC_IM_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_INT_MASK, field RFO_IM[2] (RW)
 *
 * Used to enable/disable the ability of the RFO flag in the RX_STATUS register
 * to generate EMV SIM interrupts.
 *
 * Values:
 * - 0b0 - RFO interrupt enabled
 * - 0b1 - RFO interrupt masked (default)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_INT_MASK_RFO_IM field. */
#define EMVSIM_RD_INT_MASK_RFO_IM(base) ((EMVSIM_INT_MASK_REG(base) & EMVSIM_INT_MASK_RFO_IM_MASK) >> EMVSIM_INT_MASK_RFO_IM_SHIFT)
#define EMVSIM_BRD_INT_MASK_RFO_IM(base) (BME_UBFX32(&EMVSIM_INT_MASK_REG(base), EMVSIM_INT_MASK_RFO_IM_SHIFT, EMVSIM_INT_MASK_RFO_IM_WIDTH))

/*! @brief Set the RFO_IM field to a new value. */
#define EMVSIM_WR_INT_MASK_RFO_IM(base, value) (EMVSIM_RMW_INT_MASK(base, EMVSIM_INT_MASK_RFO_IM_MASK, EMVSIM_INT_MASK_RFO_IM(value)))
#define EMVSIM_BWR_INT_MASK_RFO_IM(base, value) (BME_BFI32(&EMVSIM_INT_MASK_REG(base), ((uint32_t)(value) << EMVSIM_INT_MASK_RFO_IM_SHIFT), EMVSIM_INT_MASK_RFO_IM_SHIFT, EMVSIM_INT_MASK_RFO_IM_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_INT_MASK, field ETC_IM[3] (RW)
 *
 * Used to enable/disable the ability of the ETC flag in the TX_STATUS register
 * to generate EMV SIM interrupts.
 *
 * Values:
 * - 0b0 - ETC interrupt enabled
 * - 0b1 - ETC interrupt masked (default)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_INT_MASK_ETC_IM field. */
#define EMVSIM_RD_INT_MASK_ETC_IM(base) ((EMVSIM_INT_MASK_REG(base) & EMVSIM_INT_MASK_ETC_IM_MASK) >> EMVSIM_INT_MASK_ETC_IM_SHIFT)
#define EMVSIM_BRD_INT_MASK_ETC_IM(base) (BME_UBFX32(&EMVSIM_INT_MASK_REG(base), EMVSIM_INT_MASK_ETC_IM_SHIFT, EMVSIM_INT_MASK_ETC_IM_WIDTH))

/*! @brief Set the ETC_IM field to a new value. */
#define EMVSIM_WR_INT_MASK_ETC_IM(base, value) (EMVSIM_RMW_INT_MASK(base, EMVSIM_INT_MASK_ETC_IM_MASK, EMVSIM_INT_MASK_ETC_IM(value)))
#define EMVSIM_BWR_INT_MASK_ETC_IM(base, value) (BME_BFI32(&EMVSIM_INT_MASK_REG(base), ((uint32_t)(value) << EMVSIM_INT_MASK_ETC_IM_SHIFT), EMVSIM_INT_MASK_ETC_IM_SHIFT, EMVSIM_INT_MASK_ETC_IM_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_INT_MASK, field TFE_IM[4] (RW)
 *
 * Used to enable/disable the ability of the TFE flag in the TX_STATUS register
 * to generate EMV SIM interrupts.
 *
 * Values:
 * - 0b0 - TFE interrupt enabled
 * - 0b1 - TFE interrupt masked (default)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_INT_MASK_TFE_IM field. */
#define EMVSIM_RD_INT_MASK_TFE_IM(base) ((EMVSIM_INT_MASK_REG(base) & EMVSIM_INT_MASK_TFE_IM_MASK) >> EMVSIM_INT_MASK_TFE_IM_SHIFT)
#define EMVSIM_BRD_INT_MASK_TFE_IM(base) (BME_UBFX32(&EMVSIM_INT_MASK_REG(base), EMVSIM_INT_MASK_TFE_IM_SHIFT, EMVSIM_INT_MASK_TFE_IM_WIDTH))

/*! @brief Set the TFE_IM field to a new value. */
#define EMVSIM_WR_INT_MASK_TFE_IM(base, value) (EMVSIM_RMW_INT_MASK(base, EMVSIM_INT_MASK_TFE_IM_MASK, EMVSIM_INT_MASK_TFE_IM(value)))
#define EMVSIM_BWR_INT_MASK_TFE_IM(base, value) (BME_BFI32(&EMVSIM_INT_MASK_REG(base), ((uint32_t)(value) << EMVSIM_INT_MASK_TFE_IM_SHIFT), EMVSIM_INT_MASK_TFE_IM_SHIFT, EMVSIM_INT_MASK_TFE_IM_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_INT_MASK, field TNACK_IM[5] (RW)
 *
 * Used to enable/disable the ability of the TNTE flag in the TX_STATUS register
 * to generate EMV SIM interrupts.
 *
 * Values:
 * - 0b0 - TNTE interrupt enabled
 * - 0b1 - TNTE interrupt masked (default)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_INT_MASK_TNACK_IM field. */
#define EMVSIM_RD_INT_MASK_TNACK_IM(base) ((EMVSIM_INT_MASK_REG(base) & EMVSIM_INT_MASK_TNACK_IM_MASK) >> EMVSIM_INT_MASK_TNACK_IM_SHIFT)
#define EMVSIM_BRD_INT_MASK_TNACK_IM(base) (BME_UBFX32(&EMVSIM_INT_MASK_REG(base), EMVSIM_INT_MASK_TNACK_IM_SHIFT, EMVSIM_INT_MASK_TNACK_IM_WIDTH))

/*! @brief Set the TNACK_IM field to a new value. */
#define EMVSIM_WR_INT_MASK_TNACK_IM(base, value) (EMVSIM_RMW_INT_MASK(base, EMVSIM_INT_MASK_TNACK_IM_MASK, EMVSIM_INT_MASK_TNACK_IM(value)))
#define EMVSIM_BWR_INT_MASK_TNACK_IM(base, value) (BME_BFI32(&EMVSIM_INT_MASK_REG(base), ((uint32_t)(value) << EMVSIM_INT_MASK_TNACK_IM_SHIFT), EMVSIM_INT_MASK_TNACK_IM_SHIFT, EMVSIM_INT_MASK_TNACK_IM_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_INT_MASK, field TFF_IM[6] (RW)
 *
 * Used to enable/disable the ability of the TFF flag in the TX_STATUS register
 * to generate EMV SIM interrupts.
 *
 * Values:
 * - 0b0 - TFF interrupt enabled
 * - 0b1 - TFF interrupt masked (default)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_INT_MASK_TFF_IM field. */
#define EMVSIM_RD_INT_MASK_TFF_IM(base) ((EMVSIM_INT_MASK_REG(base) & EMVSIM_INT_MASK_TFF_IM_MASK) >> EMVSIM_INT_MASK_TFF_IM_SHIFT)
#define EMVSIM_BRD_INT_MASK_TFF_IM(base) (BME_UBFX32(&EMVSIM_INT_MASK_REG(base), EMVSIM_INT_MASK_TFF_IM_SHIFT, EMVSIM_INT_MASK_TFF_IM_WIDTH))

/*! @brief Set the TFF_IM field to a new value. */
#define EMVSIM_WR_INT_MASK_TFF_IM(base, value) (EMVSIM_RMW_INT_MASK(base, EMVSIM_INT_MASK_TFF_IM_MASK, EMVSIM_INT_MASK_TFF_IM(value)))
#define EMVSIM_BWR_INT_MASK_TFF_IM(base, value) (BME_BFI32(&EMVSIM_INT_MASK_REG(base), ((uint32_t)(value) << EMVSIM_INT_MASK_TFF_IM_SHIFT), EMVSIM_INT_MASK_TFF_IM_SHIFT, EMVSIM_INT_MASK_TFF_IM_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_INT_MASK, field TDT_IM[7] (RW)
 *
 * Used to enable/disable the ability of the TDTF flag in the TX_STATUS register
 * to generate EMV SIM interrupts.
 *
 * Values:
 * - 0b0 - TDTF interrupt enabled
 * - 0b1 - TDTF interrupt masked (default)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_INT_MASK_TDT_IM field. */
#define EMVSIM_RD_INT_MASK_TDT_IM(base) ((EMVSIM_INT_MASK_REG(base) & EMVSIM_INT_MASK_TDT_IM_MASK) >> EMVSIM_INT_MASK_TDT_IM_SHIFT)
#define EMVSIM_BRD_INT_MASK_TDT_IM(base) (BME_UBFX32(&EMVSIM_INT_MASK_REG(base), EMVSIM_INT_MASK_TDT_IM_SHIFT, EMVSIM_INT_MASK_TDT_IM_WIDTH))

/*! @brief Set the TDT_IM field to a new value. */
#define EMVSIM_WR_INT_MASK_TDT_IM(base, value) (EMVSIM_RMW_INT_MASK(base, EMVSIM_INT_MASK_TDT_IM_MASK, EMVSIM_INT_MASK_TDT_IM(value)))
#define EMVSIM_BWR_INT_MASK_TDT_IM(base, value) (BME_BFI32(&EMVSIM_INT_MASK_REG(base), ((uint32_t)(value) << EMVSIM_INT_MASK_TDT_IM_SHIFT), EMVSIM_INT_MASK_TDT_IM_SHIFT, EMVSIM_INT_MASK_TDT_IM_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_INT_MASK, field GPCNT0_IM[8] (RW)
 *
 * Used to enable/disable the ability of the GPCNT0_TO flag in the TX_STATUS
 * register to generate EMV SIM interrupts.
 *
 * Values:
 * - 0b0 - GPCNT0_TO interrupt enabled
 * - 0b1 - GPCNT0_TO interrupt masked (default)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_INT_MASK_GPCNT0_IM field. */
#define EMVSIM_RD_INT_MASK_GPCNT0_IM(base) ((EMVSIM_INT_MASK_REG(base) & EMVSIM_INT_MASK_GPCNT0_IM_MASK) >> EMVSIM_INT_MASK_GPCNT0_IM_SHIFT)
#define EMVSIM_BRD_INT_MASK_GPCNT0_IM(base) (BME_UBFX32(&EMVSIM_INT_MASK_REG(base), EMVSIM_INT_MASK_GPCNT0_IM_SHIFT, EMVSIM_INT_MASK_GPCNT0_IM_WIDTH))

/*! @brief Set the GPCNT0_IM field to a new value. */
#define EMVSIM_WR_INT_MASK_GPCNT0_IM(base, value) (EMVSIM_RMW_INT_MASK(base, EMVSIM_INT_MASK_GPCNT0_IM_MASK, EMVSIM_INT_MASK_GPCNT0_IM(value)))
#define EMVSIM_BWR_INT_MASK_GPCNT0_IM(base, value) (BME_BFI32(&EMVSIM_INT_MASK_REG(base), ((uint32_t)(value) << EMVSIM_INT_MASK_GPCNT0_IM_SHIFT), EMVSIM_INT_MASK_GPCNT0_IM_SHIFT, EMVSIM_INT_MASK_GPCNT0_IM_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_INT_MASK, field CWT_ERR_IM[9] (RW)
 *
 * Used to enable/disable the ability of the CWT_ERR flag in the RX_STATUS
 * register to generate EMV SIM interrupts.
 *
 * Values:
 * - 0b0 - CWT_ERR interrupt enabled
 * - 0b1 - CWT_ERR interrupt masked (default)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_INT_MASK_CWT_ERR_IM field. */
#define EMVSIM_RD_INT_MASK_CWT_ERR_IM(base) ((EMVSIM_INT_MASK_REG(base) & EMVSIM_INT_MASK_CWT_ERR_IM_MASK) >> EMVSIM_INT_MASK_CWT_ERR_IM_SHIFT)
#define EMVSIM_BRD_INT_MASK_CWT_ERR_IM(base) (BME_UBFX32(&EMVSIM_INT_MASK_REG(base), EMVSIM_INT_MASK_CWT_ERR_IM_SHIFT, EMVSIM_INT_MASK_CWT_ERR_IM_WIDTH))

/*! @brief Set the CWT_ERR_IM field to a new value. */
#define EMVSIM_WR_INT_MASK_CWT_ERR_IM(base, value) (EMVSIM_RMW_INT_MASK(base, EMVSIM_INT_MASK_CWT_ERR_IM_MASK, EMVSIM_INT_MASK_CWT_ERR_IM(value)))
#define EMVSIM_BWR_INT_MASK_CWT_ERR_IM(base, value) (BME_BFI32(&EMVSIM_INT_MASK_REG(base), ((uint32_t)(value) << EMVSIM_INT_MASK_CWT_ERR_IM_SHIFT), EMVSIM_INT_MASK_CWT_ERR_IM_SHIFT, EMVSIM_INT_MASK_CWT_ERR_IM_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_INT_MASK, field RNACK_IM[10] (RW)
 *
 * Used to enable/disable the ability of the RTE flag in the RX_STATUS register
 * to generate EMV SIM interrupts.
 *
 * Values:
 * - 0b0 - RTE interrupt enabled
 * - 0b1 - RTE interrupt masked (default)
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_INT_MASK_RNACK_IM field. */
#define EMVSIM_RD_INT_MASK_RNACK_IM(base) ((EMVSIM_INT_MASK_REG(base) & EMVSIM_INT_MASK_RNACK_IM_MASK) >> EMVSIM_INT_MASK_RNACK_IM_SHIFT)
#define EMVSIM_BRD_INT_MASK_RNACK_IM(base) (BME_UBFX32(&EMVSIM_INT_MASK_REG(base), EMVSIM_INT_MASK_RNACK_IM_SHIFT, EMVSIM_INT_MASK_RNACK_IM_WIDTH))

