pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the RDT field to a new value. */
#define EMVSIM_WR_RX_THD_RDT(base, value) (EMVSIM_RMW_RX_THD(base, EMVSIM_RX_THD_RDT_MASK, EMVSIM_RX_THD_RDT(value)))
#define EMVSIM_BWR_RX_THD_RDT(base, value) (BME_BFI32(&EMVSIM_RX_THD_REG(base), ((uint32_t)(value) << EMVSIM_RX_THD_RDT_SHIFT), EMVSIM_RX_THD_RDT_SHIFT, EMVSIM_RX_THD_RDT_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_RX_THD, field RNCK_THD[11:8] (RW)
 *
 * Used to specify the number of consecutive NACK's transmitted by the EMV SIM
 * module, for a given character, before the receive threshold error (RTE) flag is
 * triggered. A value of 0 indicates that RTE is never set. When a valid
 * character is received by the EMV SIM, the internal counter keeping track of the NACK
 * count resets to zero for the subsequent byte being received. If the ANACK bit
 * is clear in the CNTL register, RNCK_THD has no effect.
 *
 * Values:
 * - 0b0000 - Zero Threshold. RTE will not be set
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_RX_THD_RNCK_THD field. */
#define EMVSIM_RD_RX_THD_RNCK_THD(base) ((EMVSIM_RX_THD_REG(base) & EMVSIM_RX_THD_RNCK_THD_MASK) >> EMVSIM_RX_THD_RNCK_THD_SHIFT)
#define EMVSIM_BRD_RX_THD_RNCK_THD(base) (BME_UBFX32(&EMVSIM_RX_THD_REG(base), EMVSIM_RX_THD_RNCK_THD_SHIFT, EMVSIM_RX_THD_RNCK_THD_WIDTH))

/*! @brief Set the RNCK_THD field to a new value. */
#define EMVSIM_WR_RX_THD_RNCK_THD(base, value) (EMVSIM_RMW_RX_THD(base, EMVSIM_RX_THD_RNCK_THD_MASK, EMVSIM_RX_THD_RNCK_THD(value)))
#define EMVSIM_BWR_RX_THD_RNCK_THD(base, value) (BME_BFI32(&EMVSIM_RX_THD_REG(base), ((uint32_t)(value) << EMVSIM_RX_THD_RNCK_THD_SHIFT), EMVSIM_RX_THD_RNCK_THD_SHIFT, EMVSIM_RX_THD_RNCK_THD_WIDTH))
/*@}*/

/*******************************************************************************
 * EMVSIM_TX_THD - Transmitter Threshold Register
 ******************************************************************************/

/*!
 * @brief EMVSIM_TX_THD - Transmitter Threshold Register (RW)
 *
 * Reset value: 0x0000000FU
 */
/*!
 * @name Constants and macros for entire EMVSIM_TX_THD register
 */
/*@{*/
#define EMVSIM_RD_TX_THD(base)   (EMVSIM_TX_THD_REG(base))
#define EMVSIM_WR_TX_THD(base, value) (EMVSIM_TX_THD_REG(base) = (value))
#define EMVSIM_RMW_TX_THD(base, mask, value) (EMVSIM_WR_TX_THD(base, (EMVSIM_RD_TX_THD(base) & ~(mask)) | (value)))
#define EMVSIM_SET_TX_THD(base, value) (BME_OR32(&EMVSIM_TX_THD_REG(base), (uint32_t)(value)))
#define EMVSIM_CLR_TX_THD(base, value) (BME_AND32(&EMVSIM_TX_THD_REG(base), (uint32_t)(~(value))))
#define EMVSIM_TOG_TX_THD(base, value) (BME_XOR32(&EMVSIM_TX_THD_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual EMVSIM_TX_THD bitfields
 */

/*!
 * @name Register EMVSIM_TX_THD, field TDT[3:0] (RW)
 *
 * Used to set the threshold value for the Transmit FIFO at which the TDTF bit
 * in the TX_STATUS register will be set. When the number of bytes in the Transmit
 * FIFO is less than or equal to TDT[3:0], TDTF will be set.
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_TX_THD_TDT field. */
#define EMVSIM_RD_TX_THD_TDT(base) ((EMVSIM_TX_THD_REG(base) & EMVSIM_TX_THD_TDT_MASK) >> EMVSIM_TX_THD_TDT_SHIFT)
#define EMVSIM_BRD_TX_THD_TDT(base) (BME_UBFX32(&EMVSIM_TX_THD_REG(base), EMVSIM_TX_THD_TDT_SHIFT, EMVSIM_TX_THD_TDT_WIDTH))

/*! @brief Set the TDT field to a new value. */
#define EMVSIM_WR_TX_THD_TDT(base, value) (EMVSIM_RMW_TX_THD(base, EMVSIM_TX_THD_TDT_MASK, EMVSIM_TX_THD_TDT(value)))
#define EMVSIM_BWR_TX_THD_TDT(base, value) (BME_BFI32(&EMVSIM_TX_THD_REG(base), ((uint32_t)(value) << EMVSIM_TX_THD_TDT_SHIFT), EMVSIM_TX_THD_TDT_SHIFT, EMVSIM_TX_THD_TDT_WIDTH))
/*@}*/

/*!
 * @name Register EMVSIM_TX_THD, field TNCK_THD[11:8] (RW)
 *
 * Used to set the NACK threshold for the transmitter. Once the threshold number
 * set by TNCK_THD has been reached for the current byte being transmitted, the
 * error flag TNTE in the TX_STATUS register will be set. Setting of TNTE causes
 * the remaining transmissions queued in the transmit FIFO to be aborted and no
 * more transmissions to occur until software clears TNTE. To trigger TNTE, a
 * given byte being transmitted must reach the TNCK_THD threshold itself. Transmit
 * NACKs accumulated on one byte are not carried over to the next.
 *
 * Values:
 * - 0b0000 - TNTE will never be set; retransmission after NACK reception is
 *     disabled.
 * - 0b0001 - TNTE will be set after 1 nack is received; 0 retransmissions
 *     occurs.
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_TX_THD_TNCK_THD field. */
#define EMVSIM_RD_TX_THD_TNCK_THD(base) ((EMVSIM_TX_THD_REG(base) & EMVSIM_TX_THD_TNCK_THD_MASK) >> EMVSIM_TX_THD_TNCK_THD_SHIFT)
#define EMVSIM_BRD_TX_THD_TNCK_THD(base) (BME_UBFX32(&EMVSIM_TX_THD_REG(base), EMVSIM_TX_THD_TNCK_THD_SHIFT, EMVSIM_TX_THD_TNCK_THD_WIDTH))

/*! @brief Set the TNCK_THD field to a new value. */
#define EMVSIM_WR_TX_THD_TNCK_THD(base, value) (EMVSIM_RMW_TX_THD(base, EMVSIM_TX_THD_TNCK_THD_MASK, EMVSIM_TX_THD_TNCK_THD(value)))
#define EMVSIM_BWR_TX_THD_TNCK_THD(base, value) (BME_BFI32(&EMVSIM_TX_THD_REG(base), ((uint32_t)(value) << EMVSIM_TX_THD_TNCK_THD_SHIFT), EMVSIM_TX_THD_TNCK_THD_SHIFT, EMVSIM_TX_THD_TNCK_THD_WIDTH))
/*@}*/

/*******************************************************************************
 * EMVSIM_RX_STATUS - Receive Status Register
 ******************************************************************************/

/*!
 * @brief EMVSIM_RX_STATUS - Receive Status Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire EMVSIM_RX_STATUS register
 */
/*@{*/
#define EMVSIM_RD_RX_STATUS(base) (EMVSIM_RX_STATUS_REG(base))
#define EMVSIM_WR_RX_STATUS(base, value) (EMVSIM_RX_STATUS_REG(base) = (value))
#define EMVSIM_RMW_RX_STATUS(base, mask, value) (EMVSIM_WR_RX_STATUS(base, (EMVSIM_RD_RX_STATUS(base) & ~(mask)) | (value)))
#define EMVSIM_SET_RX_STATUS(base, value) (BME_OR32(&EMVSIM_RX_STATUS_REG(base), (uint32_t)(value)))
#define EMVSIM_CLR_RX_STATUS(base, value) (BME_AND32(&EMVSIM_RX_STATUS_REG(base), (uint32_t)(~(value))))
#define EMVSIM_TOG_RX_STATUS(base, value) (BME_XOR32(&EMVSIM_RX_STATUS_REG(base), (uint32_t)(value)))
/*@}*/

