pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * Constants & macros for individual EMVSIM_CWT_VAL bitfields
 */

/*!
 * @name Register EMVSIM_CWT_VAL, field CWT[15:0] (RW)
 *
 * The value written to this register will specify the number of ETU times
 * allowed between characters. Default is 0xFFFF
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_CWT_VAL_CWT field. */
#define EMVSIM_RD_CWT_VAL_CWT(base) ((EMVSIM_CWT_VAL_REG(base) & EMVSIM_CWT_VAL_CWT_MASK) >> EMVSIM_CWT_VAL_CWT_SHIFT)
#define EMVSIM_BRD_CWT_VAL_CWT(base) (EMVSIM_RD_CWT_VAL_CWT(base))

/*! @brief Set the CWT field to a new value. */
#define EMVSIM_WR_CWT_VAL_CWT(base, value) (EMVSIM_RMW_CWT_VAL(base, EMVSIM_CWT_VAL_CWT_MASK, EMVSIM_CWT_VAL_CWT(value)))
#define EMVSIM_BWR_CWT_VAL_CWT(base, value) (EMVSIM_WR_CWT_VAL_CWT(base, value))
/*@}*/

/*******************************************************************************
 * EMVSIM_BWT_VAL - Block Wait Time Value Register
 ******************************************************************************/

/*!
 * @brief EMVSIM_BWT_VAL - Block Wait Time Value Register (RW)
 *
 * Reset value: 0xFFFFFFFFU
 */
/*!
 * @name Constants and macros for entire EMVSIM_BWT_VAL register
 */
/*@{*/
#define EMVSIM_RD_BWT_VAL(base)  (EMVSIM_BWT_VAL_REG(base))
#define EMVSIM_WR_BWT_VAL(base, value) (EMVSIM_BWT_VAL_REG(base) = (value))
#define EMVSIM_RMW_BWT_VAL(base, mask, value) (EMVSIM_WR_BWT_VAL(base, (EMVSIM_RD_BWT_VAL(base) & ~(mask)) | (value)))
#define EMVSIM_SET_BWT_VAL(base, value) (BME_OR32(&EMVSIM_BWT_VAL_REG(base), (uint32_t)(value)))
#define EMVSIM_CLR_BWT_VAL(base, value) (BME_AND32(&EMVSIM_BWT_VAL_REG(base), (uint32_t)(~(value))))
#define EMVSIM_TOG_BWT_VAL(base, value) (BME_XOR32(&EMVSIM_BWT_VAL_REG(base), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * EMVSIM_BGT_VAL - Block Guard Time Value Register
 ******************************************************************************/

/*!
 * @brief EMVSIM_BGT_VAL - Block Guard Time Value Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire EMVSIM_BGT_VAL register
 */
/*@{*/
#define EMVSIM_RD_BGT_VAL(base)  (EMVSIM_BGT_VAL_REG(base))
#define EMVSIM_WR_BGT_VAL(base, value) (EMVSIM_BGT_VAL_REG(base) = (value))
#define EMVSIM_RMW_BGT_VAL(base, mask, value) (EMVSIM_WR_BGT_VAL(base, (EMVSIM_RD_BGT_VAL(base) & ~(mask)) | (value)))
#define EMVSIM_SET_BGT_VAL(base, value) (BME_OR32(&EMVSIM_BGT_VAL_REG(base), (uint32_t)(value)))
#define EMVSIM_CLR_BGT_VAL(base, value) (BME_AND32(&EMVSIM_BGT_VAL_REG(base), (uint32_t)(~(value))))
#define EMVSIM_TOG_BGT_VAL(base, value) (BME_XOR32(&EMVSIM_BGT_VAL_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual EMVSIM_BGT_VAL bitfields
 */

/*!
 * @name Register EMVSIM_BGT_VAL, field BGT[15:0] (RW)
 *
 * The value in this register is the block guard time. Time from START bit of
 * last byte sent from the EMV SIM module to the START bit of the first byte sent
 * from the SmartCard must be greater than this value. If it is not, then the BGT
 * flag will be set.
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_BGT_VAL_BGT field. */
#define EMVSIM_RD_BGT_VAL_BGT(base) ((EMVSIM_BGT_VAL_REG(base) & EMVSIM_BGT_VAL_BGT_MASK) >> EMVSIM_BGT_VAL_BGT_SHIFT)
#define EMVSIM_BRD_BGT_VAL_BGT(base) (EMVSIM_RD_BGT_VAL_BGT(base))

/*! @brief Set the BGT field to a new value. */
#define EMVSIM_WR_BGT_VAL_BGT(base, value) (EMVSIM_RMW_BGT_VAL(base, EMVSIM_BGT_VAL_BGT_MASK, EMVSIM_BGT_VAL_BGT(value)))
#define EMVSIM_BWR_BGT_VAL_BGT(base, value) (EMVSIM_WR_BGT_VAL_BGT(base, value))
/*@}*/

/*******************************************************************************
 * EMVSIM_GPCNT0_VAL - General Purpose Counter 0 Timeout Value Register
 ******************************************************************************/

/*!
 * @brief EMVSIM_GPCNT0_VAL - General Purpose Counter 0 Timeout Value Register (RW)
 *
 * Reset value: 0x0000FFFFU
 */
/*!
 * @name Constants and macros for entire EMVSIM_GPCNT0_VAL register
 */
/*@{*/
#define EMVSIM_RD_GPCNT0_VAL(base) (EMVSIM_GPCNT0_VAL_REG(base))
#define EMVSIM_WR_GPCNT0_VAL(base, value) (EMVSIM_GPCNT0_VAL_REG(base) = (value))
#define EMVSIM_RMW_GPCNT0_VAL(base, mask, value) (EMVSIM_WR_GPCNT0_VAL(base, (EMVSIM_RD_GPCNT0_VAL(base) & ~(mask)) | (value)))
#define EMVSIM_SET_GPCNT0_VAL(base, value) (BME_OR32(&EMVSIM_GPCNT0_VAL_REG(base), (uint32_t)(value)))
#define EMVSIM_CLR_GPCNT0_VAL(base, value) (BME_AND32(&EMVSIM_GPCNT0_VAL_REG(base), (uint32_t)(~(value))))
#define EMVSIM_TOG_GPCNT0_VAL(base, value) (BME_XOR32(&EMVSIM_GPCNT0_VAL_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual EMVSIM_GPCNT0_VAL bitfields
 */

/*!
 * @name Register EMVSIM_GPCNT0_VAL, field GPCNT0[15:0] (RW)
 *
 * The value written to this register will be used to compare to the general
 * purpose counter 0 in the EMV SIM module. Once the General purpose counter reaches
 * this value, the GPCNT0 flag in the TX_STATUS register will be set. This
 * counter is intended to be used for any events that must be monitored for duration
 * based on the card clock, receiver sample rate, or ETU rate (transmit clock).
 * Example: ATR arrival time and ATR duration.
 */
/*@{*/
/*! @brief Read current value of the EMVSIM_GPCNT0_VAL_GPCNT0 field. */
#define EMVSIM_RD_GPCNT0_VAL_GPCNT0(base) ((EMVSIM_GPCNT0_VAL_REG(base) & EMVSIM_GPCNT0_VAL_GPCNT0_MASK) >> EMVSIM_GPCNT0_VAL_GPCNT0_SHIFT)
#define EMVSIM_BRD_GPCNT0_VAL_GPCNT0(base) (EMVSIM_RD_GPCNT0_VAL_GPCNT0(base))

/*! @brief Set the GPCNT0 field to a new value. */
#define EMVSIM_WR_GPCNT0_VAL_GPCNT0(base, value) (EMVSIM_RMW_GPCNT0_VAL(base, EMVSIM_GPCNT0_VAL_GPCNT0_MASK, EMVSIM_GPCNT0_VAL_GPCNT0(value)))
#define EMVSIM_BWR_GPCNT0_VAL_GPCNT0(base, value) (EMVSIM_WR_GPCNT0_VAL_GPCNT0(base, value))
/*@}*/

/*******************************************************************************
 * EMVSIM_GPCNT1_VAL - General Purpose Counter 1 Timeout Value
 ******************************************************************************/

/*!
 * @brief EMVSIM_GPCNT1_VAL - General Purpose Counter 1 Timeout Value (RW)
 *
 * Reset value: 0x0000FFFFU
 */
/*!
 * @name Constants and macros for entire EMVSIM_GPCNT1_VAL register
 */
/*@{*/
#define EMVSIM_RD_GPCNT1_VAL(base) (EMVSIM_GPCNT1_VAL_REG(base))
#define EMVSIM_WR_GPCNT1_VAL(base, value) (EMVSIM_GPCNT1_VAL_REG(base) = (value))
#define EMVSIM_RMW_GPCNT1_VAL(base, mask, value) (EMVSIM_WR_GPCNT1_VAL(base, (EMVSIM_RD_GPCNT1_VAL(base) & ~(mask)) | (value)))
#define EMVSIM_SET_GPCNT1_VAL(base, value) (BME_OR32(&EMVSIM_GPCNT1_VAL_REG(base), (uint32_t)(value)))
#define EMVSIM_CLR_GPCNT1_VAL(base, value) (BME_AND32(&EMVSIM_GPCNT1_VAL_REG(base), (uint32_t)(~(value))))
#define EMVSIM_TOG_GPCNT1_VAL(base, value) (BME_XOR32(&EMVSIM_GPCNT1_VAL_REG(base), (uint32_t)(value)))
/*@}*/

