pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * Constants & macros for individual I2S_RMR bitfields
 */

/*!
 * @name Register I2S_RMR, field RWM[15:0] (RW)
 *
 * Configures whether the receive word is masked (received data ignored and not
 * written to receive FIFO) for the corresponding word in the frame.
 *
 * Values:
 * - 0b0000000000000000 - Word N is enabled.
 * - 0b0000000000000001 - Word N is masked.
 */
/*@{*/
/*! @brief Read current value of the I2S_RMR_RWM field. */
#define I2S_RD_RMR_RWM(base) ((I2S_RMR_REG(base) & I2S_RMR_RWM_MASK) >> I2S_RMR_RWM_SHIFT)
#define I2S_BRD_RMR_RWM(base) (I2S_RD_RMR_RWM(base))

/*! @brief Set the RWM field to a new value. */
#define I2S_WR_RMR_RWM(base, value) (I2S_RMW_RMR(base, I2S_RMR_RWM_MASK, I2S_RMR_RWM(value)))
#define I2S_BWR_RMR_RWM(base, value) (I2S_WR_RMR_RWM(base, value))
/*@}*/

/*
 * MKL28Z7 INTMUX
 *
 * Interrupt Multiplexer
 *
 * Registers defined in this header file:
 * - INTMUX_CHn_CSR - Channel n Control Status Register
 * - INTMUX_CHn_VEC - Channel n Vector Number Register
 * - INTMUX_CHn_IER_31_0 - Channel n Interrupt Enable Register
 * - INTMUX_CHn_IPR_31_0 - Channel n Interrupt Pending Register
 */

#define INTMUX_INSTANCE_COUNT (1U) /*!< Number of instances of the INTMUX module. */
#define INTMUX0_IDX (0U) /*!< Instance number for INTMUX0. */

/*******************************************************************************
 * INTMUX_CHn_CSR - Channel n Control Status Register
 ******************************************************************************/

/*!
 * @brief INTMUX_CHn_CSR - Channel n Control Status Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire INTMUX_CHn_CSR register
 */
/*@{*/
#define INTMUX_RD_CHn_CSR(base, index) (INTMUX_CHn_CSR_REG(base, index))
#define INTMUX_WR_CHn_CSR(base, index, value) (INTMUX_CHn_CSR_REG(base, index) = (value))
#define INTMUX_RMW_CHn_CSR(base, index, mask, value) (INTMUX_WR_CHn_CSR(base, index, (INTMUX_RD_CHn_CSR(base, index) & ~(mask)) | (value)))
#define INTMUX_SET_CHn_CSR(base, index, value) (BME_OR32(&INTMUX_CHn_CSR_REG(base, index), (uint32_t)(value)))
#define INTMUX_CLR_CHn_CSR(base, index, value) (BME_AND32(&INTMUX_CHn_CSR_REG(base, index), (uint32_t)(~(value))))
#define INTMUX_TOG_CHn_CSR(base, index, value) (BME_XOR32(&INTMUX_CHn_CSR_REG(base, index), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual INTMUX_CHn_CSR bitfields
 */

/*!
 * @name Register INTMUX_CHn_CSR, field RST[0] (RW)
 *
 * This bit is used to software reset this channel. This bit always reads as 0.
 *
 * Values:
 * - 0b0 - No operation.
 * - 0b1 - Perform a software reset on this channel.
 */
/*@{*/
/*! @brief Read current value of the INTMUX_CHn_CSR_RST field. */
#define INTMUX_RD_CHn_CSR_RST(base, index) ((INTMUX_CHn_CSR_REG(base, index) & INTMUX_CHn_CSR_RST_MASK) >> INTMUX_CHn_CSR_RST_SHIFT)
#define INTMUX_BRD_CHn_CSR_RST(base, index) (BME_UBFX32(&INTMUX_CHn_CSR_REG(base, index), INTMUX_CHn_CSR_RST_SHIFT, INTMUX_CHn_CSR_RST_WIDTH))

/*! @brief Set the RST field to a new value. */
#define INTMUX_WR_CHn_CSR_RST(base, index, value) (INTMUX_RMW_CHn_CSR(base, index, INTMUX_CHn_CSR_RST_MASK, INTMUX_CHn_CSR_RST(value)))
#define INTMUX_BWR_CHn_CSR_RST(base, index, value) (BME_BFI32(&INTMUX_CHn_CSR_REG(base, index), ((uint32_t)(value) << INTMUX_CHn_CSR_RST_SHIFT), INTMUX_CHn_CSR_RST_SHIFT, INTMUX_CHn_CSR_RST_WIDTH))
/*@}*/

/*!
 * @name Register INTMUX_CHn_CSR, field AND[1] (RW)
 *
 * This bit used to Logic AND or Logic OR all enabled interrupt inputs of this
 * channel and generate the interrput output of this channel.
 *
 * Values:
 * - 0b0 - Logic OR all enabled interrupt inputs.
 * - 0b1 - Logic AND all enabled interrupt inputs.
 */
/*@{*/
/*! @brief Read current value of the INTMUX_CHn_CSR_AND field. */
#define INTMUX_RD_CHn_CSR_AND(base, index) ((INTMUX_CHn_CSR_REG(base, index) & INTMUX_CHn_CSR_AND_MASK) >> INTMUX_CHn_CSR_AND_SHIFT)
#define INTMUX_BRD_CHn_CSR_AND(base, index) (BME_UBFX32(&INTMUX_CHn_CSR_REG(base, index), INTMUX_CHn_CSR_AND_SHIFT, INTMUX_CHn_CSR_AND_WIDTH))

/*! @brief Set the AND field to a new value. */
#define INTMUX_WR_CHn_CSR_AND(base, index, value) (INTMUX_RMW_CHn_CSR(base, index, INTMUX_CHn_CSR_AND_MASK, INTMUX_CHn_CSR_AND(value)))
#define INTMUX_BWR_CHn_CSR_AND(base, index, value) (BME_BFI32(&INTMUX_CHn_CSR_REG(base, index), ((uint32_t)(value) << INTMUX_CHn_CSR_AND_SHIFT), INTMUX_CHn_CSR_AND_SHIFT, INTMUX_CHn_CSR_AND_WIDTH))
/*@}*/

/*!
 * @name Register INTMUX_CHn_CSR, field IRQN[5:4] (RO)
 *
 * These bits represent the interrupt input number of this channel.
 *
 * Values:
 * - 0b00 - 32 interrupt inputs
 * - 0b01 - Reserved
 * - 0b10 - Reserved
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the INTMUX_CHn_CSR_IRQN field. */
#define INTMUX_RD_CHn_CSR_IRQN(base, index) ((INTMUX_CHn_CSR_REG(base, index) & INTMUX_CHn_CSR_IRQN_MASK) >> INTMUX_CHn_CSR_IRQN_SHIFT)
#define INTMUX_BRD_CHn_CSR_IRQN(base, index) (BME_UBFX32(&INTMUX_CHn_CSR_REG(base, index), INTMUX_CHn_CSR_IRQN_SHIFT, INTMUX_CHn_CSR_IRQN_WIDTH))
/*@}*/

/*!
 * @name Register INTMUX_CHn_CSR, field CHIN[11:8] (RO)
 *
 * These bits represent the instance number of this channel.
 */
/*@{*/
/*! @brief Read current value of the INTMUX_CHn_CSR_CHIN field. */
#define INTMUX_RD_CHn_CSR_CHIN(base, index) ((INTMUX_CHn_CSR_REG(base, index) & INTMUX_CHn_CSR_CHIN_MASK) >> INTMUX_CHn_CSR_CHIN_SHIFT)
#define INTMUX_BRD_CHn_CSR_CHIN(base, index) (BME_UBFX32(&INTMUX_CHn_CSR_REG(base, index), INTMUX_CHn_CSR_CHIN_SHIFT, INTMUX_CHn_CSR_CHIN_WIDTH))
/*@}*/

/*!
 * @name Register INTMUX_CHn_CSR, field IRQP[31] (RO)
 *
 * This bit is available for polling purposes and represents the channel output.
 *
 * Values:
 * - 0b0 - No interrupt is pending.
 * - 0b1 - The interrupt output of this channel is pending.
 */
/*@{*/
/*! @brief Read current value of the INTMUX_CHn_CSR_IRQP field. */
#define INTMUX_RD_CHn_CSR_IRQP(base, index) ((INTMUX_CHn_CSR_REG(base, index) & INTMUX_CHn_CSR_IRQP_MASK) >> INTMUX_CHn_CSR_IRQP_SHIFT)
#define INTMUX_BRD_CHn_CSR_IRQP(base, index) (BME_UBFX32(&INTMUX_CHn_CSR_REG(base, index), INTMUX_CHn_CSR_IRQP_SHIFT, INTMUX_CHn_CSR_IRQP_WIDTH))
/*@}*/

