pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * INTMUX_CHn_VEC - Channel n Vector Number Register
 ******************************************************************************/

/*!
 * @brief INTMUX_CHn_VEC - Channel n Vector Number Register (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire INTMUX_CHn_VEC register
 */
/*@{*/
#define INTMUX_RD_CHn_VEC(base, index) (INTMUX_CHn_VEC_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual INTMUX_CHn_VEC bitfields
 */

/*!
 * @name Register INTMUX_CHn_VEC, field VECN[13:2] (RO)
 *
 * These bits represent the vector number for the highest priority interrupt
 * source of this channel.
 */
/*@{*/
/*! @brief Read current value of the INTMUX_CHn_VEC_VECN field. */
#define INTMUX_RD_CHn_VEC_VECN(base, index) ((INTMUX_CHn_VEC_REG(base, index) & INTMUX_CHn_VEC_VECN_MASK) >> INTMUX_CHn_VEC_VECN_SHIFT)
#define INTMUX_BRD_CHn_VEC_VECN(base, index) (INTMUX_RD_CHn_VEC_VECN(base, index))
/*@}*/

/*******************************************************************************
 * INTMUX_CHn_IER_31_0 - Channel n Interrupt Enable Register
 ******************************************************************************/

/*!
 * @brief INTMUX_CHn_IER_31_0 - Channel n Interrupt Enable Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire INTMUX_CHn_IER_31_0 register
 */
/*@{*/
#define INTMUX_RD_CHn_IER_31_0(base, index) (INTMUX_CHn_IER_31_0_REG(base, index))
#define INTMUX_WR_CHn_IER_31_0(base, index, value) (INTMUX_CHn_IER_31_0_REG(base, index) = (value))
#define INTMUX_RMW_CHn_IER_31_0(base, index, mask, value) (INTMUX_WR_CHn_IER_31_0(base, index, (INTMUX_RD_CHn_IER_31_0(base, index) & ~(mask)) | (value)))
#define INTMUX_SET_CHn_IER_31_0(base, index, value) (BME_OR32(&INTMUX_CHn_IER_31_0_REG(base, index), (uint32_t)(value)))
#define INTMUX_CLR_CHn_IER_31_0(base, index, value) (BME_AND32(&INTMUX_CHn_IER_31_0_REG(base, index), (uint32_t)(~(value))))
#define INTMUX_TOG_CHn_IER_31_0(base, index, value) (BME_XOR32(&INTMUX_CHn_IER_31_0_REG(base, index), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * INTMUX_CHn_IPR_31_0 - Channel n Interrupt Pending Register
 ******************************************************************************/

/*!
 * @brief INTMUX_CHn_IPR_31_0 - Channel n Interrupt Pending Register (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire INTMUX_CHn_IPR_31_0 register
 */
/*@{*/
#define INTMUX_RD_CHn_IPR_31_0(base, index) (INTMUX_CHn_IPR_31_0_REG(base, index))
/*@}*/

/*
 * MKL28Z7 LLWU
 *
 * Low leakage wakeup unit
 *
 * Registers defined in this header file:
 * - LLWU_VERID - Version ID Register
 * - LLWU_PARAM - Parameter Register
 * - LLWU_PE1 - LLWU Pin Enable 1 register
 * - LLWU_PE2 - LLWU Pin Enable 2 register
 * - LLWU_ME - LLWU Module Interrupt Enable register
 * - LLWU_DE - LLWU Module DMA Enable register
 * - LLWU_PF - LLWU Pin Flag register
 * - LLWU_MF - LLWU Module Interrupt Flag register
 * - LLWU_FILT - LLWU Pin Filter register
 */

#define LLWU_INSTANCE_COUNT (1U) /*!< Number of instances of the LLWU module. */
#define LLWU0_IDX (0U) /*!< Instance number for LLWU0. */

/*******************************************************************************
 * LLWU_VERID - Version ID Register
 ******************************************************************************/

/*!
 * @brief LLWU_VERID - Version ID Register (RO)
 *
 * Reset value: 0x01000000U
 */
/*!
 * @name Constants and macros for entire LLWU_VERID register
 */
/*@{*/
#define LLWU_RD_VERID(base)      (LLWU_VERID_REG(base))
/*@}*/

/*
 * Constants & macros for individual LLWU_VERID bitfields
 */

/*!
 * @name Register LLWU_VERID, field FEATURE[15:0] (RO)
 *
 * This read only field returns the feature set number.
 *
 * Values:
 * - 0b0000000000000000 - Standard features implemented
 */
/*@{*/
/*! @brief Read current value of the LLWU_VERID_FEATURE field. */
#define LLWU_RD_VERID_FEATURE(base) ((LLWU_VERID_REG(base) & LLWU_VERID_FEATURE_MASK) >> LLWU_VERID_FEATURE_SHIFT)
#define LLWU_BRD_VERID_FEATURE(base) (LLWU_RD_VERID_FEATURE(base))
/*@}*/

/*!
 * @name Register LLWU_VERID, field MINOR[23:16] (RO)
 *
 * This read only field returns the minor version number for the module
 * specification.
 */
/*@{*/
/*! @brief Read current value of the LLWU_VERID_MINOR field. */
#define LLWU_RD_VERID_MINOR(base) ((LLWU_VERID_REG(base) & LLWU_VERID_MINOR_MASK) >> LLWU_VERID_MINOR_SHIFT)
#define LLWU_BRD_VERID_MINOR(base) (BME_UBFX32(&LLWU_VERID_REG(base), LLWU_VERID_MINOR_SHIFT, LLWU_VERID_MINOR_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_VERID, field MAJOR[31:24] (RO)
 *
 * This read only field returns the major version number for the module
 * specification.
 */
/*@{*/
/*! @brief Read current value of the LLWU_VERID_MAJOR field. */
#define LLWU_RD_VERID_MAJOR(base) ((LLWU_VERID_REG(base) & LLWU_VERID_MAJOR_MASK) >> LLWU_VERID_MAJOR_SHIFT)
#define LLWU_BRD_VERID_MAJOR(base) (BME_UBFX32(&LLWU_VERID_REG(base), LLWU_VERID_MAJOR_SHIFT, LLWU_VERID_MAJOR_WIDTH))
/*@}*/

/*******************************************************************************
 * LLWU_PARAM - Parameter Register
 ******************************************************************************/

/*!
 * @brief LLWU_PARAM - Parameter Register (RO)
 *
 * Reset value: 0x20080804U
 */
/*!
 * @name Constants and macros for entire LLWU_PARAM register
 */
/*@{*/
#define LLWU_RD_PARAM(base)      (LLWU_PARAM_REG(base))
/*@}*/

/*
 * Constants & macros for individual LLWU_PARAM bitfields
 */

/*!
 * @name Register LLWU_PARAM, field FILTERS[7:0] (RO)
 *
 * Number of Pin Filters implemented
 */
/*@{*/
/*! @brief Read current value of the LLWU_PARAM_FILTERS field. */
#define LLWU_RD_PARAM_FILTERS(base) ((LLWU_PARAM_REG(base) & LLWU_PARAM_FILTERS_MASK) >> LLWU_PARAM_FILTERS_SHIFT)
#define LLWU_BRD_PARAM_FILTERS(base) (BME_UBFX32(&LLWU_PARAM_REG(base), LLWU_PARAM_FILTERS_SHIFT, LLWU_PARAM_FILTERS_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PARAM, field DMAS[15:8] (RO)
 *
 * Number of DMA wakeup sources supported
 */
/*@{*/
/*! @brief Read current value of the LLWU_PARAM_DMAS field. */
#define LLWU_RD_PARAM_DMAS(base) ((LLWU_PARAM_REG(base) & LLWU_PARAM_DMAS_MASK) >> LLWU_PARAM_DMAS_SHIFT)
#define LLWU_BRD_PARAM_DMAS(base) (BME_UBFX32(&LLWU_PARAM_REG(base), LLWU_PARAM_DMAS_SHIFT, LLWU_PARAM_DMAS_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PARAM, field MODULES[23:16] (RO)
 *
 * Number of Module wakeup sources supported
 */
/*@{*/
/*! @brief Read current value of the LLWU_PARAM_MODULES field. */
#define LLWU_RD_PARAM_MODULES(base) ((LLWU_PARAM_REG(base) & LLWU_PARAM_MODULES_MASK) >> LLWU_PARAM_MODULES_SHIFT)
#define LLWU_BRD_PARAM_MODULES(base) (BME_UBFX32(&LLWU_PARAM_REG(base), LLWU_PARAM_MODULES_SHIFT, LLWU_PARAM_MODULES_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PARAM, field PINS[31:24] (RO)
 *
 * Number of Pin wakeup sources supported
 */
/*@{*/
/*! @brief Read current value of the LLWU_PARAM_PINS field. */
#define LLWU_RD_PARAM_PINS(base) ((LLWU_PARAM_REG(base) & LLWU_PARAM_PINS_MASK) >> LLWU_PARAM_PINS_SHIFT)
#define LLWU_BRD_PARAM_PINS(base) (BME_UBFX32(&LLWU_PARAM_REG(base), LLWU_PARAM_PINS_SHIFT, LLWU_PARAM_PINS_WIDTH))
/*@}*/

