pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * LLWU_PE1 - LLWU Pin Enable 1 register
 ******************************************************************************/

/*!
 * @brief LLWU_PE1 - LLWU Pin Enable 1 register (RW)
 *
 * Reset value: 0x00000000U
 *
 * LLWU_PE1 contains the field to enable and select the edge detect type for the
 * external wakeup input pins LLWU_P15-LLWU_P0. This register is reset on Chip
 * Reset not VLLS and by reset types that trigger Chip Reset not VLLS. It is
 * unaffected by reset types that do not trigger Chip Reset not VLLS. See the
 * IntroductionInformation found here describes the registers of the Reset Control Module
 * (RCM). The RCM implements many of the reset functions for the chip. See the
 * chip's reset chapter for more information. details for more information.
 */
/*!
 * @name Constants and macros for entire LLWU_PE1 register
 */
/*@{*/
#define LLWU_RD_PE1(base)        (LLWU_PE1_REG(base))
#define LLWU_WR_PE1(base, value) (LLWU_PE1_REG(base) = (value))
#define LLWU_RMW_PE1(base, mask, value) (LLWU_WR_PE1(base, (LLWU_RD_PE1(base) & ~(mask)) | (value)))
#define LLWU_SET_PE1(base, value) (BME_OR32(&LLWU_PE1_REG(base), (uint32_t)(value)))
#define LLWU_CLR_PE1(base, value) (BME_AND32(&LLWU_PE1_REG(base), (uint32_t)(~(value))))
#define LLWU_TOG_PE1(base, value) (BME_XOR32(&LLWU_PE1_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LLWU_PE1 bitfields
 */

/*!
 * @name Register LLWU_PE1, field WUPE0[1:0] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE1_WUPE0 field. */
#define LLWU_RD_PE1_WUPE0(base) ((LLWU_PE1_REG(base) & LLWU_PE1_WUPE0_MASK) >> LLWU_PE1_WUPE0_SHIFT)
#define LLWU_BRD_PE1_WUPE0(base) (BME_UBFX32(&LLWU_PE1_REG(base), LLWU_PE1_WUPE0_SHIFT, LLWU_PE1_WUPE0_WIDTH))

/*! @brief Set the WUPE0 field to a new value. */
#define LLWU_WR_PE1_WUPE0(base, value) (LLWU_RMW_PE1(base, LLWU_PE1_WUPE0_MASK, LLWU_PE1_WUPE0(value)))
#define LLWU_BWR_PE1_WUPE0(base, value) (BME_BFI32(&LLWU_PE1_REG(base), ((uint32_t)(value) << LLWU_PE1_WUPE0_SHIFT), LLWU_PE1_WUPE0_SHIFT, LLWU_PE1_WUPE0_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE1, field WUPE1[3:2] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE1_WUPE1 field. */
#define LLWU_RD_PE1_WUPE1(base) ((LLWU_PE1_REG(base) & LLWU_PE1_WUPE1_MASK) >> LLWU_PE1_WUPE1_SHIFT)
#define LLWU_BRD_PE1_WUPE1(base) (BME_UBFX32(&LLWU_PE1_REG(base), LLWU_PE1_WUPE1_SHIFT, LLWU_PE1_WUPE1_WIDTH))

/*! @brief Set the WUPE1 field to a new value. */
#define LLWU_WR_PE1_WUPE1(base, value) (LLWU_RMW_PE1(base, LLWU_PE1_WUPE1_MASK, LLWU_PE1_WUPE1(value)))
#define LLWU_BWR_PE1_WUPE1(base, value) (BME_BFI32(&LLWU_PE1_REG(base), ((uint32_t)(value) << LLWU_PE1_WUPE1_SHIFT), LLWU_PE1_WUPE1_SHIFT, LLWU_PE1_WUPE1_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE1, field WUPE2[5:4] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE1_WUPE2 field. */
#define LLWU_RD_PE1_WUPE2(base) ((LLWU_PE1_REG(base) & LLWU_PE1_WUPE2_MASK) >> LLWU_PE1_WUPE2_SHIFT)
#define LLWU_BRD_PE1_WUPE2(base) (BME_UBFX32(&LLWU_PE1_REG(base), LLWU_PE1_WUPE2_SHIFT, LLWU_PE1_WUPE2_WIDTH))

/*! @brief Set the WUPE2 field to a new value. */
#define LLWU_WR_PE1_WUPE2(base, value) (LLWU_RMW_PE1(base, LLWU_PE1_WUPE2_MASK, LLWU_PE1_WUPE2(value)))
#define LLWU_BWR_PE1_WUPE2(base, value) (BME_BFI32(&LLWU_PE1_REG(base), ((uint32_t)(value) << LLWU_PE1_WUPE2_SHIFT), LLWU_PE1_WUPE2_SHIFT, LLWU_PE1_WUPE2_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE1, field WUPE3[7:6] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE1_WUPE3 field. */
#define LLWU_RD_PE1_WUPE3(base) ((LLWU_PE1_REG(base) & LLWU_PE1_WUPE3_MASK) >> LLWU_PE1_WUPE3_SHIFT)
#define LLWU_BRD_PE1_WUPE3(base) (BME_UBFX32(&LLWU_PE1_REG(base), LLWU_PE1_WUPE3_SHIFT, LLWU_PE1_WUPE3_WIDTH))

/*! @brief Set the WUPE3 field to a new value. */
#define LLWU_WR_PE1_WUPE3(base, value) (LLWU_RMW_PE1(base, LLWU_PE1_WUPE3_MASK, LLWU_PE1_WUPE3(value)))
#define LLWU_BWR_PE1_WUPE3(base, value) (BME_BFI32(&LLWU_PE1_REG(base), ((uint32_t)(value) << LLWU_PE1_WUPE3_SHIFT), LLWU_PE1_WUPE3_SHIFT, LLWU_PE1_WUPE3_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE1, field WUPE4[9:8] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE1_WUPE4 field. */
#define LLWU_RD_PE1_WUPE4(base) ((LLWU_PE1_REG(base) & LLWU_PE1_WUPE4_MASK) >> LLWU_PE1_WUPE4_SHIFT)
#define LLWU_BRD_PE1_WUPE4(base) (BME_UBFX32(&LLWU_PE1_REG(base), LLWU_PE1_WUPE4_SHIFT, LLWU_PE1_WUPE4_WIDTH))

/*! @brief Set the WUPE4 field to a new value. */
#define LLWU_WR_PE1_WUPE4(base, value) (LLWU_RMW_PE1(base, LLWU_PE1_WUPE4_MASK, LLWU_PE1_WUPE4(value)))
#define LLWU_BWR_PE1_WUPE4(base, value) (BME_BFI32(&LLWU_PE1_REG(base), ((uint32_t)(value) << LLWU_PE1_WUPE4_SHIFT), LLWU_PE1_WUPE4_SHIFT, LLWU_PE1_WUPE4_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE1, field WUPE5[11:10] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE1_WUPE5 field. */
#define LLWU_RD_PE1_WUPE5(base) ((LLWU_PE1_REG(base) & LLWU_PE1_WUPE5_MASK) >> LLWU_PE1_WUPE5_SHIFT)
#define LLWU_BRD_PE1_WUPE5(base) (BME_UBFX32(&LLWU_PE1_REG(base), LLWU_PE1_WUPE5_SHIFT, LLWU_PE1_WUPE5_WIDTH))

/*! @brief Set the WUPE5 field to a new value. */
#define LLWU_WR_PE1_WUPE5(base, value) (LLWU_RMW_PE1(base, LLWU_PE1_WUPE5_MASK, LLWU_PE1_WUPE5(value)))
#define LLWU_BWR_PE1_WUPE5(base, value) (BME_BFI32(&LLWU_PE1_REG(base), ((uint32_t)(value) << LLWU_PE1_WUPE5_SHIFT), LLWU_PE1_WUPE5_SHIFT, LLWU_PE1_WUPE5_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE1, field WUPE6[13:12] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE1_WUPE6 field. */
#define LLWU_RD_PE1_WUPE6(base) ((LLWU_PE1_REG(base) & LLWU_PE1_WUPE6_MASK) >> LLWU_PE1_WUPE6_SHIFT)
#define LLWU_BRD_PE1_WUPE6(base) (BME_UBFX32(&LLWU_PE1_REG(base), LLWU_PE1_WUPE6_SHIFT, LLWU_PE1_WUPE6_WIDTH))

/*! @brief Set the WUPE6 field to a new value. */
#define LLWU_WR_PE1_WUPE6(base, value) (LLWU_RMW_PE1(base, LLWU_PE1_WUPE6_MASK, LLWU_PE1_WUPE6(value)))
#define LLWU_BWR_PE1_WUPE6(base, value) (BME_BFI32(&LLWU_PE1_REG(base), ((uint32_t)(value) << LLWU_PE1_WUPE6_SHIFT), LLWU_PE1_WUPE6_SHIFT, LLWU_PE1_WUPE6_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE1, field WUPE7[15:14] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE1_WUPE7 field. */
#define LLWU_RD_PE1_WUPE7(base) ((LLWU_PE1_REG(base) & LLWU_PE1_WUPE7_MASK) >> LLWU_PE1_WUPE7_SHIFT)
#define LLWU_BRD_PE1_WUPE7(base) (BME_UBFX32(&LLWU_PE1_REG(base), LLWU_PE1_WUPE7_SHIFT, LLWU_PE1_WUPE7_WIDTH))

/*! @brief Set the WUPE7 field to a new value. */
#define LLWU_WR_PE1_WUPE7(base, value) (LLWU_RMW_PE1(base, LLWU_PE1_WUPE7_MASK, LLWU_PE1_WUPE7(value)))
#define LLWU_BWR_PE1_WUPE7(base, value) (BME_BFI32(&LLWU_PE1_REG(base), ((uint32_t)(value) << LLWU_PE1_WUPE7_SHIFT), LLWU_PE1_WUPE7_SHIFT, LLWU_PE1_WUPE7_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE1, field WUPE8[17:16] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE1_WUPE8 field. */
#define LLWU_RD_PE1_WUPE8(base) ((LLWU_PE1_REG(base) & LLWU_PE1_WUPE8_MASK) >> LLWU_PE1_WUPE8_SHIFT)
#define LLWU_BRD_PE1_WUPE8(base) (BME_UBFX32(&LLWU_PE1_REG(base), LLWU_PE1_WUPE8_SHIFT, LLWU_PE1_WUPE8_WIDTH))

/*! @brief Set the WUPE8 field to a new value. */
#define LLWU_WR_PE1_WUPE8(base, value) (LLWU_RMW_PE1(base, LLWU_PE1_WUPE8_MASK, LLWU_PE1_WUPE8(value)))
#define LLWU_BWR_PE1_WUPE8(base, value) (BME_BFI32(&LLWU_PE1_REG(base), ((uint32_t)(value) << LLWU_PE1_WUPE8_SHIFT), LLWU_PE1_WUPE8_SHIFT, LLWU_PE1_WUPE8_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE1, field WUPE9[19:18] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE1_WUPE9 field. */
#define LLWU_RD_PE1_WUPE9(base) ((LLWU_PE1_REG(base) & LLWU_PE1_WUPE9_MASK) >> LLWU_PE1_WUPE9_SHIFT)
#define LLWU_BRD_PE1_WUPE9(base) (BME_UBFX32(&LLWU_PE1_REG(base), LLWU_PE1_WUPE9_SHIFT, LLWU_PE1_WUPE9_WIDTH))

