pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the WUPE9 field to a new value. */
#define LLWU_WR_PE1_WUPE9(base, value) (LLWU_RMW_PE1(base, LLWU_PE1_WUPE9_MASK, LLWU_PE1_WUPE9(value)))
#define LLWU_BWR_PE1_WUPE9(base, value) (BME_BFI32(&LLWU_PE1_REG(base), ((uint32_t)(value) << LLWU_PE1_WUPE9_SHIFT), LLWU_PE1_WUPE9_SHIFT, LLWU_PE1_WUPE9_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE1, field WUPE10[21:20] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE1_WUPE10 field. */
#define LLWU_RD_PE1_WUPE10(base) ((LLWU_PE1_REG(base) & LLWU_PE1_WUPE10_MASK) >> LLWU_PE1_WUPE10_SHIFT)
#define LLWU_BRD_PE1_WUPE10(base) (BME_UBFX32(&LLWU_PE1_REG(base), LLWU_PE1_WUPE10_SHIFT, LLWU_PE1_WUPE10_WIDTH))

/*! @brief Set the WUPE10 field to a new value. */
#define LLWU_WR_PE1_WUPE10(base, value) (LLWU_RMW_PE1(base, LLWU_PE1_WUPE10_MASK, LLWU_PE1_WUPE10(value)))
#define LLWU_BWR_PE1_WUPE10(base, value) (BME_BFI32(&LLWU_PE1_REG(base), ((uint32_t)(value) << LLWU_PE1_WUPE10_SHIFT), LLWU_PE1_WUPE10_SHIFT, LLWU_PE1_WUPE10_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE1, field WUPE11[23:22] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE1_WUPE11 field. */
#define LLWU_RD_PE1_WUPE11(base) ((LLWU_PE1_REG(base) & LLWU_PE1_WUPE11_MASK) >> LLWU_PE1_WUPE11_SHIFT)
#define LLWU_BRD_PE1_WUPE11(base) (BME_UBFX32(&LLWU_PE1_REG(base), LLWU_PE1_WUPE11_SHIFT, LLWU_PE1_WUPE11_WIDTH))

/*! @brief Set the WUPE11 field to a new value. */
#define LLWU_WR_PE1_WUPE11(base, value) (LLWU_RMW_PE1(base, LLWU_PE1_WUPE11_MASK, LLWU_PE1_WUPE11(value)))
#define LLWU_BWR_PE1_WUPE11(base, value) (BME_BFI32(&LLWU_PE1_REG(base), ((uint32_t)(value) << LLWU_PE1_WUPE11_SHIFT), LLWU_PE1_WUPE11_SHIFT, LLWU_PE1_WUPE11_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE1, field WUPE12[25:24] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE1_WUPE12 field. */
#define LLWU_RD_PE1_WUPE12(base) ((LLWU_PE1_REG(base) & LLWU_PE1_WUPE12_MASK) >> LLWU_PE1_WUPE12_SHIFT)
#define LLWU_BRD_PE1_WUPE12(base) (BME_UBFX32(&LLWU_PE1_REG(base), LLWU_PE1_WUPE12_SHIFT, LLWU_PE1_WUPE12_WIDTH))

/*! @brief Set the WUPE12 field to a new value. */
#define LLWU_WR_PE1_WUPE12(base, value) (LLWU_RMW_PE1(base, LLWU_PE1_WUPE12_MASK, LLWU_PE1_WUPE12(value)))
#define LLWU_BWR_PE1_WUPE12(base, value) (BME_BFI32(&LLWU_PE1_REG(base), ((uint32_t)(value) << LLWU_PE1_WUPE12_SHIFT), LLWU_PE1_WUPE12_SHIFT, LLWU_PE1_WUPE12_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE1, field WUPE13[27:26] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE1_WUPE13 field. */
#define LLWU_RD_PE1_WUPE13(base) ((LLWU_PE1_REG(base) & LLWU_PE1_WUPE13_MASK) >> LLWU_PE1_WUPE13_SHIFT)
#define LLWU_BRD_PE1_WUPE13(base) (BME_UBFX32(&LLWU_PE1_REG(base), LLWU_PE1_WUPE13_SHIFT, LLWU_PE1_WUPE13_WIDTH))

/*! @brief Set the WUPE13 field to a new value. */
#define LLWU_WR_PE1_WUPE13(base, value) (LLWU_RMW_PE1(base, LLWU_PE1_WUPE13_MASK, LLWU_PE1_WUPE13(value)))
#define LLWU_BWR_PE1_WUPE13(base, value) (BME_BFI32(&LLWU_PE1_REG(base), ((uint32_t)(value) << LLWU_PE1_WUPE13_SHIFT), LLWU_PE1_WUPE13_SHIFT, LLWU_PE1_WUPE13_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE1, field WUPE14[29:28] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE1_WUPE14 field. */
#define LLWU_RD_PE1_WUPE14(base) ((LLWU_PE1_REG(base) & LLWU_PE1_WUPE14_MASK) >> LLWU_PE1_WUPE14_SHIFT)
#define LLWU_BRD_PE1_WUPE14(base) (BME_UBFX32(&LLWU_PE1_REG(base), LLWU_PE1_WUPE14_SHIFT, LLWU_PE1_WUPE14_WIDTH))

/*! @brief Set the WUPE14 field to a new value. */
#define LLWU_WR_PE1_WUPE14(base, value) (LLWU_RMW_PE1(base, LLWU_PE1_WUPE14_MASK, LLWU_PE1_WUPE14(value)))
#define LLWU_BWR_PE1_WUPE14(base, value) (BME_BFI32(&LLWU_PE1_REG(base), ((uint32_t)(value) << LLWU_PE1_WUPE14_SHIFT), LLWU_PE1_WUPE14_SHIFT, LLWU_PE1_WUPE14_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE1, field WUPE15[31:30] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE1_WUPE15 field. */
#define LLWU_RD_PE1_WUPE15(base) ((LLWU_PE1_REG(base) & LLWU_PE1_WUPE15_MASK) >> LLWU_PE1_WUPE15_SHIFT)
#define LLWU_BRD_PE1_WUPE15(base) (BME_UBFX32(&LLWU_PE1_REG(base), LLWU_PE1_WUPE15_SHIFT, LLWU_PE1_WUPE15_WIDTH))

/*! @brief Set the WUPE15 field to a new value. */
#define LLWU_WR_PE1_WUPE15(base, value) (LLWU_RMW_PE1(base, LLWU_PE1_WUPE15_MASK, LLWU_PE1_WUPE15(value)))
#define LLWU_BWR_PE1_WUPE15(base, value) (BME_BFI32(&LLWU_PE1_REG(base), ((uint32_t)(value) << LLWU_PE1_WUPE15_SHIFT), LLWU_PE1_WUPE15_SHIFT, LLWU_PE1_WUPE15_WIDTH))
/*@}*/

