pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * LLWU_PE2 - LLWU Pin Enable 2 register
 ******************************************************************************/

/*!
 * @brief LLWU_PE2 - LLWU Pin Enable 2 register (RW)
 *
 * Reset value: 0x00000000U
 *
 * LLWU_PE2 contains the field to enable and select the edge detect type for the
 * external wakeup input pins LLWU_P31-LLWU_P16. This register is reset on Chip
 * Reset not VLLS and by reset types that trigger Chip Reset not VLLS. It is
 * unaffected by reset types that do not trigger Chip Reset not VLLS. See the
 * IntroductionInformation found here describes the registers of the Reset Control
 * Module (RCM). The RCM implements many of the reset functions for the chip. See the
 * chip's reset chapter for more information. details for more information.
 */
/*!
 * @name Constants and macros for entire LLWU_PE2 register
 */
/*@{*/
#define LLWU_RD_PE2(base)        (LLWU_PE2_REG(base))
#define LLWU_WR_PE2(base, value) (LLWU_PE2_REG(base) = (value))
#define LLWU_RMW_PE2(base, mask, value) (LLWU_WR_PE2(base, (LLWU_RD_PE2(base) & ~(mask)) | (value)))
#define LLWU_SET_PE2(base, value) (BME_OR32(&LLWU_PE2_REG(base), (uint32_t)(value)))
#define LLWU_CLR_PE2(base, value) (BME_AND32(&LLWU_PE2_REG(base), (uint32_t)(~(value))))
#define LLWU_TOG_PE2(base, value) (BME_XOR32(&LLWU_PE2_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LLWU_PE2 bitfields
 */

/*!
 * @name Register LLWU_PE2, field WUPE16[1:0] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE2_WUPE16 field. */
#define LLWU_RD_PE2_WUPE16(base) ((LLWU_PE2_REG(base) & LLWU_PE2_WUPE16_MASK) >> LLWU_PE2_WUPE16_SHIFT)
#define LLWU_BRD_PE2_WUPE16(base) (BME_UBFX32(&LLWU_PE2_REG(base), LLWU_PE2_WUPE16_SHIFT, LLWU_PE2_WUPE16_WIDTH))

/*! @brief Set the WUPE16 field to a new value. */
#define LLWU_WR_PE2_WUPE16(base, value) (LLWU_RMW_PE2(base, LLWU_PE2_WUPE16_MASK, LLWU_PE2_WUPE16(value)))
#define LLWU_BWR_PE2_WUPE16(base, value) (BME_BFI32(&LLWU_PE2_REG(base), ((uint32_t)(value) << LLWU_PE2_WUPE16_SHIFT), LLWU_PE2_WUPE16_SHIFT, LLWU_PE2_WUPE16_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE2, field WUPE17[3:2] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE2_WUPE17 field. */
#define LLWU_RD_PE2_WUPE17(base) ((LLWU_PE2_REG(base) & LLWU_PE2_WUPE17_MASK) >> LLWU_PE2_WUPE17_SHIFT)
#define LLWU_BRD_PE2_WUPE17(base) (BME_UBFX32(&LLWU_PE2_REG(base), LLWU_PE2_WUPE17_SHIFT, LLWU_PE2_WUPE17_WIDTH))

/*! @brief Set the WUPE17 field to a new value. */
#define LLWU_WR_PE2_WUPE17(base, value) (LLWU_RMW_PE2(base, LLWU_PE2_WUPE17_MASK, LLWU_PE2_WUPE17(value)))
#define LLWU_BWR_PE2_WUPE17(base, value) (BME_BFI32(&LLWU_PE2_REG(base), ((uint32_t)(value) << LLWU_PE2_WUPE17_SHIFT), LLWU_PE2_WUPE17_SHIFT, LLWU_PE2_WUPE17_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE2, field WUPE18[5:4] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE2_WUPE18 field. */
#define LLWU_RD_PE2_WUPE18(base) ((LLWU_PE2_REG(base) & LLWU_PE2_WUPE18_MASK) >> LLWU_PE2_WUPE18_SHIFT)
#define LLWU_BRD_PE2_WUPE18(base) (BME_UBFX32(&LLWU_PE2_REG(base), LLWU_PE2_WUPE18_SHIFT, LLWU_PE2_WUPE18_WIDTH))

/*! @brief Set the WUPE18 field to a new value. */
#define LLWU_WR_PE2_WUPE18(base, value) (LLWU_RMW_PE2(base, LLWU_PE2_WUPE18_MASK, LLWU_PE2_WUPE18(value)))
#define LLWU_BWR_PE2_WUPE18(base, value) (BME_BFI32(&LLWU_PE2_REG(base), ((uint32_t)(value) << LLWU_PE2_WUPE18_SHIFT), LLWU_PE2_WUPE18_SHIFT, LLWU_PE2_WUPE18_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE2, field WUPE19[7:6] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE2_WUPE19 field. */
#define LLWU_RD_PE2_WUPE19(base) ((LLWU_PE2_REG(base) & LLWU_PE2_WUPE19_MASK) >> LLWU_PE2_WUPE19_SHIFT)
#define LLWU_BRD_PE2_WUPE19(base) (BME_UBFX32(&LLWU_PE2_REG(base), LLWU_PE2_WUPE19_SHIFT, LLWU_PE2_WUPE19_WIDTH))

/*! @brief Set the WUPE19 field to a new value. */
#define LLWU_WR_PE2_WUPE19(base, value) (LLWU_RMW_PE2(base, LLWU_PE2_WUPE19_MASK, LLWU_PE2_WUPE19(value)))
#define LLWU_BWR_PE2_WUPE19(base, value) (BME_BFI32(&LLWU_PE2_REG(base), ((uint32_t)(value) << LLWU_PE2_WUPE19_SHIFT), LLWU_PE2_WUPE19_SHIFT, LLWU_PE2_WUPE19_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE2, field WUPE20[9:8] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE2_WUPE20 field. */
#define LLWU_RD_PE2_WUPE20(base) ((LLWU_PE2_REG(base) & LLWU_PE2_WUPE20_MASK) >> LLWU_PE2_WUPE20_SHIFT)
#define LLWU_BRD_PE2_WUPE20(base) (BME_UBFX32(&LLWU_PE2_REG(base), LLWU_PE2_WUPE20_SHIFT, LLWU_PE2_WUPE20_WIDTH))

/*! @brief Set the WUPE20 field to a new value. */
#define LLWU_WR_PE2_WUPE20(base, value) (LLWU_RMW_PE2(base, LLWU_PE2_WUPE20_MASK, LLWU_PE2_WUPE20(value)))
#define LLWU_BWR_PE2_WUPE20(base, value) (BME_BFI32(&LLWU_PE2_REG(base), ((uint32_t)(value) << LLWU_PE2_WUPE20_SHIFT), LLWU_PE2_WUPE20_SHIFT, LLWU_PE2_WUPE20_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE2, field WUPE21[11:10] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE2_WUPE21 field. */
#define LLWU_RD_PE2_WUPE21(base) ((LLWU_PE2_REG(base) & LLWU_PE2_WUPE21_MASK) >> LLWU_PE2_WUPE21_SHIFT)
#define LLWU_BRD_PE2_WUPE21(base) (BME_UBFX32(&LLWU_PE2_REG(base), LLWU_PE2_WUPE21_SHIFT, LLWU_PE2_WUPE21_WIDTH))

