pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the WUPE21 field to a new value. */
#define LLWU_WR_PE2_WUPE21(base, value) (LLWU_RMW_PE2(base, LLWU_PE2_WUPE21_MASK, LLWU_PE2_WUPE21(value)))
#define LLWU_BWR_PE2_WUPE21(base, value) (BME_BFI32(&LLWU_PE2_REG(base), ((uint32_t)(value) << LLWU_PE2_WUPE21_SHIFT), LLWU_PE2_WUPE21_SHIFT, LLWU_PE2_WUPE21_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE2, field WUPE22[13:12] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE2_WUPE22 field. */
#define LLWU_RD_PE2_WUPE22(base) ((LLWU_PE2_REG(base) & LLWU_PE2_WUPE22_MASK) >> LLWU_PE2_WUPE22_SHIFT)
#define LLWU_BRD_PE2_WUPE22(base) (BME_UBFX32(&LLWU_PE2_REG(base), LLWU_PE2_WUPE22_SHIFT, LLWU_PE2_WUPE22_WIDTH))

/*! @brief Set the WUPE22 field to a new value. */
#define LLWU_WR_PE2_WUPE22(base, value) (LLWU_RMW_PE2(base, LLWU_PE2_WUPE22_MASK, LLWU_PE2_WUPE22(value)))
#define LLWU_BWR_PE2_WUPE22(base, value) (BME_BFI32(&LLWU_PE2_REG(base), ((uint32_t)(value) << LLWU_PE2_WUPE22_SHIFT), LLWU_PE2_WUPE22_SHIFT, LLWU_PE2_WUPE22_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE2, field WUPE23[15:14] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE2_WUPE23 field. */
#define LLWU_RD_PE2_WUPE23(base) ((LLWU_PE2_REG(base) & LLWU_PE2_WUPE23_MASK) >> LLWU_PE2_WUPE23_SHIFT)
#define LLWU_BRD_PE2_WUPE23(base) (BME_UBFX32(&LLWU_PE2_REG(base), LLWU_PE2_WUPE23_SHIFT, LLWU_PE2_WUPE23_WIDTH))

/*! @brief Set the WUPE23 field to a new value. */
#define LLWU_WR_PE2_WUPE23(base, value) (LLWU_RMW_PE2(base, LLWU_PE2_WUPE23_MASK, LLWU_PE2_WUPE23(value)))
#define LLWU_BWR_PE2_WUPE23(base, value) (BME_BFI32(&LLWU_PE2_REG(base), ((uint32_t)(value) << LLWU_PE2_WUPE23_SHIFT), LLWU_PE2_WUPE23_SHIFT, LLWU_PE2_WUPE23_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE2, field WUPE24[17:16] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE2_WUPE24 field. */
#define LLWU_RD_PE2_WUPE24(base) ((LLWU_PE2_REG(base) & LLWU_PE2_WUPE24_MASK) >> LLWU_PE2_WUPE24_SHIFT)
#define LLWU_BRD_PE2_WUPE24(base) (BME_UBFX32(&LLWU_PE2_REG(base), LLWU_PE2_WUPE24_SHIFT, LLWU_PE2_WUPE24_WIDTH))

/*! @brief Set the WUPE24 field to a new value. */
#define LLWU_WR_PE2_WUPE24(base, value) (LLWU_RMW_PE2(base, LLWU_PE2_WUPE24_MASK, LLWU_PE2_WUPE24(value)))
#define LLWU_BWR_PE2_WUPE24(base, value) (BME_BFI32(&LLWU_PE2_REG(base), ((uint32_t)(value) << LLWU_PE2_WUPE24_SHIFT), LLWU_PE2_WUPE24_SHIFT, LLWU_PE2_WUPE24_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE2, field WUPE25[19:18] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE2_WUPE25 field. */
#define LLWU_RD_PE2_WUPE25(base) ((LLWU_PE2_REG(base) & LLWU_PE2_WUPE25_MASK) >> LLWU_PE2_WUPE25_SHIFT)
#define LLWU_BRD_PE2_WUPE25(base) (BME_UBFX32(&LLWU_PE2_REG(base), LLWU_PE2_WUPE25_SHIFT, LLWU_PE2_WUPE25_WIDTH))

/*! @brief Set the WUPE25 field to a new value. */
#define LLWU_WR_PE2_WUPE25(base, value) (LLWU_RMW_PE2(base, LLWU_PE2_WUPE25_MASK, LLWU_PE2_WUPE25(value)))
#define LLWU_BWR_PE2_WUPE25(base, value) (BME_BFI32(&LLWU_PE2_REG(base), ((uint32_t)(value) << LLWU_PE2_WUPE25_SHIFT), LLWU_PE2_WUPE25_SHIFT, LLWU_PE2_WUPE25_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE2, field WUPE26[21:20] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE2_WUPE26 field. */
#define LLWU_RD_PE2_WUPE26(base) ((LLWU_PE2_REG(base) & LLWU_PE2_WUPE26_MASK) >> LLWU_PE2_WUPE26_SHIFT)
#define LLWU_BRD_PE2_WUPE26(base) (BME_UBFX32(&LLWU_PE2_REG(base), LLWU_PE2_WUPE26_SHIFT, LLWU_PE2_WUPE26_WIDTH))

/*! @brief Set the WUPE26 field to a new value. */
#define LLWU_WR_PE2_WUPE26(base, value) (LLWU_RMW_PE2(base, LLWU_PE2_WUPE26_MASK, LLWU_PE2_WUPE26(value)))
#define LLWU_BWR_PE2_WUPE26(base, value) (BME_BFI32(&LLWU_PE2_REG(base), ((uint32_t)(value) << LLWU_PE2_WUPE26_SHIFT), LLWU_PE2_WUPE26_SHIFT, LLWU_PE2_WUPE26_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE2, field WUPE27[23:22] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE2_WUPE27 field. */
#define LLWU_RD_PE2_WUPE27(base) ((LLWU_PE2_REG(base) & LLWU_PE2_WUPE27_MASK) >> LLWU_PE2_WUPE27_SHIFT)
#define LLWU_BRD_PE2_WUPE27(base) (BME_UBFX32(&LLWU_PE2_REG(base), LLWU_PE2_WUPE27_SHIFT, LLWU_PE2_WUPE27_WIDTH))

/*! @brief Set the WUPE27 field to a new value. */
#define LLWU_WR_PE2_WUPE27(base, value) (LLWU_RMW_PE2(base, LLWU_PE2_WUPE27_MASK, LLWU_PE2_WUPE27(value)))
#define LLWU_BWR_PE2_WUPE27(base, value) (BME_BFI32(&LLWU_PE2_REG(base), ((uint32_t)(value) << LLWU_PE2_WUPE27_SHIFT), LLWU_PE2_WUPE27_SHIFT, LLWU_PE2_WUPE27_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE2, field WUPE28[25:24] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE2_WUPE28 field. */
#define LLWU_RD_PE2_WUPE28(base) ((LLWU_PE2_REG(base) & LLWU_PE2_WUPE28_MASK) >> LLWU_PE2_WUPE28_SHIFT)
#define LLWU_BRD_PE2_WUPE28(base) (BME_UBFX32(&LLWU_PE2_REG(base), LLWU_PE2_WUPE28_SHIFT, LLWU_PE2_WUPE28_WIDTH))

/*! @brief Set the WUPE28 field to a new value. */
#define LLWU_WR_PE2_WUPE28(base, value) (LLWU_RMW_PE2(base, LLWU_PE2_WUPE28_MASK, LLWU_PE2_WUPE28(value)))
#define LLWU_BWR_PE2_WUPE28(base, value) (BME_BFI32(&LLWU_PE2_REG(base), ((uint32_t)(value) << LLWU_PE2_WUPE28_SHIFT), LLWU_PE2_WUPE28_SHIFT, LLWU_PE2_WUPE28_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE2, field WUPE29[27:26] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE2_WUPE29 field. */
#define LLWU_RD_PE2_WUPE29(base) ((LLWU_PE2_REG(base) & LLWU_PE2_WUPE29_MASK) >> LLWU_PE2_WUPE29_SHIFT)
#define LLWU_BRD_PE2_WUPE29(base) (BME_UBFX32(&LLWU_PE2_REG(base), LLWU_PE2_WUPE29_SHIFT, LLWU_PE2_WUPE29_WIDTH))

