pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the WUPE29 field to a new value. */
#define LLWU_WR_PE2_WUPE29(base, value) (LLWU_RMW_PE2(base, LLWU_PE2_WUPE29_MASK, LLWU_PE2_WUPE29(value)))
#define LLWU_BWR_PE2_WUPE29(base, value) (BME_BFI32(&LLWU_PE2_REG(base), ((uint32_t)(value) << LLWU_PE2_WUPE29_SHIFT), LLWU_PE2_WUPE29_SHIFT, LLWU_PE2_WUPE29_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE2, field WUPE30[29:28] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE2_WUPE30 field. */
#define LLWU_RD_PE2_WUPE30(base) ((LLWU_PE2_REG(base) & LLWU_PE2_WUPE30_MASK) >> LLWU_PE2_WUPE30_SHIFT)
#define LLWU_BRD_PE2_WUPE30(base) (BME_UBFX32(&LLWU_PE2_REG(base), LLWU_PE2_WUPE30_SHIFT, LLWU_PE2_WUPE30_WIDTH))

/*! @brief Set the WUPE30 field to a new value. */
#define LLWU_WR_PE2_WUPE30(base, value) (LLWU_RMW_PE2(base, LLWU_PE2_WUPE30_MASK, LLWU_PE2_WUPE30(value)))
#define LLWU_BWR_PE2_WUPE30(base, value) (BME_BFI32(&LLWU_PE2_REG(base), ((uint32_t)(value) << LLWU_PE2_WUPE30_SHIFT), LLWU_PE2_WUPE30_SHIFT, LLWU_PE2_WUPE30_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PE2, field WUPE31[31:30] (RW)
 *
 * Enables and configures the edge detection for the wakeup pin.
 *
 * Values:
 * - 0b00 - External input pin disabled as wakeup input
 * - 0b01 - External input pin enabled with rising edge detection
 * - 0b10 - External input pin enabled with falling edge detection
 * - 0b11 - External input pin enabled with any change detection
 */
/*@{*/
/*! @brief Read current value of the LLWU_PE2_WUPE31 field. */
#define LLWU_RD_PE2_WUPE31(base) ((LLWU_PE2_REG(base) & LLWU_PE2_WUPE31_MASK) >> LLWU_PE2_WUPE31_SHIFT)
#define LLWU_BRD_PE2_WUPE31(base) (BME_UBFX32(&LLWU_PE2_REG(base), LLWU_PE2_WUPE31_SHIFT, LLWU_PE2_WUPE31_WIDTH))

/*! @brief Set the WUPE31 field to a new value. */
#define LLWU_WR_PE2_WUPE31(base, value) (LLWU_RMW_PE2(base, LLWU_PE2_WUPE31_MASK, LLWU_PE2_WUPE31(value)))
#define LLWU_BWR_PE2_WUPE31(base, value) (BME_BFI32(&LLWU_PE2_REG(base), ((uint32_t)(value) << LLWU_PE2_WUPE31_SHIFT), LLWU_PE2_WUPE31_SHIFT, LLWU_PE2_WUPE31_WIDTH))
/*@}*/

/*******************************************************************************
 * LLWU_ME - LLWU Module Interrupt Enable register
 ******************************************************************************/

/*!
 * @brief LLWU_ME - LLWU Module Interrupt Enable register (RW)
 *
 * Reset value: 0x00000000U
 *
 * LLWU_ME contains the bits to enable an internal module interrupt as a wakeup
 * source for inputs LLWU_M7IF - LLWU_M0IF. This register is reset on Chip Reset
 * not VLLS and by reset types that trigger Chip Reset not VLLS. It is unaffected
 * by reset types that do not trigger Chip Reset not VLLS. See the
 * IntroductionInformation found here describes the registers of the Reset Control Module
 * (RCM). The RCM implements many of the reset functions for the chip. See the chip's
 * reset chapter for more information. details for more information.
 */
/*!
 * @name Constants and macros for entire LLWU_ME register
 */
/*@{*/
#define LLWU_RD_ME(base)         (LLWU_ME_REG(base))
#define LLWU_WR_ME(base, value)  (LLWU_ME_REG(base) = (value))
#define LLWU_RMW_ME(base, mask, value) (LLWU_WR_ME(base, (LLWU_RD_ME(base) & ~(mask)) | (value)))
#define LLWU_SET_ME(base, value) (BME_OR32(&LLWU_ME_REG(base), (uint32_t)(value)))
#define LLWU_CLR_ME(base, value) (BME_AND32(&LLWU_ME_REG(base), (uint32_t)(~(value))))
#define LLWU_TOG_ME(base, value) (BME_XOR32(&LLWU_ME_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LLWU_ME bitfields
 */

/*!
 * @name Register LLWU_ME, field WUME0[0] (RW)
 *
 * Enables an internal module as a wakeup source input.
 *
 * Values:
 * - 0b0 - Internal module flag not used as wakeup source
 * - 0b1 - Internal module flag used as wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_ME_WUME0 field. */
#define LLWU_RD_ME_WUME0(base) ((LLWU_ME_REG(base) & LLWU_ME_WUME0_MASK) >> LLWU_ME_WUME0_SHIFT)
#define LLWU_BRD_ME_WUME0(base) (BME_UBFX32(&LLWU_ME_REG(base), LLWU_ME_WUME0_SHIFT, LLWU_ME_WUME0_WIDTH))

/*! @brief Set the WUME0 field to a new value. */
#define LLWU_WR_ME_WUME0(base, value) (LLWU_RMW_ME(base, LLWU_ME_WUME0_MASK, LLWU_ME_WUME0(value)))
#define LLWU_BWR_ME_WUME0(base, value) (BME_BFI32(&LLWU_ME_REG(base), ((uint32_t)(value) << LLWU_ME_WUME0_SHIFT), LLWU_ME_WUME0_SHIFT, LLWU_ME_WUME0_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_ME, field WUME1[1] (RW)
 *
 * Enables an internal module as a wakeup source input.
 *
 * Values:
 * - 0b0 - Internal module flag not used as wakeup source
 * - 0b1 - Internal module flag used as wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_ME_WUME1 field. */
#define LLWU_RD_ME_WUME1(base) ((LLWU_ME_REG(base) & LLWU_ME_WUME1_MASK) >> LLWU_ME_WUME1_SHIFT)
#define LLWU_BRD_ME_WUME1(base) (BME_UBFX32(&LLWU_ME_REG(base), LLWU_ME_WUME1_SHIFT, LLWU_ME_WUME1_WIDTH))

/*! @brief Set the WUME1 field to a new value. */
#define LLWU_WR_ME_WUME1(base, value) (LLWU_RMW_ME(base, LLWU_ME_WUME1_MASK, LLWU_ME_WUME1(value)))
#define LLWU_BWR_ME_WUME1(base, value) (BME_BFI32(&LLWU_ME_REG(base), ((uint32_t)(value) << LLWU_ME_WUME1_SHIFT), LLWU_ME_WUME1_SHIFT, LLWU_ME_WUME1_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_ME, field WUME2[2] (RW)
 *
 * Enables an internal module as a wakeup source input.
 *
 * Values:
 * - 0b0 - Internal module flag not used as wakeup source
 * - 0b1 - Internal module flag used as wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_ME_WUME2 field. */
#define LLWU_RD_ME_WUME2(base) ((LLWU_ME_REG(base) & LLWU_ME_WUME2_MASK) >> LLWU_ME_WUME2_SHIFT)
#define LLWU_BRD_ME_WUME2(base) (BME_UBFX32(&LLWU_ME_REG(base), LLWU_ME_WUME2_SHIFT, LLWU_ME_WUME2_WIDTH))

/*! @brief Set the WUME2 field to a new value. */
#define LLWU_WR_ME_WUME2(base, value) (LLWU_RMW_ME(base, LLWU_ME_WUME2_MASK, LLWU_ME_WUME2(value)))
#define LLWU_BWR_ME_WUME2(base, value) (BME_BFI32(&LLWU_ME_REG(base), ((uint32_t)(value) << LLWU_ME_WUME2_SHIFT), LLWU_ME_WUME2_SHIFT, LLWU_ME_WUME2_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_ME, field WUME3[3] (RW)
 *
 * Enables an internal module as a wakeup source input.
 *
 * Values:
 * - 0b0 - Internal module flag not used as wakeup source
 * - 0b1 - Internal module flag used as wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_ME_WUME3 field. */
#define LLWU_RD_ME_WUME3(base) ((LLWU_ME_REG(base) & LLWU_ME_WUME3_MASK) >> LLWU_ME_WUME3_SHIFT)
#define LLWU_BRD_ME_WUME3(base) (BME_UBFX32(&LLWU_ME_REG(base), LLWU_ME_WUME3_SHIFT, LLWU_ME_WUME3_WIDTH))

/*! @brief Set the WUME3 field to a new value. */
#define LLWU_WR_ME_WUME3(base, value) (LLWU_RMW_ME(base, LLWU_ME_WUME3_MASK, LLWU_ME_WUME3(value)))
#define LLWU_BWR_ME_WUME3(base, value) (BME_BFI32(&LLWU_ME_REG(base), ((uint32_t)(value) << LLWU_ME_WUME3_SHIFT), LLWU_ME_WUME3_SHIFT, LLWU_ME_WUME3_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_ME, field WUME4[4] (RW)
 *
 * Enables an internal module as a wakeup source input.
 *
 * Values:
 * - 0b0 - Internal module flag not used as wakeup source
 * - 0b1 - Internal module flag used as wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_ME_WUME4 field. */
#define LLWU_RD_ME_WUME4(base) ((LLWU_ME_REG(base) & LLWU_ME_WUME4_MASK) >> LLWU_ME_WUME4_SHIFT)
#define LLWU_BRD_ME_WUME4(base) (BME_UBFX32(&LLWU_ME_REG(base), LLWU_ME_WUME4_SHIFT, LLWU_ME_WUME4_WIDTH))

