pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the WUME4 field to a new value. */
#define LLWU_WR_ME_WUME4(base, value) (LLWU_RMW_ME(base, LLWU_ME_WUME4_MASK, LLWU_ME_WUME4(value)))
#define LLWU_BWR_ME_WUME4(base, value) (BME_BFI32(&LLWU_ME_REG(base), ((uint32_t)(value) << LLWU_ME_WUME4_SHIFT), LLWU_ME_WUME4_SHIFT, LLWU_ME_WUME4_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_ME, field WUME5[5] (RW)
 *
 * Enables an internal module as a wakeup source input.
 *
 * Values:
 * - 0b0 - Internal module flag not used as wakeup source
 * - 0b1 - Internal module flag used as wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_ME_WUME5 field. */
#define LLWU_RD_ME_WUME5(base) ((LLWU_ME_REG(base) & LLWU_ME_WUME5_MASK) >> LLWU_ME_WUME5_SHIFT)
#define LLWU_BRD_ME_WUME5(base) (BME_UBFX32(&LLWU_ME_REG(base), LLWU_ME_WUME5_SHIFT, LLWU_ME_WUME5_WIDTH))

/*! @brief Set the WUME5 field to a new value. */
#define LLWU_WR_ME_WUME5(base, value) (LLWU_RMW_ME(base, LLWU_ME_WUME5_MASK, LLWU_ME_WUME5(value)))
#define LLWU_BWR_ME_WUME5(base, value) (BME_BFI32(&LLWU_ME_REG(base), ((uint32_t)(value) << LLWU_ME_WUME5_SHIFT), LLWU_ME_WUME5_SHIFT, LLWU_ME_WUME5_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_ME, field WUME6[6] (RW)
 *
 * Enables an internal module as a wakeup source input.
 *
 * Values:
 * - 0b0 - Internal module flag not used as wakeup source
 * - 0b1 - Internal module flag used as wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_ME_WUME6 field. */
#define LLWU_RD_ME_WUME6(base) ((LLWU_ME_REG(base) & LLWU_ME_WUME6_MASK) >> LLWU_ME_WUME6_SHIFT)
#define LLWU_BRD_ME_WUME6(base) (BME_UBFX32(&LLWU_ME_REG(base), LLWU_ME_WUME6_SHIFT, LLWU_ME_WUME6_WIDTH))

/*! @brief Set the WUME6 field to a new value. */
#define LLWU_WR_ME_WUME6(base, value) (LLWU_RMW_ME(base, LLWU_ME_WUME6_MASK, LLWU_ME_WUME6(value)))
#define LLWU_BWR_ME_WUME6(base, value) (BME_BFI32(&LLWU_ME_REG(base), ((uint32_t)(value) << LLWU_ME_WUME6_SHIFT), LLWU_ME_WUME6_SHIFT, LLWU_ME_WUME6_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_ME, field WUME7[7] (RW)
 *
 * Enables an internal module as a wakeup source input.
 *
 * Values:
 * - 0b0 - Internal module flag not used as wakeup source
 * - 0b1 - Internal module flag used as wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_ME_WUME7 field. */
#define LLWU_RD_ME_WUME7(base) ((LLWU_ME_REG(base) & LLWU_ME_WUME7_MASK) >> LLWU_ME_WUME7_SHIFT)
#define LLWU_BRD_ME_WUME7(base) (BME_UBFX32(&LLWU_ME_REG(base), LLWU_ME_WUME7_SHIFT, LLWU_ME_WUME7_WIDTH))

/*! @brief Set the WUME7 field to a new value. */
#define LLWU_WR_ME_WUME7(base, value) (LLWU_RMW_ME(base, LLWU_ME_WUME7_MASK, LLWU_ME_WUME7(value)))
#define LLWU_BWR_ME_WUME7(base, value) (BME_BFI32(&LLWU_ME_REG(base), ((uint32_t)(value) << LLWU_ME_WUME7_SHIFT), LLWU_ME_WUME7_SHIFT, LLWU_ME_WUME7_WIDTH))
/*@}*/

/*******************************************************************************
 * LLWU_DE - LLWU Module DMA Enable register
 ******************************************************************************/

/*!
 * @brief LLWU_DE - LLWU Module DMA Enable register (RW)
 *
 * Reset value: 0x00000000U
 *
 * LLWU_DE contains the bits to enable an internal module DMA request as a
 * wakeup source for inputs LLWU_M7DR - LLWU_M0DR . This register is reset on Chip
 * Reset not VLLS and by reset types that trigger Chip Reset not VLLS. It is
 * unaffected by reset types that do not trigger Chip Reset not VLLS. See the
 * IntroductionInformation found here describes the registers of the Reset Control Module
 * (RCM). The RCM implements many of the reset functions for the chip. See the
 * chip's reset chapter for more information. details for more information.
 */
/*!
 * @name Constants and macros for entire LLWU_DE register
 */
/*@{*/
#define LLWU_RD_DE(base)         (LLWU_DE_REG(base))
#define LLWU_WR_DE(base, value)  (LLWU_DE_REG(base) = (value))
#define LLWU_RMW_DE(base, mask, value) (LLWU_WR_DE(base, (LLWU_RD_DE(base) & ~(mask)) | (value)))
#define LLWU_SET_DE(base, value) (BME_OR32(&LLWU_DE_REG(base), (uint32_t)(value)))
#define LLWU_CLR_DE(base, value) (BME_AND32(&LLWU_DE_REG(base), (uint32_t)(~(value))))
#define LLWU_TOG_DE(base, value) (BME_XOR32(&LLWU_DE_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LLWU_DE bitfields
 */

/*!
 * @name Register LLWU_DE, field WUDE0[0] (RW)
 *
 * Enables an internal module as a DMA wakeup source.
 *
 * Values:
 * - 0b0 - Internal module request not used as a DMA wakeup source
 * - 0b1 - Internal module request used as a DMA wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_DE_WUDE0 field. */
#define LLWU_RD_DE_WUDE0(base) ((LLWU_DE_REG(base) & LLWU_DE_WUDE0_MASK) >> LLWU_DE_WUDE0_SHIFT)
#define LLWU_BRD_DE_WUDE0(base) (BME_UBFX32(&LLWU_DE_REG(base), LLWU_DE_WUDE0_SHIFT, LLWU_DE_WUDE0_WIDTH))

/*! @brief Set the WUDE0 field to a new value. */
#define LLWU_WR_DE_WUDE0(base, value) (LLWU_RMW_DE(base, LLWU_DE_WUDE0_MASK, LLWU_DE_WUDE0(value)))
#define LLWU_BWR_DE_WUDE0(base, value) (BME_BFI32(&LLWU_DE_REG(base), ((uint32_t)(value) << LLWU_DE_WUDE0_SHIFT), LLWU_DE_WUDE0_SHIFT, LLWU_DE_WUDE0_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_DE, field WUDE1[1] (RW)
 *
 * Enables an internal module as a DMA wakeup source.
 *
 * Values:
 * - 0b0 - Internal module request not used as a DMA wakeup source
 * - 0b1 - Internal module request used as a DMA wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_DE_WUDE1 field. */
#define LLWU_RD_DE_WUDE1(base) ((LLWU_DE_REG(base) & LLWU_DE_WUDE1_MASK) >> LLWU_DE_WUDE1_SHIFT)
#define LLWU_BRD_DE_WUDE1(base) (BME_UBFX32(&LLWU_DE_REG(base), LLWU_DE_WUDE1_SHIFT, LLWU_DE_WUDE1_WIDTH))

/*! @brief Set the WUDE1 field to a new value. */
#define LLWU_WR_DE_WUDE1(base, value) (LLWU_RMW_DE(base, LLWU_DE_WUDE1_MASK, LLWU_DE_WUDE1(value)))
#define LLWU_BWR_DE_WUDE1(base, value) (BME_BFI32(&LLWU_DE_REG(base), ((uint32_t)(value) << LLWU_DE_WUDE1_SHIFT), LLWU_DE_WUDE1_SHIFT, LLWU_DE_WUDE1_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_DE, field WUDE2[2] (RW)
 *
 * Enables an internal module as a DMA wakeup source.
 *
 * Values:
 * - 0b0 - Internal module request not used as a DMA wakeup source
 * - 0b1 - Internal module request used as a DMA wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_DE_WUDE2 field. */
#define LLWU_RD_DE_WUDE2(base) ((LLWU_DE_REG(base) & LLWU_DE_WUDE2_MASK) >> LLWU_DE_WUDE2_SHIFT)
#define LLWU_BRD_DE_WUDE2(base) (BME_UBFX32(&LLWU_DE_REG(base), LLWU_DE_WUDE2_SHIFT, LLWU_DE_WUDE2_WIDTH))

