pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the WUDE2 field to a new value. */
#define LLWU_WR_DE_WUDE2(base, value) (LLWU_RMW_DE(base, LLWU_DE_WUDE2_MASK, LLWU_DE_WUDE2(value)))
#define LLWU_BWR_DE_WUDE2(base, value) (BME_BFI32(&LLWU_DE_REG(base), ((uint32_t)(value) << LLWU_DE_WUDE2_SHIFT), LLWU_DE_WUDE2_SHIFT, LLWU_DE_WUDE2_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_DE, field WUDE3[3] (RW)
 *
 * Enables an internal module as a DMA wakeup source.
 *
 * Values:
 * - 0b0 - Internal module request not used as a DMA wakeup source
 * - 0b1 - Internal module request used as a DMA wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_DE_WUDE3 field. */
#define LLWU_RD_DE_WUDE3(base) ((LLWU_DE_REG(base) & LLWU_DE_WUDE3_MASK) >> LLWU_DE_WUDE3_SHIFT)
#define LLWU_BRD_DE_WUDE3(base) (BME_UBFX32(&LLWU_DE_REG(base), LLWU_DE_WUDE3_SHIFT, LLWU_DE_WUDE3_WIDTH))

/*! @brief Set the WUDE3 field to a new value. */
#define LLWU_WR_DE_WUDE3(base, value) (LLWU_RMW_DE(base, LLWU_DE_WUDE3_MASK, LLWU_DE_WUDE3(value)))
#define LLWU_BWR_DE_WUDE3(base, value) (BME_BFI32(&LLWU_DE_REG(base), ((uint32_t)(value) << LLWU_DE_WUDE3_SHIFT), LLWU_DE_WUDE3_SHIFT, LLWU_DE_WUDE3_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_DE, field WUDE4[4] (RW)
 *
 * Enables an internal module as a DMA wakeup source.
 *
 * Values:
 * - 0b0 - Internal module request not used as a DMA wakeup source
 * - 0b1 - Internal module request used as a DMA wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_DE_WUDE4 field. */
#define LLWU_RD_DE_WUDE4(base) ((LLWU_DE_REG(base) & LLWU_DE_WUDE4_MASK) >> LLWU_DE_WUDE4_SHIFT)
#define LLWU_BRD_DE_WUDE4(base) (BME_UBFX32(&LLWU_DE_REG(base), LLWU_DE_WUDE4_SHIFT, LLWU_DE_WUDE4_WIDTH))

/*! @brief Set the WUDE4 field to a new value. */
#define LLWU_WR_DE_WUDE4(base, value) (LLWU_RMW_DE(base, LLWU_DE_WUDE4_MASK, LLWU_DE_WUDE4(value)))
#define LLWU_BWR_DE_WUDE4(base, value) (BME_BFI32(&LLWU_DE_REG(base), ((uint32_t)(value) << LLWU_DE_WUDE4_SHIFT), LLWU_DE_WUDE4_SHIFT, LLWU_DE_WUDE4_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_DE, field WUDE5[5] (RW)
 *
 * Enables an internal module as a DMA wakeup source.
 *
 * Values:
 * - 0b0 - Internal module request not used as a DMA wakeup source
 * - 0b1 - Internal module request used as a DMA wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_DE_WUDE5 field. */
#define LLWU_RD_DE_WUDE5(base) ((LLWU_DE_REG(base) & LLWU_DE_WUDE5_MASK) >> LLWU_DE_WUDE5_SHIFT)
#define LLWU_BRD_DE_WUDE5(base) (BME_UBFX32(&LLWU_DE_REG(base), LLWU_DE_WUDE5_SHIFT, LLWU_DE_WUDE5_WIDTH))

/*! @brief Set the WUDE5 field to a new value. */
#define LLWU_WR_DE_WUDE5(base, value) (LLWU_RMW_DE(base, LLWU_DE_WUDE5_MASK, LLWU_DE_WUDE5(value)))
#define LLWU_BWR_DE_WUDE5(base, value) (BME_BFI32(&LLWU_DE_REG(base), ((uint32_t)(value) << LLWU_DE_WUDE5_SHIFT), LLWU_DE_WUDE5_SHIFT, LLWU_DE_WUDE5_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_DE, field WUDE6[6] (RW)
 *
 * Enables an internal module as a DMA wakeup source.
 *
 * Values:
 * - 0b0 - Internal module request not used as a DMA wakeup source
 * - 0b1 - Internal module request used as a DMA wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_DE_WUDE6 field. */
#define LLWU_RD_DE_WUDE6(base) ((LLWU_DE_REG(base) & LLWU_DE_WUDE6_MASK) >> LLWU_DE_WUDE6_SHIFT)
#define LLWU_BRD_DE_WUDE6(base) (BME_UBFX32(&LLWU_DE_REG(base), LLWU_DE_WUDE6_SHIFT, LLWU_DE_WUDE6_WIDTH))

/*! @brief Set the WUDE6 field to a new value. */
#define LLWU_WR_DE_WUDE6(base, value) (LLWU_RMW_DE(base, LLWU_DE_WUDE6_MASK, LLWU_DE_WUDE6(value)))
#define LLWU_BWR_DE_WUDE6(base, value) (BME_BFI32(&LLWU_DE_REG(base), ((uint32_t)(value) << LLWU_DE_WUDE6_SHIFT), LLWU_DE_WUDE6_SHIFT, LLWU_DE_WUDE6_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_DE, field WUDE7[7] (RW)
 *
 * Enables an internal module as a DMA wakeup source.
 *
 * Values:
 * - 0b0 - Internal module request not used as a DMA wakeup source
 * - 0b1 - Internal module request used as a DMA wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_DE_WUDE7 field. */
#define LLWU_RD_DE_WUDE7(base) ((LLWU_DE_REG(base) & LLWU_DE_WUDE7_MASK) >> LLWU_DE_WUDE7_SHIFT)
#define LLWU_BRD_DE_WUDE7(base) (BME_UBFX32(&LLWU_DE_REG(base), LLWU_DE_WUDE7_SHIFT, LLWU_DE_WUDE7_WIDTH))

/*! @brief Set the WUDE7 field to a new value. */
#define LLWU_WR_DE_WUDE7(base, value) (LLWU_RMW_DE(base, LLWU_DE_WUDE7_MASK, LLWU_DE_WUDE7(value)))
#define LLWU_BWR_DE_WUDE7(base, value) (BME_BFI32(&LLWU_DE_REG(base), ((uint32_t)(value) << LLWU_DE_WUDE7_SHIFT), LLWU_DE_WUDE7_SHIFT, LLWU_DE_WUDE7_WIDTH))
/*@}*/

/*******************************************************************************
 * LLWU_PF - LLWU Pin Flag register
 ******************************************************************************/

/*!
 * @brief LLWU_PF - LLWU Pin Flag register (W1C)
 *
 * Reset value: 0x00000000U
 *
 * LLWU_PF contains the wakeup flags indicating which wakeup source caused the
 * MCU to exit LLS or VLLS mode. For LLS, this is the source causing the CPU
 * interrupt flow. For VLLS, this is the source causing the MCU reset flow. The
 * external wakeup flags are read-only and clearing a flag is accomplished by a write
 * of a 1 to the corresponding WUFx bit. The wakeup flag (WUFx), if set, will
 * remain set if the associated WUPEx bit is cleared. This register is reset on Chip
 * Reset not VLLS and by reset types that trigger Chip Reset not VLLS. It is
 * unaffected by reset types that do not trigger Chip Reset not VLLS. See the
 * IntroductionInformation found here describes the registers of the Reset Control
 * Module (RCM). The RCM implements many of the reset functions for the chip. See the
 * chip's reset chapter for more information. details for more information.
 */
/*!
 * @name Constants and macros for entire LLWU_PF register
 */
/*@{*/
#define LLWU_RD_PF(base)         (LLWU_PF_REG(base))
#define LLWU_WR_PF(base, value)  (LLWU_PF_REG(base) = (value))
#define LLWU_RMW_PF(base, mask, value) (LLWU_WR_PF(base, (LLWU_RD_PF(base) & ~(mask)) | (value)))
#define LLWU_SET_PF(base, value) (BME_OR32(&LLWU_PF_REG(base), (uint32_t)(value)))
#define LLWU_CLR_PF(base, value) (BME_AND32(&LLWU_PF_REG(base), (uint32_t)(~(value))))
#define LLWU_TOG_PF(base, value) (BME_XOR32(&LLWU_PF_REG(base), (uint32_t)(value)))
/*@}*/

