pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * Constants & macros for individual LLWU_PF bitfields
 */

/*!
 * @name Register LLWU_PF, field WUF0[0] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF0.
 *
 * Values:
 * - 0b0 - LLWU_P0 input was not a wakeup source
 * - 0b1 - LLWU_P0 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF0 field. */
#define LLWU_RD_PF_WUF0(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF0_MASK) >> LLWU_PF_WUF0_SHIFT)
#define LLWU_BRD_PF_WUF0(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF0_SHIFT, LLWU_PF_WUF0_WIDTH))

/*! @brief Set the WUF0 field to a new value. */
#define LLWU_WR_PF_WUF0(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF0(value)))
#define LLWU_BWR_PF_WUF0(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF0_SHIFT), LLWU_PF_WUF0_SHIFT, LLWU_PF_WUF0_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF1[1] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF1.
 *
 * Values:
 * - 0b0 - LLWU_P1 input was not a wakeup source
 * - 0b1 - LLWU_P1 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF1 field. */
#define LLWU_RD_PF_WUF1(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF1_MASK) >> LLWU_PF_WUF1_SHIFT)
#define LLWU_BRD_PF_WUF1(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF1_SHIFT, LLWU_PF_WUF1_WIDTH))

/*! @brief Set the WUF1 field to a new value. */
#define LLWU_WR_PF_WUF1(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF1_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF1(value)))
#define LLWU_BWR_PF_WUF1(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF1_SHIFT), LLWU_PF_WUF1_SHIFT, LLWU_PF_WUF1_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF2[2] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF2.
 *
 * Values:
 * - 0b0 - LLWU_P2 input was not a wakeup source
 * - 0b1 - LLWU_P2 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF2 field. */
#define LLWU_RD_PF_WUF2(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF2_MASK) >> LLWU_PF_WUF2_SHIFT)
#define LLWU_BRD_PF_WUF2(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF2_SHIFT, LLWU_PF_WUF2_WIDTH))

/*! @brief Set the WUF2 field to a new value. */
#define LLWU_WR_PF_WUF2(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF2_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF2(value)))
#define LLWU_BWR_PF_WUF2(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF2_SHIFT), LLWU_PF_WUF2_SHIFT, LLWU_PF_WUF2_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF3[3] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF3.
 *
 * Values:
 * - 0b0 - LLWU_P3 input was not a wakeup source
 * - 0b1 - LLWU_P3 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF3 field. */
#define LLWU_RD_PF_WUF3(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF3_MASK) >> LLWU_PF_WUF3_SHIFT)
#define LLWU_BRD_PF_WUF3(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF3_SHIFT, LLWU_PF_WUF3_WIDTH))

/*! @brief Set the WUF3 field to a new value. */
#define LLWU_WR_PF_WUF3(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF3_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF3(value)))
#define LLWU_BWR_PF_WUF3(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF3_SHIFT), LLWU_PF_WUF3_SHIFT, LLWU_PF_WUF3_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF4[4] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF4.
 *
 * Values:
 * - 0b0 - LLWU_P4 input was not a wakeup source
 * - 0b1 - LLWU_P4 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF4 field. */
#define LLWU_RD_PF_WUF4(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF4_MASK) >> LLWU_PF_WUF4_SHIFT)
#define LLWU_BRD_PF_WUF4(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF4_SHIFT, LLWU_PF_WUF4_WIDTH))

/*! @brief Set the WUF4 field to a new value. */
#define LLWU_WR_PF_WUF4(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF4_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF4(value)))
#define LLWU_BWR_PF_WUF4(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF4_SHIFT), LLWU_PF_WUF4_SHIFT, LLWU_PF_WUF4_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF5[5] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF5.
 *
 * Values:
 * - 0b0 - LLWU_P5 input was not a wakeup source
 * - 0b1 - LLWU_P5 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF5 field. */
#define LLWU_RD_PF_WUF5(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF5_MASK) >> LLWU_PF_WUF5_SHIFT)
#define LLWU_BRD_PF_WUF5(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF5_SHIFT, LLWU_PF_WUF5_WIDTH))

/*! @brief Set the WUF5 field to a new value. */
#define LLWU_WR_PF_WUF5(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF5_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF5(value)))
#define LLWU_BWR_PF_WUF5(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF5_SHIFT), LLWU_PF_WUF5_SHIFT, LLWU_PF_WUF5_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF6[6] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF6.
 *
 * Values:
 * - 0b0 - LLWU_P6 input was not a wakeup source
 * - 0b1 - LLWU_P6 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF6 field. */
#define LLWU_RD_PF_WUF6(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF6_MASK) >> LLWU_PF_WUF6_SHIFT)
#define LLWU_BRD_PF_WUF6(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF6_SHIFT, LLWU_PF_WUF6_WIDTH))

/*! @brief Set the WUF6 field to a new value. */
#define LLWU_WR_PF_WUF6(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF6_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF6(value)))
#define LLWU_BWR_PF_WUF6(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF6_SHIFT), LLWU_PF_WUF6_SHIFT, LLWU_PF_WUF6_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF7[7] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF7.
 *
 * Values:
 * - 0b0 - LLWU_P7 input was not a wakeup source
 * - 0b1 - LLWU_P7 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF7 field. */
#define LLWU_RD_PF_WUF7(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF7_MASK) >> LLWU_PF_WUF7_SHIFT)
#define LLWU_BRD_PF_WUF7(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF7_SHIFT, LLWU_PF_WUF7_WIDTH))

/*! @brief Set the WUF7 field to a new value. */
#define LLWU_WR_PF_WUF7(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF7_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF7(value)))
#define LLWU_BWR_PF_WUF7(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF7_SHIFT), LLWU_PF_WUF7_SHIFT, LLWU_PF_WUF7_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF8[8] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF8.
 *
 * Values:
 * - 0b0 - LLWU_P8 input was not a wakeup source
 * - 0b1 - LLWU_P8 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF8 field. */
#define LLWU_RD_PF_WUF8(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF8_MASK) >> LLWU_PF_WUF8_SHIFT)
#define LLWU_BRD_PF_WUF8(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF8_SHIFT, LLWU_PF_WUF8_WIDTH))

/*! @brief Set the WUF8 field to a new value. */
#define LLWU_WR_PF_WUF8(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF8_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF8(value)))
#define LLWU_BWR_PF_WUF8(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF8_SHIFT), LLWU_PF_WUF8_SHIFT, LLWU_PF_WUF8_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF9[9] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF9.
 *
 * Values:
 * - 0b0 - LLWU_P9 input was not a wakeup source
 * - 0b1 - LLWU_P9 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF9 field. */
#define LLWU_RD_PF_WUF9(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF9_MASK) >> LLWU_PF_WUF9_SHIFT)
#define LLWU_BRD_PF_WUF9(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF9_SHIFT, LLWU_PF_WUF9_WIDTH))

