pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the WUF9 field to a new value. */
#define LLWU_WR_PF_WUF9(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF9_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF9(value)))
#define LLWU_BWR_PF_WUF9(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF9_SHIFT), LLWU_PF_WUF9_SHIFT, LLWU_PF_WUF9_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF10[10] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF10.
 *
 * Values:
 * - 0b0 - LLWU_P10 input was not a wakeup source
 * - 0b1 - LLWU_P10 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF10 field. */
#define LLWU_RD_PF_WUF10(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF10_MASK) >> LLWU_PF_WUF10_SHIFT)
#define LLWU_BRD_PF_WUF10(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF10_SHIFT, LLWU_PF_WUF10_WIDTH))

/*! @brief Set the WUF10 field to a new value. */
#define LLWU_WR_PF_WUF10(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF10_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF10(value)))
#define LLWU_BWR_PF_WUF10(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF10_SHIFT), LLWU_PF_WUF10_SHIFT, LLWU_PF_WUF10_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF11[11] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF11.
 *
 * Values:
 * - 0b0 - LLWU_P11 input was not a wakeup source
 * - 0b1 - LLWU_P11 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF11 field. */
#define LLWU_RD_PF_WUF11(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF11_MASK) >> LLWU_PF_WUF11_SHIFT)
#define LLWU_BRD_PF_WUF11(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF11_SHIFT, LLWU_PF_WUF11_WIDTH))

/*! @brief Set the WUF11 field to a new value. */
#define LLWU_WR_PF_WUF11(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF11_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF11(value)))
#define LLWU_BWR_PF_WUF11(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF11_SHIFT), LLWU_PF_WUF11_SHIFT, LLWU_PF_WUF11_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF12[12] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF12.
 *
 * Values:
 * - 0b0 - LLWU_P12 input was not a wakeup source
 * - 0b1 - LLWU_P12 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF12 field. */
#define LLWU_RD_PF_WUF12(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF12_MASK) >> LLWU_PF_WUF12_SHIFT)
#define LLWU_BRD_PF_WUF12(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF12_SHIFT, LLWU_PF_WUF12_WIDTH))

/*! @brief Set the WUF12 field to a new value. */
#define LLWU_WR_PF_WUF12(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF12_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF12(value)))
#define LLWU_BWR_PF_WUF12(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF12_SHIFT), LLWU_PF_WUF12_SHIFT, LLWU_PF_WUF12_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF13[13] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF13.
 *
 * Values:
 * - 0b0 - LLWU_P13 input was not a wakeup source
 * - 0b1 - LLWU_P13 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF13 field. */
#define LLWU_RD_PF_WUF13(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF13_MASK) >> LLWU_PF_WUF13_SHIFT)
#define LLWU_BRD_PF_WUF13(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF13_SHIFT, LLWU_PF_WUF13_WIDTH))

/*! @brief Set the WUF13 field to a new value. */
#define LLWU_WR_PF_WUF13(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF13_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF13(value)))
#define LLWU_BWR_PF_WUF13(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF13_SHIFT), LLWU_PF_WUF13_SHIFT, LLWU_PF_WUF13_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF14[14] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF14.
 *
 * Values:
 * - 0b0 - LLWU_P14 input was not a wakeup source
 * - 0b1 - LLWU_P14 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF14 field. */
#define LLWU_RD_PF_WUF14(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF14_MASK) >> LLWU_PF_WUF14_SHIFT)
#define LLWU_BRD_PF_WUF14(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF14_SHIFT, LLWU_PF_WUF14_WIDTH))

