pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the WUF14 field to a new value. */
#define LLWU_WR_PF_WUF14(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF14_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF14(value)))
#define LLWU_BWR_PF_WUF14(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF14_SHIFT), LLWU_PF_WUF14_SHIFT, LLWU_PF_WUF14_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF15[15] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF15.
 *
 * Values:
 * - 0b0 - LLWU_P15 input was not a wakeup source
 * - 0b1 - LLWU_P15 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF15 field. */
#define LLWU_RD_PF_WUF15(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF15_MASK) >> LLWU_PF_WUF15_SHIFT)
#define LLWU_BRD_PF_WUF15(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF15_SHIFT, LLWU_PF_WUF15_WIDTH))

/*! @brief Set the WUF15 field to a new value. */
#define LLWU_WR_PF_WUF15(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF15_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF15(value)))
#define LLWU_BWR_PF_WUF15(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF15_SHIFT), LLWU_PF_WUF15_SHIFT, LLWU_PF_WUF15_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF16[16] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF16.
 *
 * Values:
 * - 0b0 - LLWU_P16 input was not a wakeup source
 * - 0b1 - LLWU_P16 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF16 field. */
#define LLWU_RD_PF_WUF16(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF16_MASK) >> LLWU_PF_WUF16_SHIFT)
#define LLWU_BRD_PF_WUF16(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF16_SHIFT, LLWU_PF_WUF16_WIDTH))

/*! @brief Set the WUF16 field to a new value. */
#define LLWU_WR_PF_WUF16(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF16_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF16(value)))
#define LLWU_BWR_PF_WUF16(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF16_SHIFT), LLWU_PF_WUF16_SHIFT, LLWU_PF_WUF16_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF17[17] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF17.
 *
 * Values:
 * - 0b0 - LLWU_P17 input was not a wakeup source
 * - 0b1 - LLWU_P17 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF17 field. */
#define LLWU_RD_PF_WUF17(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF17_MASK) >> LLWU_PF_WUF17_SHIFT)
#define LLWU_BRD_PF_WUF17(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF17_SHIFT, LLWU_PF_WUF17_WIDTH))

/*! @brief Set the WUF17 field to a new value. */
#define LLWU_WR_PF_WUF17(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF17_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF17(value)))
#define LLWU_BWR_PF_WUF17(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF17_SHIFT), LLWU_PF_WUF17_SHIFT, LLWU_PF_WUF17_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF18[18] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF18.
 *
 * Values:
 * - 0b0 - LLWU_P18 input was not a wakeup source
 * - 0b1 - LLWU_P18 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF18 field. */
#define LLWU_RD_PF_WUF18(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF18_MASK) >> LLWU_PF_WUF18_SHIFT)
#define LLWU_BRD_PF_WUF18(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF18_SHIFT, LLWU_PF_WUF18_WIDTH))

/*! @brief Set the WUF18 field to a new value. */
#define LLWU_WR_PF_WUF18(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF18_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF18(value)))
#define LLWU_BWR_PF_WUF18(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF18_SHIFT), LLWU_PF_WUF18_SHIFT, LLWU_PF_WUF18_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF19[19] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF19.
 *
 * Values:
 * - 0b0 - LLWU_P19 input was not a wakeup source
 * - 0b1 - LLWU_P19 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF19 field. */
#define LLWU_RD_PF_WUF19(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF19_MASK) >> LLWU_PF_WUF19_SHIFT)
#define LLWU_BRD_PF_WUF19(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF19_SHIFT, LLWU_PF_WUF19_WIDTH))

/*! @brief Set the WUF19 field to a new value. */
#define LLWU_WR_PF_WUF19(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF19_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF19(value)))
#define LLWU_BWR_PF_WUF19(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF19_SHIFT), LLWU_PF_WUF19_SHIFT, LLWU_PF_WUF19_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF20[20] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF20.
 *
 * Values:
 * - 0b0 - LLWU_P20 input was not a wakeup source
 * - 0b1 - LLWU_P20 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF20 field. */
#define LLWU_RD_PF_WUF20(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF20_MASK) >> LLWU_PF_WUF20_SHIFT)
#define LLWU_BRD_PF_WUF20(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF20_SHIFT, LLWU_PF_WUF20_WIDTH))

/*! @brief Set the WUF20 field to a new value. */
#define LLWU_WR_PF_WUF20(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF20_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF20(value)))
#define LLWU_BWR_PF_WUF20(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF20_SHIFT), LLWU_PF_WUF20_SHIFT, LLWU_PF_WUF20_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF21[21] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF21.
 *
 * Values:
 * - 0b0 - LLWU_P21 input was not a wakeup source
 * - 0b1 - LLWU_P21 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF21 field. */
#define LLWU_RD_PF_WUF21(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF21_MASK) >> LLWU_PF_WUF21_SHIFT)
#define LLWU_BRD_PF_WUF21(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF21_SHIFT, LLWU_PF_WUF21_WIDTH))

/*! @brief Set the WUF21 field to a new value. */
#define LLWU_WR_PF_WUF21(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF21_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF21(value)))
#define LLWU_BWR_PF_WUF21(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF21_SHIFT), LLWU_PF_WUF21_SHIFT, LLWU_PF_WUF21_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF22[22] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF22.
 *
 * Values:
 * - 0b0 - LLWU_P22 input was not a wakeup source
 * - 0b1 - LLWU_P22 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF22 field. */
#define LLWU_RD_PF_WUF22(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF22_MASK) >> LLWU_PF_WUF22_SHIFT)
#define LLWU_BRD_PF_WUF22(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF22_SHIFT, LLWU_PF_WUF22_WIDTH))

/*! @brief Set the WUF22 field to a new value. */
#define LLWU_WR_PF_WUF22(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF22_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF22(value)))
#define LLWU_BWR_PF_WUF22(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF22_SHIFT), LLWU_PF_WUF22_SHIFT, LLWU_PF_WUF22_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF23[23] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF23.
 *
 * Values:
 * - 0b0 - LLWU_P23 input was not a wakeup source
 * - 0b1 - LLWU_P23 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF23 field. */
#define LLWU_RD_PF_WUF23(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF23_MASK) >> LLWU_PF_WUF23_SHIFT)
#define LLWU_BRD_PF_WUF23(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF23_SHIFT, LLWU_PF_WUF23_WIDTH))

/*! @brief Set the WUF23 field to a new value. */
#define LLWU_WR_PF_WUF23(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF23_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF23(value)))
#define LLWU_BWR_PF_WUF23(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF23_SHIFT), LLWU_PF_WUF23_SHIFT, LLWU_PF_WUF23_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF24[24] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF24.
 *
 * Values:
 * - 0b0 - LLWU_P24 input was not a wakeup source
 * - 0b1 - LLWU_P24 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF24 field. */
#define LLWU_RD_PF_WUF24(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF24_MASK) >> LLWU_PF_WUF24_SHIFT)
#define LLWU_BRD_PF_WUF24(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF24_SHIFT, LLWU_PF_WUF24_WIDTH))

/*! @brief Set the WUF24 field to a new value. */
#define LLWU_WR_PF_WUF24(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF24_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF24(value)))
#define LLWU_BWR_PF_WUF24(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF24_SHIFT), LLWU_PF_WUF24_SHIFT, LLWU_PF_WUF24_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF25[25] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF25.
 *
 * Values:
 * - 0b0 - LLWU_P25 input was not a wakeup source
 * - 0b1 - LLWU_P25 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF25 field. */
#define LLWU_RD_PF_WUF25(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF25_MASK) >> LLWU_PF_WUF25_SHIFT)
#define LLWU_BRD_PF_WUF25(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF25_SHIFT, LLWU_PF_WUF25_WIDTH))

