pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the WUF25 field to a new value. */
#define LLWU_WR_PF_WUF25(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF25_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF25(value)))
#define LLWU_BWR_PF_WUF25(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF25_SHIFT), LLWU_PF_WUF25_SHIFT, LLWU_PF_WUF25_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF26[26] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF26.
 *
 * Values:
 * - 0b0 - LLWU_P26 input was not a wakeup source
 * - 0b1 - LLWU_P26 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF26 field. */
#define LLWU_RD_PF_WUF26(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF26_MASK) >> LLWU_PF_WUF26_SHIFT)
#define LLWU_BRD_PF_WUF26(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF26_SHIFT, LLWU_PF_WUF26_WIDTH))

/*! @brief Set the WUF26 field to a new value. */
#define LLWU_WR_PF_WUF26(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF26_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF26(value)))
#define LLWU_BWR_PF_WUF26(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF26_SHIFT), LLWU_PF_WUF26_SHIFT, LLWU_PF_WUF26_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF27[27] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF27.
 *
 * Values:
 * - 0b0 - LLWU_P27 input was not a wakeup source
 * - 0b1 - LLWU_P27 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF27 field. */
#define LLWU_RD_PF_WUF27(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF27_MASK) >> LLWU_PF_WUF27_SHIFT)
#define LLWU_BRD_PF_WUF27(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF27_SHIFT, LLWU_PF_WUF27_WIDTH))

/*! @brief Set the WUF27 field to a new value. */
#define LLWU_WR_PF_WUF27(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF27_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF27(value)))
#define LLWU_BWR_PF_WUF27(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF27_SHIFT), LLWU_PF_WUF27_SHIFT, LLWU_PF_WUF27_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF28[28] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF28.
 *
 * Values:
 * - 0b0 - LLWU_P28 input was not a wakeup source
 * - 0b1 - LLWU_P28 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF28 field. */
#define LLWU_RD_PF_WUF28(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF28_MASK) >> LLWU_PF_WUF28_SHIFT)
#define LLWU_BRD_PF_WUF28(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF28_SHIFT, LLWU_PF_WUF28_WIDTH))

/*! @brief Set the WUF28 field to a new value. */
#define LLWU_WR_PF_WUF28(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF28_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF28(value)))
#define LLWU_BWR_PF_WUF28(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF28_SHIFT), LLWU_PF_WUF28_SHIFT, LLWU_PF_WUF28_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF29[29] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF29.
 *
 * Values:
 * - 0b0 - LLWU_P29 input was not a wakeup source
 * - 0b1 - LLWU_P29 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF29 field. */
#define LLWU_RD_PF_WUF29(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF29_MASK) >> LLWU_PF_WUF29_SHIFT)
#define LLWU_BRD_PF_WUF29(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF29_SHIFT, LLWU_PF_WUF29_WIDTH))

/*! @brief Set the WUF29 field to a new value. */
#define LLWU_WR_PF_WUF29(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF29_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF30_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF29(value)))
#define LLWU_BWR_PF_WUF29(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF29_SHIFT), LLWU_PF_WUF29_SHIFT, LLWU_PF_WUF29_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF30[30] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF30.
 *
 * Values:
 * - 0b0 - LLWU_P30 input was not a wakeup source
 * - 0b1 - LLWU_P30 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF30 field. */
#define LLWU_RD_PF_WUF30(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF30_MASK) >> LLWU_PF_WUF30_SHIFT)
#define LLWU_BRD_PF_WUF30(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF30_SHIFT, LLWU_PF_WUF30_WIDTH))

