pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the WUF30 field to a new value. */
#define LLWU_WR_PF_WUF30(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF30_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF31_MASK), LLWU_PF_WUF30(value)))
#define LLWU_BWR_PF_WUF30(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF30_SHIFT), LLWU_PF_WUF30_SHIFT, LLWU_PF_WUF30_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_PF, field WUF31[31] (W1C)
 *
 * Indicates that an enabled external wakeup pin was a source of exiting a
 * low-leakage power mode. To clear the flag write a one to WUF31.
 *
 * Values:
 * - 0b0 - LLWU_P31 input was not a wakeup source
 * - 0b1 - LLWU_P31 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_PF_WUF31 field. */
#define LLWU_RD_PF_WUF31(base) ((LLWU_PF_REG(base) & LLWU_PF_WUF31_MASK) >> LLWU_PF_WUF31_SHIFT)
#define LLWU_BRD_PF_WUF31(base) (BME_UBFX32(&LLWU_PF_REG(base), LLWU_PF_WUF31_SHIFT, LLWU_PF_WUF31_WIDTH))

/*! @brief Set the WUF31 field to a new value. */
#define LLWU_WR_PF_WUF31(base, value) (LLWU_RMW_PF(base, (LLWU_PF_WUF31_MASK | LLWU_PF_WUF0_MASK | LLWU_PF_WUF1_MASK | LLWU_PF_WUF2_MASK | LLWU_PF_WUF3_MASK | LLWU_PF_WUF4_MASK | LLWU_PF_WUF5_MASK | LLWU_PF_WUF6_MASK | LLWU_PF_WUF7_MASK | LLWU_PF_WUF8_MASK | LLWU_PF_WUF9_MASK | LLWU_PF_WUF10_MASK | LLWU_PF_WUF11_MASK | LLWU_PF_WUF12_MASK | LLWU_PF_WUF13_MASK | LLWU_PF_WUF14_MASK | LLWU_PF_WUF15_MASK | LLWU_PF_WUF16_MASK | LLWU_PF_WUF17_MASK | LLWU_PF_WUF18_MASK | LLWU_PF_WUF19_MASK | LLWU_PF_WUF20_MASK | LLWU_PF_WUF21_MASK | LLWU_PF_WUF22_MASK | LLWU_PF_WUF23_MASK | LLWU_PF_WUF24_MASK | LLWU_PF_WUF25_MASK | LLWU_PF_WUF26_MASK | LLWU_PF_WUF27_MASK | LLWU_PF_WUF28_MASK | LLWU_PF_WUF29_MASK | LLWU_PF_WUF30_MASK), LLWU_PF_WUF31(value)))
#define LLWU_BWR_PF_WUF31(base, value) (BME_BFI32(&LLWU_PF_REG(base), ((uint32_t)(value) << LLWU_PF_WUF31_SHIFT), LLWU_PF_WUF31_SHIFT, LLWU_PF_WUF31_WIDTH))
/*@}*/

/*******************************************************************************
 * LLWU_MF - LLWU Module Interrupt Flag register
 ******************************************************************************/

/*!
 * @brief LLWU_MF - LLWU Module Interrupt Flag register (RO)
 *
 * Reset value: 0x00000000U
 *
 * LLWU_MF contains the wakeup flags indicating which internal module interrupt
 * caused the MCU to exit LLS or VLLS mode. For LLS, this is the source causing
 * the CPU interrupt flow. For VLLS, this is the source causing the MCU reset
 * flow. For internal peripherals that are capable of running in a low-leakage power
 * mode, such as a real time clock module or CMP module, the flag from the
 * associated peripheral is accessible as the MWUFx bit. The flag will need to be
 * cleared in the peripheral instead of writing a 1 to the MWUFx bit. This register is
 * reset on Chip Reset not VLLS and by reset types that trigger Chip Reset not
 * VLLS. It is unaffected by reset types that do not trigger Chip Reset not VLLS.
 * See the IntroductionInformation found here describes the registers of the
 * Reset Control Module (RCM). The RCM implements many of the reset functions for the
 * chip. See the chip's reset chapter for more information. details for more
 * information.
 */
/*!
 * @name Constants and macros for entire LLWU_MF register
 */
/*@{*/
#define LLWU_RD_MF(base)         (LLWU_MF_REG(base))
/*@}*/

/*
 * Constants & macros for individual LLWU_MF bitfields
 */

/*!
 * @name Register LLWU_MF, field MWUF0[0] (RO)
 *
 * Indicates that an enabled internal peripheral was a source of exiting a
 * low-leakage power mode. To clear the flag, follow the internal peripheral flag
 * clearing mechanism.
 *
 * Values:
 * - 0b0 - Module 0 input was not a wakeup source
 * - 0b1 - Module 0 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_MF_MWUF0 field. */
#define LLWU_RD_MF_MWUF0(base) ((LLWU_MF_REG(base) & LLWU_MF_MWUF0_MASK) >> LLWU_MF_MWUF0_SHIFT)
#define LLWU_BRD_MF_MWUF0(base) (BME_UBFX32(&LLWU_MF_REG(base), LLWU_MF_MWUF0_SHIFT, LLWU_MF_MWUF0_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_MF, field MWUF1[1] (RO)
 *
 * Indicates that an enabled internal peripheral was a source of exiting a
 * low-leakage power mode. To clear the flag, follow the internal peripheral flag
 * clearing mechanism.
 *
 * Values:
 * - 0b0 - Module 1 input was not a wakeup source
 * - 0b1 - Module 1 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_MF_MWUF1 field. */
#define LLWU_RD_MF_MWUF1(base) ((LLWU_MF_REG(base) & LLWU_MF_MWUF1_MASK) >> LLWU_MF_MWUF1_SHIFT)
#define LLWU_BRD_MF_MWUF1(base) (BME_UBFX32(&LLWU_MF_REG(base), LLWU_MF_MWUF1_SHIFT, LLWU_MF_MWUF1_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_MF, field MWUF2[2] (RO)
 *
 * Indicates that an enabled internal peripheral was a source of exiting a
 * low-leakage power mode. To clear the flag, follow the internal peripheral flag
 * clearing mechanism.
 *
 * Values:
 * - 0b0 - Module 2 input was not a wakeup source
 * - 0b1 - Module 2 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_MF_MWUF2 field. */
#define LLWU_RD_MF_MWUF2(base) ((LLWU_MF_REG(base) & LLWU_MF_MWUF2_MASK) >> LLWU_MF_MWUF2_SHIFT)
#define LLWU_BRD_MF_MWUF2(base) (BME_UBFX32(&LLWU_MF_REG(base), LLWU_MF_MWUF2_SHIFT, LLWU_MF_MWUF2_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_MF, field MWUF3[3] (RO)
 *
 * Indicates that an enabled internal peripheral was a source of exiting a
 * low-leakage power mode. To clear the flag, follow the internal peripheral flag
 * clearing mechanism.
 *
 * Values:
 * - 0b0 - Module 3 input was not a wakeup source
 * - 0b1 - Module 3 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_MF_MWUF3 field. */
#define LLWU_RD_MF_MWUF3(base) ((LLWU_MF_REG(base) & LLWU_MF_MWUF3_MASK) >> LLWU_MF_MWUF3_SHIFT)
#define LLWU_BRD_MF_MWUF3(base) (BME_UBFX32(&LLWU_MF_REG(base), LLWU_MF_MWUF3_SHIFT, LLWU_MF_MWUF3_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_MF, field MWUF4[4] (RO)
 *
 * Indicates that an enabled internal peripheral was a source of exiting a
 * low-leakage power mode. To clear the flag, follow the internal peripheral flag
 * clearing mechanism.
 *
 * Values:
 * - 0b0 - Module 4 input was not a wakeup source
 * - 0b1 - Module 4 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_MF_MWUF4 field. */
#define LLWU_RD_MF_MWUF4(base) ((LLWU_MF_REG(base) & LLWU_MF_MWUF4_MASK) >> LLWU_MF_MWUF4_SHIFT)
#define LLWU_BRD_MF_MWUF4(base) (BME_UBFX32(&LLWU_MF_REG(base), LLWU_MF_MWUF4_SHIFT, LLWU_MF_MWUF4_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_MF, field MWUF5[5] (RO)
 *
 * Indicates that an enabled internal peripheral was a source of exiting a
 * low-leakage power mode. To clear the flag, follow the internal peripheral flag
 * clearing mechanism.
 *
 * Values:
 * - 0b0 - Module 5 input was not a wakeup source
 * - 0b1 - Module 5 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_MF_MWUF5 field. */
#define LLWU_RD_MF_MWUF5(base) ((LLWU_MF_REG(base) & LLWU_MF_MWUF5_MASK) >> LLWU_MF_MWUF5_SHIFT)
#define LLWU_BRD_MF_MWUF5(base) (BME_UBFX32(&LLWU_MF_REG(base), LLWU_MF_MWUF5_SHIFT, LLWU_MF_MWUF5_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_MF, field MWUF6[6] (RO)
 *
 * Indicates that an enabled internal peripheral was a source of exiting a
 * low-leakage power mode. To clear the flag, follow the internal peripheral flag
 * clearing mechanism.
 *
 * Values:
 * - 0b0 - Module 6 input was not a wakeup source
 * - 0b1 - Module 6 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_MF_MWUF6 field. */
#define LLWU_RD_MF_MWUF6(base) ((LLWU_MF_REG(base) & LLWU_MF_MWUF6_MASK) >> LLWU_MF_MWUF6_SHIFT)
#define LLWU_BRD_MF_MWUF6(base) (BME_UBFX32(&LLWU_MF_REG(base), LLWU_MF_MWUF6_SHIFT, LLWU_MF_MWUF6_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_MF, field MWUF7[7] (RO)
 *
 * Indicates that an enabled internal peripheral was a source of exiting a
 * low-leakage power mode. To clear the flag, follow the internal peripheral flag
 * clearing mechanism.
 *
 * Values:
 * - 0b0 - Module 7 input was not a wakeup source
 * - 0b1 - Module 7 input was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_MF_MWUF7 field. */
#define LLWU_RD_MF_MWUF7(base) ((LLWU_MF_REG(base) & LLWU_MF_MWUF7_MASK) >> LLWU_MF_MWUF7_SHIFT)
#define LLWU_BRD_MF_MWUF7(base) (BME_UBFX32(&LLWU_MF_REG(base), LLWU_MF_MWUF7_SHIFT, LLWU_MF_MWUF7_WIDTH))
/*@}*/

