pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * LLWU_FILT - LLWU Pin Filter register
 ******************************************************************************/

/*!
 * @brief LLWU_FILT - LLWU Pin Filter register (RW)
 *
 * Reset value: 0x00000000U
 *
 * LLWU_FILT is a control and status register that is used to enable/disable the
 * digital filter features for an external pin. This register is reset on Chip
 * Reset not VLLS and by reset types that trigger Chip Reset not VLLS. It is
 * unaffected by reset types that do not trigger Chip Reset not VLLS. See the
 * IntroductionInformation found here describes the registers of the Reset Control Module
 * (RCM). The RCM implements many of the reset functions for the chip. See the
 * chip's reset chapter for more information. details for more information.
 */
/*!
 * @name Constants and macros for entire LLWU_FILT register
 */
/*@{*/
#define LLWU_RD_FILT(base)       (LLWU_FILT_REG(base))
#define LLWU_WR_FILT(base, value) (LLWU_FILT_REG(base) = (value))
#define LLWU_RMW_FILT(base, mask, value) (LLWU_WR_FILT(base, (LLWU_RD_FILT(base) & ~(mask)) | (value)))
#define LLWU_SET_FILT(base, value) (BME_OR32(&LLWU_FILT_REG(base), (uint32_t)(value)))
#define LLWU_CLR_FILT(base, value) (BME_AND32(&LLWU_FILT_REG(base), (uint32_t)(~(value))))
#define LLWU_TOG_FILT(base, value) (BME_XOR32(&LLWU_FILT_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LLWU_FILT bitfields
 */

/*!
 * @name Register LLWU_FILT, field FILTSEL1[4:0] (RW)
 *
 * Selects 1 of the wakeup pins to be muxed into filter 1.
 *
 * Values:
 * - 0b00000 - Select LLWU_P0 for filter
 * - 0b11111 - Select LLWU_P31 for filter
 */
/*@{*/
/*! @brief Read current value of the LLWU_FILT_FILTSEL1 field. */
#define LLWU_RD_FILT_FILTSEL1(base) ((LLWU_FILT_REG(base) & LLWU_FILT_FILTSEL1_MASK) >> LLWU_FILT_FILTSEL1_SHIFT)
#define LLWU_BRD_FILT_FILTSEL1(base) (BME_UBFX32(&LLWU_FILT_REG(base), LLWU_FILT_FILTSEL1_SHIFT, LLWU_FILT_FILTSEL1_WIDTH))

/*! @brief Set the FILTSEL1 field to a new value. */
#define LLWU_WR_FILT_FILTSEL1(base, value) (LLWU_RMW_FILT(base, (LLWU_FILT_FILTSEL1_MASK | LLWU_FILT_FILTF1_MASK | LLWU_FILT_FILTF2_MASK | LLWU_FILT_FILTF3_MASK | LLWU_FILT_FILTF4_MASK), LLWU_FILT_FILTSEL1(value)))
#define LLWU_BWR_FILT_FILTSEL1(base, value) (BME_BFI32(&LLWU_FILT_REG(base), ((uint32_t)(value) << LLWU_FILT_FILTSEL1_SHIFT), LLWU_FILT_FILTSEL1_SHIFT, LLWU_FILT_FILTSEL1_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_FILT, field FILTE1[6:5] (RW)
 *
 * Controls the digital filter 1 options for the external pin detect.
 *
 * Values:
 * - 0b00 - Filter disabled
 * - 0b01 - Filter posedge detect enabled
 * - 0b10 - Filter negedge detect enabled
 * - 0b11 - Filter any edge detect enabled
 */
/*@{*/
/*! @brief Read current value of the LLWU_FILT_FILTE1 field. */
#define LLWU_RD_FILT_FILTE1(base) ((LLWU_FILT_REG(base) & LLWU_FILT_FILTE1_MASK) >> LLWU_FILT_FILTE1_SHIFT)
#define LLWU_BRD_FILT_FILTE1(base) (BME_UBFX32(&LLWU_FILT_REG(base), LLWU_FILT_FILTE1_SHIFT, LLWU_FILT_FILTE1_WIDTH))

/*! @brief Set the FILTE1 field to a new value. */
#define LLWU_WR_FILT_FILTE1(base, value) (LLWU_RMW_FILT(base, (LLWU_FILT_FILTE1_MASK | LLWU_FILT_FILTF1_MASK | LLWU_FILT_FILTF2_MASK | LLWU_FILT_FILTF3_MASK | LLWU_FILT_FILTF4_MASK), LLWU_FILT_FILTE1(value)))
#define LLWU_BWR_FILT_FILTE1(base, value) (BME_BFI32(&LLWU_FILT_REG(base), ((uint32_t)(value) << LLWU_FILT_FILTE1_SHIFT), LLWU_FILT_FILTE1_SHIFT, LLWU_FILT_FILTE1_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_FILT, field FILTF1[7] (W1C)
 *
 * Indicates that the filtered external wakeup pin, selected by FILTSEL, was a
 * source of exiting a low-leakage power mode. To clear the flag write a one to
 * FILTF.
 *
 * Values:
 * - 0b0 - Pin Filter 1 was not a wakeup source
 * - 0b1 - Pin Filter 1 was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_FILT_FILTF1 field. */
#define LLWU_RD_FILT_FILTF1(base) ((LLWU_FILT_REG(base) & LLWU_FILT_FILTF1_MASK) >> LLWU_FILT_FILTF1_SHIFT)
#define LLWU_BRD_FILT_FILTF1(base) (BME_UBFX32(&LLWU_FILT_REG(base), LLWU_FILT_FILTF1_SHIFT, LLWU_FILT_FILTF1_WIDTH))

/*! @brief Set the FILTF1 field to a new value. */
#define LLWU_WR_FILT_FILTF1(base, value) (LLWU_RMW_FILT(base, (LLWU_FILT_FILTF1_MASK | LLWU_FILT_FILTF2_MASK | LLWU_FILT_FILTF3_MASK | LLWU_FILT_FILTF4_MASK), LLWU_FILT_FILTF1(value)))
#define LLWU_BWR_FILT_FILTF1(base, value) (BME_BFI32(&LLWU_FILT_REG(base), ((uint32_t)(value) << LLWU_FILT_FILTF1_SHIFT), LLWU_FILT_FILTF1_SHIFT, LLWU_FILT_FILTF1_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_FILT, field FILTSEL2[12:8] (RW)
 *
 * Selects 1 of the wakeup pins to be muxed into filter 2.
 *
 * Values:
 * - 0b00000 - Select LLWU_P0 for filter
 * - 0b11111 - Select LLWU_P31 for filter
 */
/*@{*/
/*! @brief Read current value of the LLWU_FILT_FILTSEL2 field. */
#define LLWU_RD_FILT_FILTSEL2(base) ((LLWU_FILT_REG(base) & LLWU_FILT_FILTSEL2_MASK) >> LLWU_FILT_FILTSEL2_SHIFT)
#define LLWU_BRD_FILT_FILTSEL2(base) (BME_UBFX32(&LLWU_FILT_REG(base), LLWU_FILT_FILTSEL2_SHIFT, LLWU_FILT_FILTSEL2_WIDTH))

/*! @brief Set the FILTSEL2 field to a new value. */
#define LLWU_WR_FILT_FILTSEL2(base, value) (LLWU_RMW_FILT(base, (LLWU_FILT_FILTSEL2_MASK | LLWU_FILT_FILTF1_MASK | LLWU_FILT_FILTF2_MASK | LLWU_FILT_FILTF3_MASK | LLWU_FILT_FILTF4_MASK), LLWU_FILT_FILTSEL2(value)))
#define LLWU_BWR_FILT_FILTSEL2(base, value) (BME_BFI32(&LLWU_FILT_REG(base), ((uint32_t)(value) << LLWU_FILT_FILTSEL2_SHIFT), LLWU_FILT_FILTSEL2_SHIFT, LLWU_FILT_FILTSEL2_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_FILT, field FILTE2[14:13] (RW)
 *
 * Controls the digital filter 2 options for the external pin detect.
 *
 * Values:
 * - 0b00 - Filter disabled
 * - 0b01 - Filter posedge detect enabled
 * - 0b10 - Filter negedge detect enabled
 * - 0b11 - Filter any edge detect enabled
 */
/*@{*/
/*! @brief Read current value of the LLWU_FILT_FILTE2 field. */
#define LLWU_RD_FILT_FILTE2(base) ((LLWU_FILT_REG(base) & LLWU_FILT_FILTE2_MASK) >> LLWU_FILT_FILTE2_SHIFT)
#define LLWU_BRD_FILT_FILTE2(base) (BME_UBFX32(&LLWU_FILT_REG(base), LLWU_FILT_FILTE2_SHIFT, LLWU_FILT_FILTE2_WIDTH))

/*! @brief Set the FILTE2 field to a new value. */
#define LLWU_WR_FILT_FILTE2(base, value) (LLWU_RMW_FILT(base, (LLWU_FILT_FILTE2_MASK | LLWU_FILT_FILTF1_MASK | LLWU_FILT_FILTF2_MASK | LLWU_FILT_FILTF3_MASK | LLWU_FILT_FILTF4_MASK), LLWU_FILT_FILTE2(value)))
#define LLWU_BWR_FILT_FILTE2(base, value) (BME_BFI32(&LLWU_FILT_REG(base), ((uint32_t)(value) << LLWU_FILT_FILTE2_SHIFT), LLWU_FILT_FILTE2_SHIFT, LLWU_FILT_FILTE2_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_FILT, field FILTF2[15] (W1C)
 *
 * Indicates that the filtered external wakeup pin, selected by FILTSEL, was a
 * source of exiting a low-leakage power mode. To clear the flag write a one to
 * FILTF.
 *
 * Values:
 * - 0b0 - Pin Filter 1 was not a wakeup source
 * - 0b1 - Pin Filter 1 was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_FILT_FILTF2 field. */
#define LLWU_RD_FILT_FILTF2(base) ((LLWU_FILT_REG(base) & LLWU_FILT_FILTF2_MASK) >> LLWU_FILT_FILTF2_SHIFT)
#define LLWU_BRD_FILT_FILTF2(base) (BME_UBFX32(&LLWU_FILT_REG(base), LLWU_FILT_FILTF2_SHIFT, LLWU_FILT_FILTF2_WIDTH))

/*! @brief Set the FILTF2 field to a new value. */
#define LLWU_WR_FILT_FILTF2(base, value) (LLWU_RMW_FILT(base, (LLWU_FILT_FILTF2_MASK | LLWU_FILT_FILTF1_MASK | LLWU_FILT_FILTF3_MASK | LLWU_FILT_FILTF4_MASK), LLWU_FILT_FILTF2(value)))
#define LLWU_BWR_FILT_FILTF2(base, value) (BME_BFI32(&LLWU_FILT_REG(base), ((uint32_t)(value) << LLWU_FILT_FILTF2_SHIFT), LLWU_FILT_FILTF2_SHIFT, LLWU_FILT_FILTF2_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_FILT, field FILTSEL3[20:16] (RW)
 *
 * Selects 1 of the wakeup pins to be muxed into filter 3.
 *
 * Values:
 * - 0b00000 - Select LLWU_P0 for filter
 * - 0b11111 - Select LLWU_P31 for filter
 */
/*@{*/
/*! @brief Read current value of the LLWU_FILT_FILTSEL3 field. */
#define LLWU_RD_FILT_FILTSEL3(base) ((LLWU_FILT_REG(base) & LLWU_FILT_FILTSEL3_MASK) >> LLWU_FILT_FILTSEL3_SHIFT)
#define LLWU_BRD_FILT_FILTSEL3(base) (BME_UBFX32(&LLWU_FILT_REG(base), LLWU_FILT_FILTSEL3_SHIFT, LLWU_FILT_FILTSEL3_WIDTH))

/*! @brief Set the FILTSEL3 field to a new value. */
#define LLWU_WR_FILT_FILTSEL3(base, value) (LLWU_RMW_FILT(base, (LLWU_FILT_FILTSEL3_MASK | LLWU_FILT_FILTF1_MASK | LLWU_FILT_FILTF2_MASK | LLWU_FILT_FILTF3_MASK | LLWU_FILT_FILTF4_MASK), LLWU_FILT_FILTSEL3(value)))
#define LLWU_BWR_FILT_FILTSEL3(base, value) (BME_BFI32(&LLWU_FILT_REG(base), ((uint32_t)(value) << LLWU_FILT_FILTSEL3_SHIFT), LLWU_FILT_FILTSEL3_SHIFT, LLWU_FILT_FILTSEL3_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_FILT, field FILTE3[22:21] (RW)
 *
 * Controls the digital filter 3 options for the external pin detect.
 *
 * Values:
 * - 0b00 - Filter disabled
 * - 0b01 - Filter posedge detect enabled
 * - 0b10 - Filter negedge detect enabled
 * - 0b11 - Filter any edge detect enabled
 */
/*@{*/
/*! @brief Read current value of the LLWU_FILT_FILTE3 field. */
#define LLWU_RD_FILT_FILTE3(base) ((LLWU_FILT_REG(base) & LLWU_FILT_FILTE3_MASK) >> LLWU_FILT_FILTE3_SHIFT)
#define LLWU_BRD_FILT_FILTE3(base) (BME_UBFX32(&LLWU_FILT_REG(base), LLWU_FILT_FILTE3_SHIFT, LLWU_FILT_FILTE3_WIDTH))

/*! @brief Set the FILTE3 field to a new value. */
#define LLWU_WR_FILT_FILTE3(base, value) (LLWU_RMW_FILT(base, (LLWU_FILT_FILTE3_MASK | LLWU_FILT_FILTF1_MASK | LLWU_FILT_FILTF2_MASK | LLWU_FILT_FILTF3_MASK | LLWU_FILT_FILTF4_MASK), LLWU_FILT_FILTE3(value)))
#define LLWU_BWR_FILT_FILTE3(base, value) (BME_BFI32(&LLWU_FILT_REG(base), ((uint32_t)(value) << LLWU_FILT_FILTE3_SHIFT), LLWU_FILT_FILTE3_SHIFT, LLWU_FILT_FILTE3_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_FILT, field FILTF3[23] (W1C)
 *
 * Indicates that the filtered external wakeup pin, selected by FILTSEL, was a
 * source of exiting a low-leakage power mode. To clear the flag write a one to
 * FILTF.
 *
 * Values:
 * - 0b0 - Pin Filter 1 was not a wakeup source
 * - 0b1 - Pin Filter 1 was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_FILT_FILTF3 field. */
#define LLWU_RD_FILT_FILTF3(base) ((LLWU_FILT_REG(base) & LLWU_FILT_FILTF3_MASK) >> LLWU_FILT_FILTF3_SHIFT)
#define LLWU_BRD_FILT_FILTF3(base) (BME_UBFX32(&LLWU_FILT_REG(base), LLWU_FILT_FILTF3_SHIFT, LLWU_FILT_FILTF3_WIDTH))

/*! @brief Set the FILTF3 field to a new value. */
#define LLWU_WR_FILT_FILTF3(base, value) (LLWU_RMW_FILT(base, (LLWU_FILT_FILTF3_MASK | LLWU_FILT_FILTF1_MASK | LLWU_FILT_FILTF2_MASK | LLWU_FILT_FILTF4_MASK), LLWU_FILT_FILTF3(value)))
#define LLWU_BWR_FILT_FILTF3(base, value) (BME_BFI32(&LLWU_FILT_REG(base), ((uint32_t)(value) << LLWU_FILT_FILTF3_SHIFT), LLWU_FILT_FILTF3_SHIFT, LLWU_FILT_FILTF3_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_FILT, field FILTSEL4[28:24] (RW)
 *
 * Selects 1 of the wakeup pins to be muxed into filter 4.
 *
 * Values:
 * - 0b00000 - Select LLWU_P0 for filter
 * - 0b11111 - Select LLWU_P31 for filter
 */
/*@{*/
/*! @brief Read current value of the LLWU_FILT_FILTSEL4 field. */
#define LLWU_RD_FILT_FILTSEL4(base) ((LLWU_FILT_REG(base) & LLWU_FILT_FILTSEL4_MASK) >> LLWU_FILT_FILTSEL4_SHIFT)
#define LLWU_BRD_FILT_FILTSEL4(base) (BME_UBFX32(&LLWU_FILT_REG(base), LLWU_FILT_FILTSEL4_SHIFT, LLWU_FILT_FILTSEL4_WIDTH))

