pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the FILTSEL4 field to a new value. */
#define LLWU_WR_FILT_FILTSEL4(base, value) (LLWU_RMW_FILT(base, (LLWU_FILT_FILTSEL4_MASK | LLWU_FILT_FILTF1_MASK | LLWU_FILT_FILTF2_MASK | LLWU_FILT_FILTF3_MASK | LLWU_FILT_FILTF4_MASK), LLWU_FILT_FILTSEL4(value)))
#define LLWU_BWR_FILT_FILTSEL4(base, value) (BME_BFI32(&LLWU_FILT_REG(base), ((uint32_t)(value) << LLWU_FILT_FILTSEL4_SHIFT), LLWU_FILT_FILTSEL4_SHIFT, LLWU_FILT_FILTSEL4_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_FILT, field FILTE4[30:29] (RW)
 *
 * Controls the digital filter 4 options for the external pin detect.
 *
 * Values:
 * - 0b00 - Filter disabled
 * - 0b01 - Filter posedge detect enabled
 * - 0b10 - Filter negedge detect enabled
 * - 0b11 - Filter any edge detect enabled
 */
/*@{*/
/*! @brief Read current value of the LLWU_FILT_FILTE4 field. */
#define LLWU_RD_FILT_FILTE4(base) ((LLWU_FILT_REG(base) & LLWU_FILT_FILTE4_MASK) >> LLWU_FILT_FILTE4_SHIFT)
#define LLWU_BRD_FILT_FILTE4(base) (BME_UBFX32(&LLWU_FILT_REG(base), LLWU_FILT_FILTE4_SHIFT, LLWU_FILT_FILTE4_WIDTH))

/*! @brief Set the FILTE4 field to a new value. */
#define LLWU_WR_FILT_FILTE4(base, value) (LLWU_RMW_FILT(base, (LLWU_FILT_FILTE4_MASK | LLWU_FILT_FILTF1_MASK | LLWU_FILT_FILTF2_MASK | LLWU_FILT_FILTF3_MASK | LLWU_FILT_FILTF4_MASK), LLWU_FILT_FILTE4(value)))
#define LLWU_BWR_FILT_FILTE4(base, value) (BME_BFI32(&LLWU_FILT_REG(base), ((uint32_t)(value) << LLWU_FILT_FILTE4_SHIFT), LLWU_FILT_FILTE4_SHIFT, LLWU_FILT_FILTE4_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_FILT, field FILTF4[31] (W1C)
 *
 * Indicates that the filtered external wakeup pin, selected by FILTSEL, was a
 * source of exiting a low-leakage power mode. To clear the flag write a one to
 * FILTF.
 *
 * Values:
 * - 0b0 - Pin Filter 1 was not a wakeup source
 * - 0b1 - Pin Filter 1 was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_FILT_FILTF4 field. */
#define LLWU_RD_FILT_FILTF4(base) ((LLWU_FILT_REG(base) & LLWU_FILT_FILTF4_MASK) >> LLWU_FILT_FILTF4_SHIFT)
#define LLWU_BRD_FILT_FILTF4(base) (BME_UBFX32(&LLWU_FILT_REG(base), LLWU_FILT_FILTF4_SHIFT, LLWU_FILT_FILTF4_WIDTH))

/*! @brief Set the FILTF4 field to a new value. */
#define LLWU_WR_FILT_FILTF4(base, value) (LLWU_RMW_FILT(base, (LLWU_FILT_FILTF4_MASK | LLWU_FILT_FILTF1_MASK | LLWU_FILT_FILTF2_MASK | LLWU_FILT_FILTF3_MASK), LLWU_FILT_FILTF4(value)))
#define LLWU_BWR_FILT_FILTF4(base, value) (BME_BFI32(&LLWU_FILT_REG(base), ((uint32_t)(value) << LLWU_FILT_FILTF4_SHIFT), LLWU_FILT_FILTF4_SHIFT, LLWU_FILT_FILTF4_WIDTH))
/*@}*/

/*
 * MKL28Z7 LPI2C
 *
 * The LPI2C Memory Map/Register Definition can be found here.
 *
 * Registers defined in this header file:
 * - LPI2C_VERID - Version ID Register
 * - LPI2C_PARAM - Parameter Register
 * - LPI2C_MCR - Master Control Register
 * - LPI2C_MSR - Master Status Register
 * - LPI2C_MIER - Master Interrupt Enable Register
 * - LPI2C_MDER - Master DMA Enable Register
 * - LPI2C_MCFGR0 - Master Configuration Register 0
 * - LPI2C_MCFGR1 - Master Configuration Register 1
 * - LPI2C_MCFGR2 - Master Configuration Register 2
 * - LPI2C_MCFGR3 - Master Configuration Register 3
 * - LPI2C_MDMR - Master Data Match Register
 * - LPI2C_MCCR0 - Master Clock Configuration Register 0
 * - LPI2C_MCCR1 - Master Clock Configuration Register 1
 * - LPI2C_MFCR - Master FIFO Control Register
 * - LPI2C_MFSR - Master FIFO Status Register
 * - LPI2C_MTDR - Master Transmit Data Register
 * - LPI2C_MRDR - Master Receive Data Register
 * - LPI2C_SCR - Slave Control Register
 * - LPI2C_SSR - Slave Status Register
 * - LPI2C_SIER - Slave Interrupt Enable Register
 * - LPI2C_SDER - Slave DMA Enable Register
 * - LPI2C_SCFGR1 - Slave Configuration Register 1
 * - LPI2C_SCFGR2 - Slave Configuration Register 2
 * - LPI2C_SAMR - Slave Address Match Register
 * - LPI2C_SASR - Slave Address Status Register
 * - LPI2C_STAR - Slave Transmit ACK Register
 * - LPI2C_STDR - Slave Transmit Data Register
 * - LPI2C_SRDR - Slave Receive Data Register
 */

#define LPI2C_INSTANCE_COUNT (3U) /*!< Number of instances of the LPI2C module. */
#define LPI2C0_IDX (0U) /*!< Instance number for LPI2C0. */
#define LPI2C1_IDX (1U) /*!< Instance number for LPI2C1. */
#define LPI2C2_IDX (2U) /*!< Instance number for LPI2C2. */

/*******************************************************************************
 * LPI2C_VERID - Version ID Register
 ******************************************************************************/

/*!
 * @brief LPI2C_VERID - Version ID Register (RO)
 *
 * Reset value: 0x01000003U
 *
 * .
 */
/*!
 * @name Constants and macros for entire LPI2C_VERID register
 */
/*@{*/
#define LPI2C_RD_VERID(base)     (LPI2C_VERID_REG(base))
/*@}*/

/*
 * Constants & macros for individual LPI2C_VERID bitfields
 */

/*!
 * @name Register LPI2C_VERID, field FEATURE[15:0] (RO)
 *
 * This read only field returns the feature set number.
 *
 * Values:
 * - 0b0000000000000010 - Master only with standard feature set.
 * - 0b0000000000000011 - Master and slave with standard feature set.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_VERID_FEATURE field. */
#define LPI2C_RD_VERID_FEATURE(base) ((LPI2C_VERID_REG(base) & LPI2C_VERID_FEATURE_MASK) >> LPI2C_VERID_FEATURE_SHIFT)
#define LPI2C_BRD_VERID_FEATURE(base) (LPI2C_RD_VERID_FEATURE(base))
/*@}*/

/*!
 * @name Register LPI2C_VERID, field MINOR[23:16] (RO)
 *
 * This read only field returns the minor version number for the specification.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_VERID_MINOR field. */
#define LPI2C_RD_VERID_MINOR(base) ((LPI2C_VERID_REG(base) & LPI2C_VERID_MINOR_MASK) >> LPI2C_VERID_MINOR_SHIFT)
#define LPI2C_BRD_VERID_MINOR(base) (BME_UBFX32(&LPI2C_VERID_REG(base), LPI2C_VERID_MINOR_SHIFT, LPI2C_VERID_MINOR_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_VERID, field MAJOR[31:24] (RO)
 *
 * This read only field returns the major version number for the specification.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_VERID_MAJOR field. */
#define LPI2C_RD_VERID_MAJOR(base) ((LPI2C_VERID_REG(base) & LPI2C_VERID_MAJOR_MASK) >> LPI2C_VERID_MAJOR_SHIFT)
#define LPI2C_BRD_VERID_MAJOR(base) (BME_UBFX32(&LPI2C_VERID_REG(base), LPI2C_VERID_MAJOR_SHIFT, LPI2C_VERID_MAJOR_WIDTH))
/*@}*/

