pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * LPI2C_PARAM - Parameter Register
 ******************************************************************************/

/*!
 * @brief LPI2C_PARAM - Parameter Register (RO)
 *
 * Reset value: 0x00000202U
 *
 * .
 */
/*!
 * @name Constants and macros for entire LPI2C_PARAM register
 */
/*@{*/
#define LPI2C_RD_PARAM(base)     (LPI2C_PARAM_REG(base))
/*@}*/

/*
 * Constants & macros for individual LPI2C_PARAM bitfields
 */

/*!
 * @name Register LPI2C_PARAM, field MTXFIFO[3:0] (RO)
 *
 * The number of words in the master transmit FIFO is 2^MTXFIFO.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_PARAM_MTXFIFO field. */
#define LPI2C_RD_PARAM_MTXFIFO(base) ((LPI2C_PARAM_REG(base) & LPI2C_PARAM_MTXFIFO_MASK) >> LPI2C_PARAM_MTXFIFO_SHIFT)
#define LPI2C_BRD_PARAM_MTXFIFO(base) (BME_UBFX32(&LPI2C_PARAM_REG(base), LPI2C_PARAM_MTXFIFO_SHIFT, LPI2C_PARAM_MTXFIFO_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_PARAM, field MRXFIFO[11:8] (RO)
 *
 * The number of words in the master receive FIFO is 2^MRXFIFO.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_PARAM_MRXFIFO field. */
#define LPI2C_RD_PARAM_MRXFIFO(base) ((LPI2C_PARAM_REG(base) & LPI2C_PARAM_MRXFIFO_MASK) >> LPI2C_PARAM_MRXFIFO_SHIFT)
#define LPI2C_BRD_PARAM_MRXFIFO(base) (BME_UBFX32(&LPI2C_PARAM_REG(base), LPI2C_PARAM_MRXFIFO_SHIFT, LPI2C_PARAM_MRXFIFO_WIDTH))
/*@}*/

/*******************************************************************************
 * LPI2C_MCR - Master Control Register
 ******************************************************************************/

/*!
 * @brief LPI2C_MCR - Master Control Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPI2C_MCR register
 */
/*@{*/
#define LPI2C_RD_MCR(base)       (LPI2C_MCR_REG(base))
#define LPI2C_WR_MCR(base, value) (LPI2C_MCR_REG(base) = (value))
#define LPI2C_RMW_MCR(base, mask, value) (LPI2C_WR_MCR(base, (LPI2C_RD_MCR(base) & ~(mask)) | (value)))
#define LPI2C_SET_MCR(base, value) (BME_OR32(&LPI2C_MCR_REG(base), (uint32_t)(value)))
#define LPI2C_CLR_MCR(base, value) (BME_AND32(&LPI2C_MCR_REG(base), (uint32_t)(~(value))))
#define LPI2C_TOG_MCR(base, value) (BME_XOR32(&LPI2C_MCR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LPI2C_MCR bitfields
 */

/*!
 * @name Register LPI2C_MCR, field MEN[0] (RW)
 *
 * Values:
 * - 0b0 - Master logic is disabled.
 * - 0b1 - Master logic is enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MCR_MEN field. */
#define LPI2C_RD_MCR_MEN(base) ((LPI2C_MCR_REG(base) & LPI2C_MCR_MEN_MASK) >> LPI2C_MCR_MEN_SHIFT)
#define LPI2C_BRD_MCR_MEN(base) (BME_UBFX32(&LPI2C_MCR_REG(base), LPI2C_MCR_MEN_SHIFT, LPI2C_MCR_MEN_WIDTH))

/*! @brief Set the MEN field to a new value. */
#define LPI2C_WR_MCR_MEN(base, value) (LPI2C_RMW_MCR(base, LPI2C_MCR_MEN_MASK, LPI2C_MCR_MEN(value)))
#define LPI2C_BWR_MCR_MEN(base, value) (BME_BFI32(&LPI2C_MCR_REG(base), ((uint32_t)(value) << LPI2C_MCR_MEN_SHIFT), LPI2C_MCR_MEN_SHIFT, LPI2C_MCR_MEN_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MCR, field RST[1] (RW)
 *
 * Reset all internal master logic and registers, except the Master Control
 * Register. Remains set until cleared by software.
 *
 * Values:
 * - 0b0 - Master logic is not reset.
 * - 0b1 - Master logic is reset.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MCR_RST field. */
#define LPI2C_RD_MCR_RST(base) ((LPI2C_MCR_REG(base) & LPI2C_MCR_RST_MASK) >> LPI2C_MCR_RST_SHIFT)
#define LPI2C_BRD_MCR_RST(base) (BME_UBFX32(&LPI2C_MCR_REG(base), LPI2C_MCR_RST_SHIFT, LPI2C_MCR_RST_WIDTH))

/*! @brief Set the RST field to a new value. */
#define LPI2C_WR_MCR_RST(base, value) (LPI2C_RMW_MCR(base, LPI2C_MCR_RST_MASK, LPI2C_MCR_RST(value)))
#define LPI2C_BWR_MCR_RST(base, value) (BME_BFI32(&LPI2C_MCR_REG(base), ((uint32_t)(value) << LPI2C_MCR_RST_SHIFT), LPI2C_MCR_RST_SHIFT, LPI2C_MCR_RST_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MCR, field DOZEN[2] (RW)
 *
 * Enables or disables Doze mode for the master.
 *
 * Values:
 * - 0b0 - Master is enabled in Doze mode.
 * - 0b1 - Master is disabled in Doze mode.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MCR_DOZEN field. */
#define LPI2C_RD_MCR_DOZEN(base) ((LPI2C_MCR_REG(base) & LPI2C_MCR_DOZEN_MASK) >> LPI2C_MCR_DOZEN_SHIFT)
#define LPI2C_BRD_MCR_DOZEN(base) (BME_UBFX32(&LPI2C_MCR_REG(base), LPI2C_MCR_DOZEN_SHIFT, LPI2C_MCR_DOZEN_WIDTH))

/*! @brief Set the DOZEN field to a new value. */
#define LPI2C_WR_MCR_DOZEN(base, value) (LPI2C_RMW_MCR(base, LPI2C_MCR_DOZEN_MASK, LPI2C_MCR_DOZEN(value)))
#define LPI2C_BWR_MCR_DOZEN(base, value) (BME_BFI32(&LPI2C_MCR_REG(base), ((uint32_t)(value) << LPI2C_MCR_DOZEN_SHIFT), LPI2C_MCR_DOZEN_SHIFT, LPI2C_MCR_DOZEN_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MCR, field DBGEN[3] (RW)
 *
 * Values:
 * - 0b0 - Master is disabled in debug mode.
 * - 0b1 - Master is enabled in debug mode.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MCR_DBGEN field. */
#define LPI2C_RD_MCR_DBGEN(base) ((LPI2C_MCR_REG(base) & LPI2C_MCR_DBGEN_MASK) >> LPI2C_MCR_DBGEN_SHIFT)
#define LPI2C_BRD_MCR_DBGEN(base) (BME_UBFX32(&LPI2C_MCR_REG(base), LPI2C_MCR_DBGEN_SHIFT, LPI2C_MCR_DBGEN_WIDTH))

/*! @brief Set the DBGEN field to a new value. */
#define LPI2C_WR_MCR_DBGEN(base, value) (LPI2C_RMW_MCR(base, LPI2C_MCR_DBGEN_MASK, LPI2C_MCR_DBGEN(value)))
#define LPI2C_BWR_MCR_DBGEN(base, value) (BME_BFI32(&LPI2C_MCR_REG(base), ((uint32_t)(value) << LPI2C_MCR_DBGEN_SHIFT), LPI2C_MCR_DBGEN_SHIFT, LPI2C_MCR_DBGEN_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MCR, field RTF[8] (WORZ)
 *
 * Values:
 * - 0b0 - No effect.
 * - 0b1 - Transmit FIFO is reset.
 */
/*@{*/
/*! @brief Set the RTF field to a new value. */
#define LPI2C_WR_MCR_RTF(base, value) (LPI2C_RMW_MCR(base, LPI2C_MCR_RTF_MASK, LPI2C_MCR_RTF(value)))
#define LPI2C_BWR_MCR_RTF(base, value) (BME_BFI32(&LPI2C_MCR_REG(base), ((uint32_t)(value) << LPI2C_MCR_RTF_SHIFT), LPI2C_MCR_RTF_SHIFT, LPI2C_MCR_RTF_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MCR, field RRF[9] (WORZ)
 *
 * Values:
 * - 0b0 - No effect.
 * - 0b1 - Receive FIFO is reset.
 */
/*@{*/
/*! @brief Set the RRF field to a new value. */
#define LPI2C_WR_MCR_RRF(base, value) (LPI2C_RMW_MCR(base, LPI2C_MCR_RRF_MASK, LPI2C_MCR_RRF(value)))
#define LPI2C_BWR_MCR_RRF(base, value) (BME_BFI32(&LPI2C_MCR_REG(base), ((uint32_t)(value) << LPI2C_MCR_RRF_SHIFT), LPI2C_MCR_RRF_SHIFT, LPI2C_MCR_RRF_WIDTH))
/*@}*/

