pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * LPI2C_MSR - Master Status Register
 ******************************************************************************/

/*!
 * @brief LPI2C_MSR - Master Status Register (RW)
 *
 * Reset value: 0x00000001U
 */
/*!
 * @name Constants and macros for entire LPI2C_MSR register
 */
/*@{*/
#define LPI2C_RD_MSR(base)       (LPI2C_MSR_REG(base))
#define LPI2C_WR_MSR(base, value) (LPI2C_MSR_REG(base) = (value))
#define LPI2C_RMW_MSR(base, mask, value) (LPI2C_WR_MSR(base, (LPI2C_RD_MSR(base) & ~(mask)) | (value)))
#define LPI2C_SET_MSR(base, value) (BME_OR32(&LPI2C_MSR_REG(base), (uint32_t)(value)))
#define LPI2C_CLR_MSR(base, value) (BME_AND32(&LPI2C_MSR_REG(base), (uint32_t)(~(value))))
#define LPI2C_TOG_MSR(base, value) (BME_XOR32(&LPI2C_MSR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LPI2C_MSR bitfields
 */

/*!
 * @name Register LPI2C_MSR, field TDF[0] (RO)
 *
 * The Transmit Data Flag is set whenever the number of words in the transmit
 * FIFO is equal or less than TXWATER.
 *
 * Values:
 * - 0b0 - Transmit data not requested.
 * - 0b1 - Transmit data is requested.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MSR_TDF field. */
#define LPI2C_RD_MSR_TDF(base) ((LPI2C_MSR_REG(base) & LPI2C_MSR_TDF_MASK) >> LPI2C_MSR_TDF_SHIFT)
#define LPI2C_BRD_MSR_TDF(base) (BME_UBFX32(&LPI2C_MSR_REG(base), LPI2C_MSR_TDF_SHIFT, LPI2C_MSR_TDF_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MSR, field RDF[1] (RO)
 *
 * The Receive Data Flag is set whenever the number of words in the receive FIFO
 * is greater than RXWATER.
 *
 * Values:
 * - 0b0 - Receive Data is not ready.
 * - 0b1 - Receive data is ready.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MSR_RDF field. */
#define LPI2C_RD_MSR_RDF(base) ((LPI2C_MSR_REG(base) & LPI2C_MSR_RDF_MASK) >> LPI2C_MSR_RDF_SHIFT)
#define LPI2C_BRD_MSR_RDF(base) (BME_UBFX32(&LPI2C_MSR_REG(base), LPI2C_MSR_RDF_SHIFT, LPI2C_MSR_RDF_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MSR, field EPF[8] (W1C)
 *
 * This flag will set when the LPI2C master generates either a repeated START or
 * a STOP condition. It does not set when the master first generates a START
 * condition.
 *
 * Values:
 * - 0b0 - Master has not generated a STOP or Repeated START condition.
 * - 0b1 - Master has generated a STOP or Repeated START condition.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MSR_EPF field. */
#define LPI2C_RD_MSR_EPF(base) ((LPI2C_MSR_REG(base) & LPI2C_MSR_EPF_MASK) >> LPI2C_MSR_EPF_SHIFT)
#define LPI2C_BRD_MSR_EPF(base) (BME_UBFX32(&LPI2C_MSR_REG(base), LPI2C_MSR_EPF_SHIFT, LPI2C_MSR_EPF_WIDTH))

/*! @brief Set the EPF field to a new value. */
#define LPI2C_WR_MSR_EPF(base, value) (LPI2C_RMW_MSR(base, (LPI2C_MSR_EPF_MASK | LPI2C_MSR_SDF_MASK | LPI2C_MSR_NDF_MASK | LPI2C_MSR_ALF_MASK | LPI2C_MSR_FEF_MASK | LPI2C_MSR_PLTF_MASK | LPI2C_MSR_DMF_MASK), LPI2C_MSR_EPF(value)))
#define LPI2C_BWR_MSR_EPF(base, value) (BME_BFI32(&LPI2C_MSR_REG(base), ((uint32_t)(value) << LPI2C_MSR_EPF_SHIFT), LPI2C_MSR_EPF_SHIFT, LPI2C_MSR_EPF_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MSR, field SDF[9] (W1C)
 *
 * This flag will set when the LPI2C master generates a STOP condition.
 *
 * Values:
 * - 0b0 - Master has not generated a STOP condition.
 * - 0b1 - Master has generated a STOP condition.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MSR_SDF field. */
#define LPI2C_RD_MSR_SDF(base) ((LPI2C_MSR_REG(base) & LPI2C_MSR_SDF_MASK) >> LPI2C_MSR_SDF_SHIFT)
#define LPI2C_BRD_MSR_SDF(base) (BME_UBFX32(&LPI2C_MSR_REG(base), LPI2C_MSR_SDF_SHIFT, LPI2C_MSR_SDF_WIDTH))

/*! @brief Set the SDF field to a new value. */
#define LPI2C_WR_MSR_SDF(base, value) (LPI2C_RMW_MSR(base, (LPI2C_MSR_SDF_MASK | LPI2C_MSR_EPF_MASK | LPI2C_MSR_NDF_MASK | LPI2C_MSR_ALF_MASK | LPI2C_MSR_FEF_MASK | LPI2C_MSR_PLTF_MASK | LPI2C_MSR_DMF_MASK), LPI2C_MSR_SDF(value)))
#define LPI2C_BWR_MSR_SDF(base, value) (BME_BFI32(&LPI2C_MSR_REG(base), ((uint32_t)(value) << LPI2C_MSR_SDF_SHIFT), LPI2C_MSR_SDF_SHIFT, LPI2C_MSR_SDF_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MSR, field NDF[10] (W1C)
 *
 * This flag will set if the LPI2C master detects a NACK when transmitting an
 * address or data. If a NACK is expected for a given address (as configured by the
 * command word) then the flag will set if a NACK is not generated. When set,
 * the master will transmit a STOP condition and will not initiate a new START
 * condition until this flag has been cleared.
 *
 * Values:
 * - 0b0 - Unexpected NACK not detected.
 * - 0b1 - Unexpected NACK was detected.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MSR_NDF field. */
#define LPI2C_RD_MSR_NDF(base) ((LPI2C_MSR_REG(base) & LPI2C_MSR_NDF_MASK) >> LPI2C_MSR_NDF_SHIFT)
#define LPI2C_BRD_MSR_NDF(base) (BME_UBFX32(&LPI2C_MSR_REG(base), LPI2C_MSR_NDF_SHIFT, LPI2C_MSR_NDF_WIDTH))

/*! @brief Set the NDF field to a new value. */
#define LPI2C_WR_MSR_NDF(base, value) (LPI2C_RMW_MSR(base, (LPI2C_MSR_NDF_MASK | LPI2C_MSR_EPF_MASK | LPI2C_MSR_SDF_MASK | LPI2C_MSR_ALF_MASK | LPI2C_MSR_FEF_MASK | LPI2C_MSR_PLTF_MASK | LPI2C_MSR_DMF_MASK), LPI2C_MSR_NDF(value)))
#define LPI2C_BWR_MSR_NDF(base, value) (BME_BFI32(&LPI2C_MSR_REG(base), ((uint32_t)(value) << LPI2C_MSR_NDF_SHIFT), LPI2C_MSR_NDF_SHIFT, LPI2C_MSR_NDF_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MSR, field ALF[11] (W1C)
 *
 * This flag will set if the LPI2C master transmits a logic one and detects a
 * logic zero on the I2C bus, or if it detects a START or STOP condition while it
 * is transmitting data. When this flag sets, the LPI2C master will release the
 * bus (go idle) and will not initiate a new START condition until this flag has
 * been cleared.
 *
 * Values:
 * - 0b0 - Master has not lost arbitration.
 * - 0b1 - Master has lost arbitration.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MSR_ALF field. */
#define LPI2C_RD_MSR_ALF(base) ((LPI2C_MSR_REG(base) & LPI2C_MSR_ALF_MASK) >> LPI2C_MSR_ALF_SHIFT)
#define LPI2C_BRD_MSR_ALF(base) (BME_UBFX32(&LPI2C_MSR_REG(base), LPI2C_MSR_ALF_SHIFT, LPI2C_MSR_ALF_WIDTH))

/*! @brief Set the ALF field to a new value. */
#define LPI2C_WR_MSR_ALF(base, value) (LPI2C_RMW_MSR(base, (LPI2C_MSR_ALF_MASK | LPI2C_MSR_EPF_MASK | LPI2C_MSR_SDF_MASK | LPI2C_MSR_NDF_MASK | LPI2C_MSR_FEF_MASK | LPI2C_MSR_PLTF_MASK | LPI2C_MSR_DMF_MASK), LPI2C_MSR_ALF(value)))
#define LPI2C_BWR_MSR_ALF(base, value) (BME_BFI32(&LPI2C_MSR_REG(base), ((uint32_t)(value) << LPI2C_MSR_ALF_SHIFT), LPI2C_MSR_ALF_SHIFT, LPI2C_MSR_ALF_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MSR, field FEF[12] (W1C)
 *
 * Detects an attempt to send or receive data without first generating a
 * (repeated) START condition. This can occur if the transmit FIFO underflows when the
 * AUTOSTOP bit is set. When this flag is set, the LPI2C master will send a STOP
 * condition (if busy) and will not initiate a new START condition until this flag
 * has been cleared.
 *
 * Values:
 * - 0b0 - No error.
 * - 0b1 - Master sending or receiving data without START condition.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MSR_FEF field. */
#define LPI2C_RD_MSR_FEF(base) ((LPI2C_MSR_REG(base) & LPI2C_MSR_FEF_MASK) >> LPI2C_MSR_FEF_SHIFT)
#define LPI2C_BRD_MSR_FEF(base) (BME_UBFX32(&LPI2C_MSR_REG(base), LPI2C_MSR_FEF_SHIFT, LPI2C_MSR_FEF_WIDTH))

/*! @brief Set the FEF field to a new value. */
#define LPI2C_WR_MSR_FEF(base, value) (LPI2C_RMW_MSR(base, (LPI2C_MSR_FEF_MASK | LPI2C_MSR_EPF_MASK | LPI2C_MSR_SDF_MASK | LPI2C_MSR_NDF_MASK | LPI2C_MSR_ALF_MASK | LPI2C_MSR_PLTF_MASK | LPI2C_MSR_DMF_MASK), LPI2C_MSR_FEF(value)))
#define LPI2C_BWR_MSR_FEF(base, value) (BME_BFI32(&LPI2C_MSR_REG(base), ((uint32_t)(value) << LPI2C_MSR_FEF_SHIFT), LPI2C_MSR_FEF_SHIFT, LPI2C_MSR_FEF_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MSR, field PLTF[13] (W1C)
 *
 * Will set when the SCL and/or SDA input is low for more than PINLOW cycles,
 * even when the LPI2C master is idle. Software is responsible for resolving the
 * pin low condition. This flag cannot be cleared for as long as the pin low
 * timeout continues and must be cleared before the LPI2C can initiate a START
 * condition.
 *
 * Values:
 * - 0b0 - Pin low timeout has not occurred or is disabled.
 * - 0b1 - Pin low timeout has occurred.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MSR_PLTF field. */
#define LPI2C_RD_MSR_PLTF(base) ((LPI2C_MSR_REG(base) & LPI2C_MSR_PLTF_MASK) >> LPI2C_MSR_PLTF_SHIFT)
#define LPI2C_BRD_MSR_PLTF(base) (BME_UBFX32(&LPI2C_MSR_REG(base), LPI2C_MSR_PLTF_SHIFT, LPI2C_MSR_PLTF_WIDTH))

/*! @brief Set the PLTF field to a new value. */
#define LPI2C_WR_MSR_PLTF(base, value) (LPI2C_RMW_MSR(base, (LPI2C_MSR_PLTF_MASK | LPI2C_MSR_EPF_MASK | LPI2C_MSR_SDF_MASK | LPI2C_MSR_NDF_MASK | LPI2C_MSR_ALF_MASK | LPI2C_MSR_FEF_MASK | LPI2C_MSR_DMF_MASK), LPI2C_MSR_PLTF(value)))
#define LPI2C_BWR_MSR_PLTF(base, value) (BME_BFI32(&LPI2C_MSR_REG(base), ((uint32_t)(value) << LPI2C_MSR_PLTF_SHIFT), LPI2C_MSR_PLTF_SHIFT, LPI2C_MSR_PLTF_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MSR, field DMF[14] (W1C)
 *
 * Indicates that the received data has matched the MATCH0 and/or MATCH1 fields
 * as configured by MATCFG. Received data that is discarded due to CMD field does
 * not cause this flag to set.
 *
 * Values:
 * - 0b0 - Have not received matching data.
 * - 0b1 - Have received matching data.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MSR_DMF field. */
#define LPI2C_RD_MSR_DMF(base) ((LPI2C_MSR_REG(base) & LPI2C_MSR_DMF_MASK) >> LPI2C_MSR_DMF_SHIFT)
#define LPI2C_BRD_MSR_DMF(base) (BME_UBFX32(&LPI2C_MSR_REG(base), LPI2C_MSR_DMF_SHIFT, LPI2C_MSR_DMF_WIDTH))

/*! @brief Set the DMF field to a new value. */
#define LPI2C_WR_MSR_DMF(base, value) (LPI2C_RMW_MSR(base, (LPI2C_MSR_DMF_MASK | LPI2C_MSR_EPF_MASK | LPI2C_MSR_SDF_MASK | LPI2C_MSR_NDF_MASK | LPI2C_MSR_ALF_MASK | LPI2C_MSR_FEF_MASK | LPI2C_MSR_PLTF_MASK), LPI2C_MSR_DMF(value)))
#define LPI2C_BWR_MSR_DMF(base, value) (BME_BFI32(&LPI2C_MSR_REG(base), ((uint32_t)(value) << LPI2C_MSR_DMF_SHIFT), LPI2C_MSR_DMF_SHIFT, LPI2C_MSR_DMF_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MSR, field MBF[24] (RO)
 *
 * Values:
 * - 0b0 - I2C Master is idle.
 * - 0b1 - I2C Master is busy.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MSR_MBF field. */
#define LPI2C_RD_MSR_MBF(base) ((LPI2C_MSR_REG(base) & LPI2C_MSR_MBF_MASK) >> LPI2C_MSR_MBF_SHIFT)
#define LPI2C_BRD_MSR_MBF(base) (BME_UBFX32(&LPI2C_MSR_REG(base), LPI2C_MSR_MBF_SHIFT, LPI2C_MSR_MBF_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MSR, field BBF[25] (RO)
 *
 * Values:
 * - 0b0 - I2C Bus is idle.
 * - 0b1 - I2C Bus is busy.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MSR_BBF field. */
#define LPI2C_RD_MSR_BBF(base) ((LPI2C_MSR_REG(base) & LPI2C_MSR_BBF_MASK) >> LPI2C_MSR_BBF_SHIFT)
#define LPI2C_BRD_MSR_BBF(base) (BME_UBFX32(&LPI2C_MSR_REG(base), LPI2C_MSR_BBF_SHIFT, LPI2C_MSR_BBF_WIDTH))
/*@}*/

