pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * LPI2C_MIER - Master Interrupt Enable Register
 ******************************************************************************/

/*!
 * @brief LPI2C_MIER - Master Interrupt Enable Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPI2C_MIER register
 */
/*@{*/
#define LPI2C_RD_MIER(base)      (LPI2C_MIER_REG(base))
#define LPI2C_WR_MIER(base, value) (LPI2C_MIER_REG(base) = (value))
#define LPI2C_RMW_MIER(base, mask, value) (LPI2C_WR_MIER(base, (LPI2C_RD_MIER(base) & ~(mask)) | (value)))
#define LPI2C_SET_MIER(base, value) (BME_OR32(&LPI2C_MIER_REG(base), (uint32_t)(value)))
#define LPI2C_CLR_MIER(base, value) (BME_AND32(&LPI2C_MIER_REG(base), (uint32_t)(~(value))))
#define LPI2C_TOG_MIER(base, value) (BME_XOR32(&LPI2C_MIER_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LPI2C_MIER bitfields
 */

/*!
 * @name Register LPI2C_MIER, field TDIE[0] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MIER_TDIE field. */
#define LPI2C_RD_MIER_TDIE(base) ((LPI2C_MIER_REG(base) & LPI2C_MIER_TDIE_MASK) >> LPI2C_MIER_TDIE_SHIFT)
#define LPI2C_BRD_MIER_TDIE(base) (BME_UBFX32(&LPI2C_MIER_REG(base), LPI2C_MIER_TDIE_SHIFT, LPI2C_MIER_TDIE_WIDTH))

/*! @brief Set the TDIE field to a new value. */
#define LPI2C_WR_MIER_TDIE(base, value) (LPI2C_RMW_MIER(base, LPI2C_MIER_TDIE_MASK, LPI2C_MIER_TDIE(value)))
#define LPI2C_BWR_MIER_TDIE(base, value) (BME_BFI32(&LPI2C_MIER_REG(base), ((uint32_t)(value) << LPI2C_MIER_TDIE_SHIFT), LPI2C_MIER_TDIE_SHIFT, LPI2C_MIER_TDIE_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MIER, field RDIE[1] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MIER_RDIE field. */
#define LPI2C_RD_MIER_RDIE(base) ((LPI2C_MIER_REG(base) & LPI2C_MIER_RDIE_MASK) >> LPI2C_MIER_RDIE_SHIFT)
#define LPI2C_BRD_MIER_RDIE(base) (BME_UBFX32(&LPI2C_MIER_REG(base), LPI2C_MIER_RDIE_SHIFT, LPI2C_MIER_RDIE_WIDTH))

/*! @brief Set the RDIE field to a new value. */
#define LPI2C_WR_MIER_RDIE(base, value) (LPI2C_RMW_MIER(base, LPI2C_MIER_RDIE_MASK, LPI2C_MIER_RDIE(value)))
#define LPI2C_BWR_MIER_RDIE(base, value) (BME_BFI32(&LPI2C_MIER_REG(base), ((uint32_t)(value) << LPI2C_MIER_RDIE_SHIFT), LPI2C_MIER_RDIE_SHIFT, LPI2C_MIER_RDIE_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MIER, field EPIE[8] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MIER_EPIE field. */
#define LPI2C_RD_MIER_EPIE(base) ((LPI2C_MIER_REG(base) & LPI2C_MIER_EPIE_MASK) >> LPI2C_MIER_EPIE_SHIFT)
#define LPI2C_BRD_MIER_EPIE(base) (BME_UBFX32(&LPI2C_MIER_REG(base), LPI2C_MIER_EPIE_SHIFT, LPI2C_MIER_EPIE_WIDTH))

/*! @brief Set the EPIE field to a new value. */
#define LPI2C_WR_MIER_EPIE(base, value) (LPI2C_RMW_MIER(base, LPI2C_MIER_EPIE_MASK, LPI2C_MIER_EPIE(value)))
#define LPI2C_BWR_MIER_EPIE(base, value) (BME_BFI32(&LPI2C_MIER_REG(base), ((uint32_t)(value) << LPI2C_MIER_EPIE_SHIFT), LPI2C_MIER_EPIE_SHIFT, LPI2C_MIER_EPIE_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MIER, field SDIE[9] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MIER_SDIE field. */
#define LPI2C_RD_MIER_SDIE(base) ((LPI2C_MIER_REG(base) & LPI2C_MIER_SDIE_MASK) >> LPI2C_MIER_SDIE_SHIFT)
#define LPI2C_BRD_MIER_SDIE(base) (BME_UBFX32(&LPI2C_MIER_REG(base), LPI2C_MIER_SDIE_SHIFT, LPI2C_MIER_SDIE_WIDTH))

/*! @brief Set the SDIE field to a new value. */
#define LPI2C_WR_MIER_SDIE(base, value) (LPI2C_RMW_MIER(base, LPI2C_MIER_SDIE_MASK, LPI2C_MIER_SDIE(value)))
#define LPI2C_BWR_MIER_SDIE(base, value) (BME_BFI32(&LPI2C_MIER_REG(base), ((uint32_t)(value) << LPI2C_MIER_SDIE_SHIFT), LPI2C_MIER_SDIE_SHIFT, LPI2C_MIER_SDIE_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MIER, field NDIE[10] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MIER_NDIE field. */
#define LPI2C_RD_MIER_NDIE(base) ((LPI2C_MIER_REG(base) & LPI2C_MIER_NDIE_MASK) >> LPI2C_MIER_NDIE_SHIFT)
#define LPI2C_BRD_MIER_NDIE(base) (BME_UBFX32(&LPI2C_MIER_REG(base), LPI2C_MIER_NDIE_SHIFT, LPI2C_MIER_NDIE_WIDTH))

/*! @brief Set the NDIE field to a new value. */
#define LPI2C_WR_MIER_NDIE(base, value) (LPI2C_RMW_MIER(base, LPI2C_MIER_NDIE_MASK, LPI2C_MIER_NDIE(value)))
#define LPI2C_BWR_MIER_NDIE(base, value) (BME_BFI32(&LPI2C_MIER_REG(base), ((uint32_t)(value) << LPI2C_MIER_NDIE_SHIFT), LPI2C_MIER_NDIE_SHIFT, LPI2C_MIER_NDIE_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MIER, field ALIE[11] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MIER_ALIE field. */
#define LPI2C_RD_MIER_ALIE(base) ((LPI2C_MIER_REG(base) & LPI2C_MIER_ALIE_MASK) >> LPI2C_MIER_ALIE_SHIFT)
#define LPI2C_BRD_MIER_ALIE(base) (BME_UBFX32(&LPI2C_MIER_REG(base), LPI2C_MIER_ALIE_SHIFT, LPI2C_MIER_ALIE_WIDTH))

/*! @brief Set the ALIE field to a new value. */
#define LPI2C_WR_MIER_ALIE(base, value) (LPI2C_RMW_MIER(base, LPI2C_MIER_ALIE_MASK, LPI2C_MIER_ALIE(value)))
#define LPI2C_BWR_MIER_ALIE(base, value) (BME_BFI32(&LPI2C_MIER_REG(base), ((uint32_t)(value) << LPI2C_MIER_ALIE_SHIFT), LPI2C_MIER_ALIE_SHIFT, LPI2C_MIER_ALIE_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MIER, field FEIE[12] (RW)
 *
 * Values:
 * - 0b0 - Interrupt enabled.
 * - 0b1 - Interrupt disabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MIER_FEIE field. */
#define LPI2C_RD_MIER_FEIE(base) ((LPI2C_MIER_REG(base) & LPI2C_MIER_FEIE_MASK) >> LPI2C_MIER_FEIE_SHIFT)
#define LPI2C_BRD_MIER_FEIE(base) (BME_UBFX32(&LPI2C_MIER_REG(base), LPI2C_MIER_FEIE_SHIFT, LPI2C_MIER_FEIE_WIDTH))

/*! @brief Set the FEIE field to a new value. */
#define LPI2C_WR_MIER_FEIE(base, value) (LPI2C_RMW_MIER(base, LPI2C_MIER_FEIE_MASK, LPI2C_MIER_FEIE(value)))
#define LPI2C_BWR_MIER_FEIE(base, value) (BME_BFI32(&LPI2C_MIER_REG(base), ((uint32_t)(value) << LPI2C_MIER_FEIE_SHIFT), LPI2C_MIER_FEIE_SHIFT, LPI2C_MIER_FEIE_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MIER, field PLTIE[13] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MIER_PLTIE field. */
#define LPI2C_RD_MIER_PLTIE(base) ((LPI2C_MIER_REG(base) & LPI2C_MIER_PLTIE_MASK) >> LPI2C_MIER_PLTIE_SHIFT)
#define LPI2C_BRD_MIER_PLTIE(base) (BME_UBFX32(&LPI2C_MIER_REG(base), LPI2C_MIER_PLTIE_SHIFT, LPI2C_MIER_PLTIE_WIDTH))

