pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * LPI2C_MCFGR1 - Master Configuration Register 1
 ******************************************************************************/

/*!
 * @brief LPI2C_MCFGR1 - Master Configuration Register 1 (RW)
 *
 * Reset value: 0x00000000U
 *
 * The MCFGR1 should only be written when the I2C Master is disabled.
 */
/*!
 * @name Constants and macros for entire LPI2C_MCFGR1 register
 */
/*@{*/
#define LPI2C_RD_MCFGR1(base)    (LPI2C_MCFGR1_REG(base))
#define LPI2C_WR_MCFGR1(base, value) (LPI2C_MCFGR1_REG(base) = (value))
#define LPI2C_RMW_MCFGR1(base, mask, value) (LPI2C_WR_MCFGR1(base, (LPI2C_RD_MCFGR1(base) & ~(mask)) | (value)))
#define LPI2C_SET_MCFGR1(base, value) (BME_OR32(&LPI2C_MCFGR1_REG(base), (uint32_t)(value)))
#define LPI2C_CLR_MCFGR1(base, value) (BME_AND32(&LPI2C_MCFGR1_REG(base), (uint32_t)(~(value))))
#define LPI2C_TOG_MCFGR1(base, value) (BME_XOR32(&LPI2C_MCFGR1_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LPI2C_MCFGR1 bitfields
 */

/*!
 * @name Register LPI2C_MCFGR1, field PRESCALE[2:0] (RW)
 *
 * Configures the clock prescaler used for all LPI2C master logic, except the
 * digital glitch filters.
 *
 * Values:
 * - 0b000 - Divide by 1.
 * - 0b001 - Divide by 2.
 * - 0b010 - Divide by 4.
 * - 0b011 - Divide by 8.
 * - 0b100 - Divide by 16.
 * - 0b101 - Divide by 32.
 * - 0b110 - Divide by 64.
 * - 0b111 - Divide by 128.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MCFGR1_PRESCALE field. */
#define LPI2C_RD_MCFGR1_PRESCALE(base) ((LPI2C_MCFGR1_REG(base) & LPI2C_MCFGR1_PRESCALE_MASK) >> LPI2C_MCFGR1_PRESCALE_SHIFT)
#define LPI2C_BRD_MCFGR1_PRESCALE(base) (BME_UBFX32(&LPI2C_MCFGR1_REG(base), LPI2C_MCFGR1_PRESCALE_SHIFT, LPI2C_MCFGR1_PRESCALE_WIDTH))

/*! @brief Set the PRESCALE field to a new value. */
#define LPI2C_WR_MCFGR1_PRESCALE(base, value) (LPI2C_RMW_MCFGR1(base, LPI2C_MCFGR1_PRESCALE_MASK, LPI2C_MCFGR1_PRESCALE(value)))
#define LPI2C_BWR_MCFGR1_PRESCALE(base, value) (BME_BFI32(&LPI2C_MCFGR1_REG(base), ((uint32_t)(value) << LPI2C_MCFGR1_PRESCALE_SHIFT), LPI2C_MCFGR1_PRESCALE_SHIFT, LPI2C_MCFGR1_PRESCALE_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MCFGR1, field AUTOSTOP[8] (RW)
 *
 * When enabled, a STOP condition is generated whenever the LPI2C master is busy
 * and the transmit FIFO is empty. The STOP condition can also be generated
 * using a transmit FIFO command.
 *
 * Values:
 * - 0b0 - No effect.
 * - 0b1 - STOP condition is automatically generated whenever the transmit FIFO
 *     is empty and LPI2C master is busy.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MCFGR1_AUTOSTOP field. */
#define LPI2C_RD_MCFGR1_AUTOSTOP(base) ((LPI2C_MCFGR1_REG(base) & LPI2C_MCFGR1_AUTOSTOP_MASK) >> LPI2C_MCFGR1_AUTOSTOP_SHIFT)
#define LPI2C_BRD_MCFGR1_AUTOSTOP(base) (BME_UBFX32(&LPI2C_MCFGR1_REG(base), LPI2C_MCFGR1_AUTOSTOP_SHIFT, LPI2C_MCFGR1_AUTOSTOP_WIDTH))

/*! @brief Set the AUTOSTOP field to a new value. */
#define LPI2C_WR_MCFGR1_AUTOSTOP(base, value) (LPI2C_RMW_MCFGR1(base, LPI2C_MCFGR1_AUTOSTOP_MASK, LPI2C_MCFGR1_AUTOSTOP(value)))
#define LPI2C_BWR_MCFGR1_AUTOSTOP(base, value) (BME_BFI32(&LPI2C_MCFGR1_REG(base), ((uint32_t)(value) << LPI2C_MCFGR1_AUTOSTOP_SHIFT), LPI2C_MCFGR1_AUTOSTOP_SHIFT, LPI2C_MCFGR1_AUTOSTOP_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MCFGR1, field IGNACK[9] (RW)
 *
 * When set, the received NACK field is ignored and assumed to be ACK. This bit
 * is required to be set in Ultra-Fast Mode.
 *
 * Values:
 * - 0b0 - LPI2C Master will receive ACK and NACK normally.
 * - 0b1 - LPI2C Master will treat a received NACK as if it was an ACK.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MCFGR1_IGNACK field. */
#define LPI2C_RD_MCFGR1_IGNACK(base) ((LPI2C_MCFGR1_REG(base) & LPI2C_MCFGR1_IGNACK_MASK) >> LPI2C_MCFGR1_IGNACK_SHIFT)
#define LPI2C_BRD_MCFGR1_IGNACK(base) (BME_UBFX32(&LPI2C_MCFGR1_REG(base), LPI2C_MCFGR1_IGNACK_SHIFT, LPI2C_MCFGR1_IGNACK_WIDTH))

/*! @brief Set the IGNACK field to a new value. */
#define LPI2C_WR_MCFGR1_IGNACK(base, value) (LPI2C_RMW_MCFGR1(base, LPI2C_MCFGR1_IGNACK_MASK, LPI2C_MCFGR1_IGNACK(value)))
#define LPI2C_BWR_MCFGR1_IGNACK(base, value) (BME_BFI32(&LPI2C_MCFGR1_REG(base), ((uint32_t)(value) << LPI2C_MCFGR1_IGNACK_SHIFT), LPI2C_MCFGR1_IGNACK_SHIFT, LPI2C_MCFGR1_IGNACK_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MCFGR1, field TIMECFG[10] (RW)
 *
 * Values:
 * - 0b0 - Pin Low Timeout Flag will set if SCL is low for longer than the
 *     configured timeout.
 * - 0b1 - Pin Low Timeout Flag will set if either SCL or SDA is low for longer
 *     than the configured timeout.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MCFGR1_TIMECFG field. */
#define LPI2C_RD_MCFGR1_TIMECFG(base) ((LPI2C_MCFGR1_REG(base) & LPI2C_MCFGR1_TIMECFG_MASK) >> LPI2C_MCFGR1_TIMECFG_SHIFT)
#define LPI2C_BRD_MCFGR1_TIMECFG(base) (BME_UBFX32(&LPI2C_MCFGR1_REG(base), LPI2C_MCFGR1_TIMECFG_SHIFT, LPI2C_MCFGR1_TIMECFG_WIDTH))

/*! @brief Set the TIMECFG field to a new value. */
#define LPI2C_WR_MCFGR1_TIMECFG(base, value) (LPI2C_RMW_MCFGR1(base, LPI2C_MCFGR1_TIMECFG_MASK, LPI2C_MCFGR1_TIMECFG(value)))
#define LPI2C_BWR_MCFGR1_TIMECFG(base, value) (BME_BFI32(&LPI2C_MCFGR1_REG(base), ((uint32_t)(value) << LPI2C_MCFGR1_TIMECFG_SHIFT), LPI2C_MCFGR1_TIMECFG_SHIFT, LPI2C_MCFGR1_TIMECFG_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MCFGR1, field MATCFG[18:16] (RW)
 *
 * Configures the condition that will cause the DMF to set.
 *
 * Values:
 * - 0b000 - Match disabled.
 * - 0b001 - Reserved.
 * - 0b010 - Match enabled (1st data word equals MATCH0 OR MATCH1).
 * - 0b011 - Match enabled (any data word equals MATCH0 OR MATCH1).
 * - 0b100 - Match enabled (1st data word equals MATCH0 AND 2nd data word equals
 *     MATCH1).
 * - 0b101 - Match enabled (any data word equals MATCH0 AND next data word
 *     equals MATCH1).
 * - 0b110 - Match enabled (1st data word AND MATCH1 equals MATCH0 AND MATCH1).
 * - 0b111 - Match enabled (any data word AND MATCH1 equals MATCH0 AND MATCH1).
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MCFGR1_MATCFG field. */
#define LPI2C_RD_MCFGR1_MATCFG(base) ((LPI2C_MCFGR1_REG(base) & LPI2C_MCFGR1_MATCFG_MASK) >> LPI2C_MCFGR1_MATCFG_SHIFT)
#define LPI2C_BRD_MCFGR1_MATCFG(base) (BME_UBFX32(&LPI2C_MCFGR1_REG(base), LPI2C_MCFGR1_MATCFG_SHIFT, LPI2C_MCFGR1_MATCFG_WIDTH))

/*! @brief Set the MATCFG field to a new value. */
#define LPI2C_WR_MCFGR1_MATCFG(base, value) (LPI2C_RMW_MCFGR1(base, LPI2C_MCFGR1_MATCFG_MASK, LPI2C_MCFGR1_MATCFG(value)))
#define LPI2C_BWR_MCFGR1_MATCFG(base, value) (BME_BFI32(&LPI2C_MCFGR1_REG(base), ((uint32_t)(value) << LPI2C_MCFGR1_MATCFG_SHIFT), LPI2C_MCFGR1_MATCFG_SHIFT, LPI2C_MCFGR1_MATCFG_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MCFGR1, field PINCFG[26:24] (RW)
 *
 * Configures the pin mode.
 *
 * Values:
 * - 0b000 - LPI2C configured for 2-pin open drain mode.
 * - 0b001 - LPI2C configured for 2-pin output only mode (ultra-fast mode).
 * - 0b010 - LPI2C configured for 2-pin push-pull mode.
 * - 0b011 - LPI2C configured for 4-pin push-pull mode.
 * - 0b100 - LPI2C configured for 2-pin open drain mode with separate LPI2C
 *     slave.
 * - 0b101 - LPI2C configured for 2-pin output only mode (ultra-fast mode) with
 *     separate LPI2C slave.
 * - 0b110 - LPI2C configured for 2-pin push-pull mode with separate LPI2C slave.
 * - 0b111 - LPI2C configured for 4-pin push-pull mode (inverted outputs).
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MCFGR1_PINCFG field. */
#define LPI2C_RD_MCFGR1_PINCFG(base) ((LPI2C_MCFGR1_REG(base) & LPI2C_MCFGR1_PINCFG_MASK) >> LPI2C_MCFGR1_PINCFG_SHIFT)
#define LPI2C_BRD_MCFGR1_PINCFG(base) (BME_UBFX32(&LPI2C_MCFGR1_REG(base), LPI2C_MCFGR1_PINCFG_SHIFT, LPI2C_MCFGR1_PINCFG_WIDTH))

