pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the PINLOW field to a new value. */
#define LPI2C_WR_MCFGR3_PINLOW(base, value) (LPI2C_RMW_MCFGR3(base, LPI2C_MCFGR3_PINLOW_MASK, LPI2C_MCFGR3_PINLOW(value)))
#define LPI2C_BWR_MCFGR3_PINLOW(base, value) (LPI2C_WR_MCFGR3_PINLOW(base, value))
/*@}*/

/*******************************************************************************
 * LPI2C_MDMR - Master Data Match Register
 ******************************************************************************/

/*!
 * @brief LPI2C_MDMR - Master Data Match Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPI2C_MDMR register
 */
/*@{*/
#define LPI2C_RD_MDMR(base)      (LPI2C_MDMR_REG(base))
#define LPI2C_WR_MDMR(base, value) (LPI2C_MDMR_REG(base) = (value))
#define LPI2C_RMW_MDMR(base, mask, value) (LPI2C_WR_MDMR(base, (LPI2C_RD_MDMR(base) & ~(mask)) | (value)))
#define LPI2C_SET_MDMR(base, value) (BME_OR32(&LPI2C_MDMR_REG(base), (uint32_t)(value)))
#define LPI2C_CLR_MDMR(base, value) (BME_AND32(&LPI2C_MDMR_REG(base), (uint32_t)(~(value))))
#define LPI2C_TOG_MDMR(base, value) (BME_XOR32(&LPI2C_MDMR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LPI2C_MDMR bitfields
 */

/*!
 * @name Register LPI2C_MDMR, field MATCH0[7:0] (RW)
 *
 * Compared against the received data when receive data match is enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MDMR_MATCH0 field. */
#define LPI2C_RD_MDMR_MATCH0(base) ((LPI2C_MDMR_REG(base) & LPI2C_MDMR_MATCH0_MASK) >> LPI2C_MDMR_MATCH0_SHIFT)
#define LPI2C_BRD_MDMR_MATCH0(base) (BME_UBFX32(&LPI2C_MDMR_REG(base), LPI2C_MDMR_MATCH0_SHIFT, LPI2C_MDMR_MATCH0_WIDTH))

/*! @brief Set the MATCH0 field to a new value. */
#define LPI2C_WR_MDMR_MATCH0(base, value) (LPI2C_RMW_MDMR(base, LPI2C_MDMR_MATCH0_MASK, LPI2C_MDMR_MATCH0(value)))
#define LPI2C_BWR_MDMR_MATCH0(base, value) (BME_BFI32(&LPI2C_MDMR_REG(base), ((uint32_t)(value) << LPI2C_MDMR_MATCH0_SHIFT), LPI2C_MDMR_MATCH0_SHIFT, LPI2C_MDMR_MATCH0_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MDMR, field MATCH1[23:16] (RW)
 *
 * Compared against the received data when receive data match is enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MDMR_MATCH1 field. */
#define LPI2C_RD_MDMR_MATCH1(base) ((LPI2C_MDMR_REG(base) & LPI2C_MDMR_MATCH1_MASK) >> LPI2C_MDMR_MATCH1_SHIFT)
#define LPI2C_BRD_MDMR_MATCH1(base) (BME_UBFX32(&LPI2C_MDMR_REG(base), LPI2C_MDMR_MATCH1_SHIFT, LPI2C_MDMR_MATCH1_WIDTH))

/*! @brief Set the MATCH1 field to a new value. */
#define LPI2C_WR_MDMR_MATCH1(base, value) (LPI2C_RMW_MDMR(base, LPI2C_MDMR_MATCH1_MASK, LPI2C_MDMR_MATCH1(value)))
#define LPI2C_BWR_MDMR_MATCH1(base, value) (BME_BFI32(&LPI2C_MDMR_REG(base), ((uint32_t)(value) << LPI2C_MDMR_MATCH1_SHIFT), LPI2C_MDMR_MATCH1_SHIFT, LPI2C_MDMR_MATCH1_WIDTH))
/*@}*/

/*******************************************************************************
 * LPI2C_MCCR0 - Master Clock Configuration Register 0
 ******************************************************************************/

/*!
 * @brief LPI2C_MCCR0 - Master Clock Configuration Register 0 (RW)
 *
 * Reset value: 0x00000000U
 *
 * The MCCR0 cannot be changed when the I2C master is enabled and is used for
 * standard, fast, fast-mode plus and ultra-fast transfers.
 */
/*!
 * @name Constants and macros for entire LPI2C_MCCR0 register
 */
/*@{*/
#define LPI2C_RD_MCCR0(base)     (LPI2C_MCCR0_REG(base))
#define LPI2C_WR_MCCR0(base, value) (LPI2C_MCCR0_REG(base) = (value))
#define LPI2C_RMW_MCCR0(base, mask, value) (LPI2C_WR_MCCR0(base, (LPI2C_RD_MCCR0(base) & ~(mask)) | (value)))
#define LPI2C_SET_MCCR0(base, value) (BME_OR32(&LPI2C_MCCR0_REG(base), (uint32_t)(value)))
#define LPI2C_CLR_MCCR0(base, value) (BME_AND32(&LPI2C_MCCR0_REG(base), (uint32_t)(~(value))))
#define LPI2C_TOG_MCCR0(base, value) (BME_XOR32(&LPI2C_MCCR0_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LPI2C_MCCR0 bitfields
 */

/*!
 * @name Register LPI2C_MCCR0, field CLKLO[5:0] (RW)
 *
 * Minimum number of cycles (minus one) that the SCL clock is driven low by the
 * master. This value is also used for the minimum bus free time between a STOP
 * and a START condition.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MCCR0_CLKLO field. */
#define LPI2C_RD_MCCR0_CLKLO(base) ((LPI2C_MCCR0_REG(base) & LPI2C_MCCR0_CLKLO_MASK) >> LPI2C_MCCR0_CLKLO_SHIFT)
#define LPI2C_BRD_MCCR0_CLKLO(base) (BME_UBFX32(&LPI2C_MCCR0_REG(base), LPI2C_MCCR0_CLKLO_SHIFT, LPI2C_MCCR0_CLKLO_WIDTH))

/*! @brief Set the CLKLO field to a new value. */
#define LPI2C_WR_MCCR0_CLKLO(base, value) (LPI2C_RMW_MCCR0(base, LPI2C_MCCR0_CLKLO_MASK, LPI2C_MCCR0_CLKLO(value)))
#define LPI2C_BWR_MCCR0_CLKLO(base, value) (BME_BFI32(&LPI2C_MCCR0_REG(base), ((uint32_t)(value) << LPI2C_MCCR0_CLKLO_SHIFT), LPI2C_MCCR0_CLKLO_SHIFT, LPI2C_MCCR0_CLKLO_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MCCR0, field CLKHI[13:8] (RW)
 *
 * Minimum number of cycles (minus one) that the SCL clock is driven high by the
 * master. The SCL high time is extended by the time it takes to detect a rising
 * edge on the external SCL pin. Ignoring any additional board delay due to
 * external loading, this is equal to (2 + FILTSCL) / 2^PRESCALE cycles.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MCCR0_CLKHI field. */
#define LPI2C_RD_MCCR0_CLKHI(base) ((LPI2C_MCCR0_REG(base) & LPI2C_MCCR0_CLKHI_MASK) >> LPI2C_MCCR0_CLKHI_SHIFT)
#define LPI2C_BRD_MCCR0_CLKHI(base) (BME_UBFX32(&LPI2C_MCCR0_REG(base), LPI2C_MCCR0_CLKHI_SHIFT, LPI2C_MCCR0_CLKHI_WIDTH))

/*! @brief Set the CLKHI field to a new value. */
#define LPI2C_WR_MCCR0_CLKHI(base, value) (LPI2C_RMW_MCCR0(base, LPI2C_MCCR0_CLKHI_MASK, LPI2C_MCCR0_CLKHI(value)))
#define LPI2C_BWR_MCCR0_CLKHI(base, value) (BME_BFI32(&LPI2C_MCCR0_REG(base), ((uint32_t)(value) << LPI2C_MCCR0_CLKHI_SHIFT), LPI2C_MCCR0_CLKHI_SHIFT, LPI2C_MCCR0_CLKHI_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MCCR0, field SETHOLD[21:16] (RW)
 *
 * Minimum number of cycles (minus one) that is used by the master as the setup
 * and hold time for a (repeated) START condition and setup time for a STOP
 * condition. The setup time is extended by the time it takes to detect a rising edge
 * on the external SCL pin. Ignoring any additional board delay due to external
 * loading, this is equal to (2 + FILTSCL) / 2^PRESCALE cycles.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MCCR0_SETHOLD field. */
#define LPI2C_RD_MCCR0_SETHOLD(base) ((LPI2C_MCCR0_REG(base) & LPI2C_MCCR0_SETHOLD_MASK) >> LPI2C_MCCR0_SETHOLD_SHIFT)
#define LPI2C_BRD_MCCR0_SETHOLD(base) (BME_UBFX32(&LPI2C_MCCR0_REG(base), LPI2C_MCCR0_SETHOLD_SHIFT, LPI2C_MCCR0_SETHOLD_WIDTH))

/*! @brief Set the SETHOLD field to a new value. */
#define LPI2C_WR_MCCR0_SETHOLD(base, value) (LPI2C_RMW_MCCR0(base, LPI2C_MCCR0_SETHOLD_MASK, LPI2C_MCCR0_SETHOLD(value)))
#define LPI2C_BWR_MCCR0_SETHOLD(base, value) (BME_BFI32(&LPI2C_MCCR0_REG(base), ((uint32_t)(value) << LPI2C_MCCR0_SETHOLD_SHIFT), LPI2C_MCCR0_SETHOLD_SHIFT, LPI2C_MCCR0_SETHOLD_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MCCR0, field DATAVD[29:24] (RW)
 *
 * Minimum number of cycles (minus one) that is used as the data hold time for
 * SDA. Must be configured less than the minimum SCL low period.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MCCR0_DATAVD field. */
#define LPI2C_RD_MCCR0_DATAVD(base) ((LPI2C_MCCR0_REG(base) & LPI2C_MCCR0_DATAVD_MASK) >> LPI2C_MCCR0_DATAVD_SHIFT)
#define LPI2C_BRD_MCCR0_DATAVD(base) (BME_UBFX32(&LPI2C_MCCR0_REG(base), LPI2C_MCCR0_DATAVD_SHIFT, LPI2C_MCCR0_DATAVD_WIDTH))

/*! @brief Set the DATAVD field to a new value. */
#define LPI2C_WR_MCCR0_DATAVD(base, value) (LPI2C_RMW_MCCR0(base, LPI2C_MCCR0_DATAVD_MASK, LPI2C_MCCR0_DATAVD(value)))
#define LPI2C_BWR_MCCR0_DATAVD(base, value) (BME_BFI32(&LPI2C_MCCR0_REG(base), ((uint32_t)(value) << LPI2C_MCCR0_DATAVD_SHIFT), LPI2C_MCCR0_DATAVD_SHIFT, LPI2C_MCCR0_DATAVD_WIDTH))
/*@}*/

