pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * LPI2C_MCCR1 - Master Clock Configuration Register 1
 ******************************************************************************/

/*!
 * @brief LPI2C_MCCR1 - Master Clock Configuration Register 1 (RW)
 *
 * Reset value: 0x00000000U
 *
 * The MCCR1 cannot be changed when the I2C master is enabled and is used for
 * high speed mode transfers. The separate clock configuration for high speed mode
 * allows arbitration to take place in Fast mode (with timing configured by
 * MCCR0), before switching to high speed mode (with timing configured by MCCR1).
 */
/*!
 * @name Constants and macros for entire LPI2C_MCCR1 register
 */
/*@{*/
#define LPI2C_RD_MCCR1(base)     (LPI2C_MCCR1_REG(base))
#define LPI2C_WR_MCCR1(base, value) (LPI2C_MCCR1_REG(base) = (value))
#define LPI2C_RMW_MCCR1(base, mask, value) (LPI2C_WR_MCCR1(base, (LPI2C_RD_MCCR1(base) & ~(mask)) | (value)))
#define LPI2C_SET_MCCR1(base, value) (BME_OR32(&LPI2C_MCCR1_REG(base), (uint32_t)(value)))
#define LPI2C_CLR_MCCR1(base, value) (BME_AND32(&LPI2C_MCCR1_REG(base), (uint32_t)(~(value))))
#define LPI2C_TOG_MCCR1(base, value) (BME_XOR32(&LPI2C_MCCR1_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LPI2C_MCCR1 bitfields
 */

/*!
 * @name Register LPI2C_MCCR1, field CLKLO[5:0] (RW)
 *
 * Minimum number of cycles (minus one) that the SCL clock is driven low by the
 * master. This value is also used for the minimum bus free time between a STOP
 * and a START condition.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MCCR1_CLKLO field. */
#define LPI2C_RD_MCCR1_CLKLO(base) ((LPI2C_MCCR1_REG(base) & LPI2C_MCCR1_CLKLO_MASK) >> LPI2C_MCCR1_CLKLO_SHIFT)
#define LPI2C_BRD_MCCR1_CLKLO(base) (BME_UBFX32(&LPI2C_MCCR1_REG(base), LPI2C_MCCR1_CLKLO_SHIFT, LPI2C_MCCR1_CLKLO_WIDTH))

/*! @brief Set the CLKLO field to a new value. */
#define LPI2C_WR_MCCR1_CLKLO(base, value) (LPI2C_RMW_MCCR1(base, LPI2C_MCCR1_CLKLO_MASK, LPI2C_MCCR1_CLKLO(value)))
#define LPI2C_BWR_MCCR1_CLKLO(base, value) (BME_BFI32(&LPI2C_MCCR1_REG(base), ((uint32_t)(value) << LPI2C_MCCR1_CLKLO_SHIFT), LPI2C_MCCR1_CLKLO_SHIFT, LPI2C_MCCR1_CLKLO_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MCCR1, field CLKHI[13:8] (RW)
 *
 * Minimum number of cycles (minus one) that the SCL clock is driven high by the
 * master. The SCL high time is extended by the time it takes to detect a rising
 * edge on the external SCL pin. Ignoring any additional board delay due to
 * external loading, this is equal to (2 + FILTSCL) / 2^PRESCALE cycles.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MCCR1_CLKHI field. */
#define LPI2C_RD_MCCR1_CLKHI(base) ((LPI2C_MCCR1_REG(base) & LPI2C_MCCR1_CLKHI_MASK) >> LPI2C_MCCR1_CLKHI_SHIFT)
#define LPI2C_BRD_MCCR1_CLKHI(base) (BME_UBFX32(&LPI2C_MCCR1_REG(base), LPI2C_MCCR1_CLKHI_SHIFT, LPI2C_MCCR1_CLKHI_WIDTH))

/*! @brief Set the CLKHI field to a new value. */
#define LPI2C_WR_MCCR1_CLKHI(base, value) (LPI2C_RMW_MCCR1(base, LPI2C_MCCR1_CLKHI_MASK, LPI2C_MCCR1_CLKHI(value)))
#define LPI2C_BWR_MCCR1_CLKHI(base, value) (BME_BFI32(&LPI2C_MCCR1_REG(base), ((uint32_t)(value) << LPI2C_MCCR1_CLKHI_SHIFT), LPI2C_MCCR1_CLKHI_SHIFT, LPI2C_MCCR1_CLKHI_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MCCR1, field SETHOLD[21:16] (RW)
 *
 * Minimum number of cycles (minus one) that is used by the master as the setup
 * and hold time for a (repeated) START condition and setup time for a STOP
 * condition. The setup time is extended by the time it takes to detect a rising edge
 * on the external SCL pin. Ignoring any additional board delay due to external
 * loading, this is equal to (2 + FILTSCL) / 2^PRESCALE cycles.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MCCR1_SETHOLD field. */
#define LPI2C_RD_MCCR1_SETHOLD(base) ((LPI2C_MCCR1_REG(base) & LPI2C_MCCR1_SETHOLD_MASK) >> LPI2C_MCCR1_SETHOLD_SHIFT)
#define LPI2C_BRD_MCCR1_SETHOLD(base) (BME_UBFX32(&LPI2C_MCCR1_REG(base), LPI2C_MCCR1_SETHOLD_SHIFT, LPI2C_MCCR1_SETHOLD_WIDTH))

/*! @brief Set the SETHOLD field to a new value. */
#define LPI2C_WR_MCCR1_SETHOLD(base, value) (LPI2C_RMW_MCCR1(base, LPI2C_MCCR1_SETHOLD_MASK, LPI2C_MCCR1_SETHOLD(value)))
#define LPI2C_BWR_MCCR1_SETHOLD(base, value) (BME_BFI32(&LPI2C_MCCR1_REG(base), ((uint32_t)(value) << LPI2C_MCCR1_SETHOLD_SHIFT), LPI2C_MCCR1_SETHOLD_SHIFT, LPI2C_MCCR1_SETHOLD_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MCCR1, field DATAVD[29:24] (RW)
 *
 * Minimum number of cycles (minus one) that is used as the data hold time for
 * SDA. Must be configured less than the minimum SCL low period.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MCCR1_DATAVD field. */
#define LPI2C_RD_MCCR1_DATAVD(base) ((LPI2C_MCCR1_REG(base) & LPI2C_MCCR1_DATAVD_MASK) >> LPI2C_MCCR1_DATAVD_SHIFT)
#define LPI2C_BRD_MCCR1_DATAVD(base) (BME_UBFX32(&LPI2C_MCCR1_REG(base), LPI2C_MCCR1_DATAVD_SHIFT, LPI2C_MCCR1_DATAVD_WIDTH))

/*! @brief Set the DATAVD field to a new value. */
#define LPI2C_WR_MCCR1_DATAVD(base, value) (LPI2C_RMW_MCCR1(base, LPI2C_MCCR1_DATAVD_MASK, LPI2C_MCCR1_DATAVD(value)))
#define LPI2C_BWR_MCCR1_DATAVD(base, value) (BME_BFI32(&LPI2C_MCCR1_REG(base), ((uint32_t)(value) << LPI2C_MCCR1_DATAVD_SHIFT), LPI2C_MCCR1_DATAVD_SHIFT, LPI2C_MCCR1_DATAVD_WIDTH))
/*@}*/

/*******************************************************************************
 * LPI2C_MFCR - Master FIFO Control Register
 ******************************************************************************/

/*!
 * @brief LPI2C_MFCR - Master FIFO Control Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPI2C_MFCR register
 */
/*@{*/
#define LPI2C_RD_MFCR(base)      (LPI2C_MFCR_REG(base))
#define LPI2C_WR_MFCR(base, value) (LPI2C_MFCR_REG(base) = (value))
#define LPI2C_RMW_MFCR(base, mask, value) (LPI2C_WR_MFCR(base, (LPI2C_RD_MFCR(base) & ~(mask)) | (value)))
#define LPI2C_SET_MFCR(base, value) (BME_OR32(&LPI2C_MFCR_REG(base), (uint32_t)(value)))
#define LPI2C_CLR_MFCR(base, value) (BME_AND32(&LPI2C_MFCR_REG(base), (uint32_t)(~(value))))
#define LPI2C_TOG_MFCR(base, value) (BME_XOR32(&LPI2C_MFCR_REG(base), (uint32_t)(value)))
/*@}*/

