pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * Constants & macros for individual LPI2C_MRDR bitfields
 */

/*!
 * @name Register LPI2C_MRDR, field DATA[7:0] (RO)
 *
 * Reading this register returns the data received by the I2C master that has
 * not been discarded. Receive data can be discarded due to the CMD field or the
 * master can be configured to discard non-matching data.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MRDR_DATA field. */
#define LPI2C_RD_MRDR_DATA(base) ((LPI2C_MRDR_REG(base) & LPI2C_MRDR_DATA_MASK) >> LPI2C_MRDR_DATA_SHIFT)
#define LPI2C_BRD_MRDR_DATA(base) (BME_UBFX32(&LPI2C_MRDR_REG(base), LPI2C_MRDR_DATA_SHIFT, LPI2C_MRDR_DATA_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_MRDR, field RXEMPTY[14] (RO)
 *
 * Values:
 * - 0b0 - Receive FIFO is not empty.
 * - 0b1 - Receive FIFO is empty.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_MRDR_RXEMPTY field. */
#define LPI2C_RD_MRDR_RXEMPTY(base) ((LPI2C_MRDR_REG(base) & LPI2C_MRDR_RXEMPTY_MASK) >> LPI2C_MRDR_RXEMPTY_SHIFT)
#define LPI2C_BRD_MRDR_RXEMPTY(base) (BME_UBFX32(&LPI2C_MRDR_REG(base), LPI2C_MRDR_RXEMPTY_SHIFT, LPI2C_MRDR_RXEMPTY_WIDTH))
/*@}*/

/*******************************************************************************
 * LPI2C_SCR - Slave Control Register
 ******************************************************************************/

/*!
 * @brief LPI2C_SCR - Slave Control Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPI2C_SCR register
 */
/*@{*/
#define LPI2C_RD_SCR(base)       (LPI2C_SCR_REG(base))
#define LPI2C_WR_SCR(base, value) (LPI2C_SCR_REG(base) = (value))
#define LPI2C_RMW_SCR(base, mask, value) (LPI2C_WR_SCR(base, (LPI2C_RD_SCR(base) & ~(mask)) | (value)))
#define LPI2C_SET_SCR(base, value) (BME_OR32(&LPI2C_SCR_REG(base), (uint32_t)(value)))
#define LPI2C_CLR_SCR(base, value) (BME_AND32(&LPI2C_SCR_REG(base), (uint32_t)(~(value))))
#define LPI2C_TOG_SCR(base, value) (BME_XOR32(&LPI2C_SCR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LPI2C_SCR bitfields
 */

/*!
 * @name Register LPI2C_SCR, field SEN[0] (RW)
 *
 * Values:
 * - 0b0 - Slave mode is disabled.
 * - 0b1 - Slave mode is enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SCR_SEN field. */
#define LPI2C_RD_SCR_SEN(base) ((LPI2C_SCR_REG(base) & LPI2C_SCR_SEN_MASK) >> LPI2C_SCR_SEN_SHIFT)
#define LPI2C_BRD_SCR_SEN(base) (BME_UBFX32(&LPI2C_SCR_REG(base), LPI2C_SCR_SEN_SHIFT, LPI2C_SCR_SEN_WIDTH))

/*! @brief Set the SEN field to a new value. */
#define LPI2C_WR_SCR_SEN(base, value) (LPI2C_RMW_SCR(base, LPI2C_SCR_SEN_MASK, LPI2C_SCR_SEN(value)))
#define LPI2C_BWR_SCR_SEN(base, value) (BME_BFI32(&LPI2C_SCR_REG(base), ((uint32_t)(value) << LPI2C_SCR_SEN_SHIFT), LPI2C_SCR_SEN_SHIFT, LPI2C_SCR_SEN_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SCR, field RST[1] (RW)
 *
 * Values:
 * - 0b0 - Slave logic is not reset.
 * - 0b1 - Slave logic is reset.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SCR_RST field. */
#define LPI2C_RD_SCR_RST(base) ((LPI2C_SCR_REG(base) & LPI2C_SCR_RST_MASK) >> LPI2C_SCR_RST_SHIFT)
#define LPI2C_BRD_SCR_RST(base) (BME_UBFX32(&LPI2C_SCR_REG(base), LPI2C_SCR_RST_SHIFT, LPI2C_SCR_RST_WIDTH))

/*! @brief Set the RST field to a new value. */
#define LPI2C_WR_SCR_RST(base, value) (LPI2C_RMW_SCR(base, LPI2C_SCR_RST_MASK, LPI2C_SCR_RST(value)))
#define LPI2C_BWR_SCR_RST(base, value) (BME_BFI32(&LPI2C_SCR_REG(base), ((uint32_t)(value) << LPI2C_SCR_RST_SHIFT), LPI2C_SCR_RST_SHIFT, LPI2C_SCR_RST_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SCR, field FILTEN[4] (RW)
 *
 * Values:
 * - 0b0 - Disable digital filter and output delay counter for slave mode.
 * - 0b1 - Enable digital filter and output delay counter for slave mode.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SCR_FILTEN field. */
#define LPI2C_RD_SCR_FILTEN(base) ((LPI2C_SCR_REG(base) & LPI2C_SCR_FILTEN_MASK) >> LPI2C_SCR_FILTEN_SHIFT)
#define LPI2C_BRD_SCR_FILTEN(base) (BME_UBFX32(&LPI2C_SCR_REG(base), LPI2C_SCR_FILTEN_SHIFT, LPI2C_SCR_FILTEN_WIDTH))

/*! @brief Set the FILTEN field to a new value. */
#define LPI2C_WR_SCR_FILTEN(base, value) (LPI2C_RMW_SCR(base, LPI2C_SCR_FILTEN_MASK, LPI2C_SCR_FILTEN(value)))
#define LPI2C_BWR_SCR_FILTEN(base, value) (BME_BFI32(&LPI2C_SCR_REG(base), ((uint32_t)(value) << LPI2C_SCR_FILTEN_SHIFT), LPI2C_SCR_FILTEN_SHIFT, LPI2C_SCR_FILTEN_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SCR, field FILTDZ[5] (RW)
 *
 * Values:
 * - 0b0 - Filter remains enabled in Doze mode.
 * - 0b1 - Filter is disabled in Doze mode.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SCR_FILTDZ field. */
#define LPI2C_RD_SCR_FILTDZ(base) ((LPI2C_SCR_REG(base) & LPI2C_SCR_FILTDZ_MASK) >> LPI2C_SCR_FILTDZ_SHIFT)
#define LPI2C_BRD_SCR_FILTDZ(base) (BME_UBFX32(&LPI2C_SCR_REG(base), LPI2C_SCR_FILTDZ_SHIFT, LPI2C_SCR_FILTDZ_WIDTH))

/*! @brief Set the FILTDZ field to a new value. */
#define LPI2C_WR_SCR_FILTDZ(base, value) (LPI2C_RMW_SCR(base, LPI2C_SCR_FILTDZ_MASK, LPI2C_SCR_FILTDZ(value)))
#define LPI2C_BWR_SCR_FILTDZ(base, value) (BME_BFI32(&LPI2C_SCR_REG(base), ((uint32_t)(value) << LPI2C_SCR_FILTDZ_SHIFT), LPI2C_SCR_FILTDZ_SHIFT, LPI2C_SCR_FILTDZ_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SCR, field RTF[8] (WORZ)
 *
 * Values:
 * - 0b0 - No effect.
 * - 0b1 - Transmit Data Register is now empty.
 */
/*@{*/
/*! @brief Set the RTF field to a new value. */
#define LPI2C_WR_SCR_RTF(base, value) (LPI2C_RMW_SCR(base, LPI2C_SCR_RTF_MASK, LPI2C_SCR_RTF(value)))
#define LPI2C_BWR_SCR_RTF(base, value) (BME_BFI32(&LPI2C_SCR_REG(base), ((uint32_t)(value) << LPI2C_SCR_RTF_SHIFT), LPI2C_SCR_RTF_SHIFT, LPI2C_SCR_RTF_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SCR, field RRF[9] (WORZ)
 *
 * Values:
 * - 0b0 - No effect.
 * - 0b1 - Receive Data Register is now empty.
 */
/*@{*/
/*! @brief Set the RRF field to a new value. */
#define LPI2C_WR_SCR_RRF(base, value) (LPI2C_RMW_SCR(base, LPI2C_SCR_RRF_MASK, LPI2C_SCR_RRF(value)))
#define LPI2C_BWR_SCR_RRF(base, value) (BME_BFI32(&LPI2C_SCR_REG(base), ((uint32_t)(value) << LPI2C_SCR_RRF_SHIFT), LPI2C_SCR_RRF_SHIFT, LPI2C_SCR_RRF_WIDTH))
/*@}*/

