pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * LPI2C_SSR - Slave Status Register
 ******************************************************************************/

/*!
 * @brief LPI2C_SSR - Slave Status Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPI2C_SSR register
 */
/*@{*/
#define LPI2C_RD_SSR(base)       (LPI2C_SSR_REG(base))
#define LPI2C_WR_SSR(base, value) (LPI2C_SSR_REG(base) = (value))
#define LPI2C_RMW_SSR(base, mask, value) (LPI2C_WR_SSR(base, (LPI2C_RD_SSR(base) & ~(mask)) | (value)))
#define LPI2C_SET_SSR(base, value) (BME_OR32(&LPI2C_SSR_REG(base), (uint32_t)(value)))
#define LPI2C_CLR_SSR(base, value) (BME_AND32(&LPI2C_SSR_REG(base), (uint32_t)(~(value))))
#define LPI2C_TOG_SSR(base, value) (BME_XOR32(&LPI2C_SSR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LPI2C_SSR bitfields
 */

/*!
 * @name Register LPI2C_SSR, field TDF[0] (RO)
 *
 * This flag is cleared by writing the transmit data register. When TXCFG is
 * clear, it is also cleared if a NACK or Repeated START or STOP condition is
 * detected.
 *
 * Values:
 * - 0b0 - Transmit data not requested.
 * - 0b1 - Transmit data is requested.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SSR_TDF field. */
#define LPI2C_RD_SSR_TDF(base) ((LPI2C_SSR_REG(base) & LPI2C_SSR_TDF_MASK) >> LPI2C_SSR_TDF_SHIFT)
#define LPI2C_BRD_SSR_TDF(base) (BME_UBFX32(&LPI2C_SSR_REG(base), LPI2C_SSR_TDF_SHIFT, LPI2C_SSR_TDF_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SSR, field RDF[1] (RO)
 *
 * This flag is cleared by reading the receive data register. When RXCFG is set,
 * this flag is not cleared when reading the receive data register and AVF is
 * set.
 *
 * Values:
 * - 0b0 - Receive Data is not ready.
 * - 0b1 - Receive data is ready.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SSR_RDF field. */
#define LPI2C_RD_SSR_RDF(base) ((LPI2C_SSR_REG(base) & LPI2C_SSR_RDF_MASK) >> LPI2C_SSR_RDF_SHIFT)
#define LPI2C_BRD_SSR_RDF(base) (BME_UBFX32(&LPI2C_SSR_REG(base), LPI2C_SSR_RDF_SHIFT, LPI2C_SSR_RDF_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SSR, field AVF[2] (RO)
 *
 * This flag is cleared by reading the address status register. When RXCFG is
 * set, this flag is also cleared by reading the receive data register.
 *
 * Values:
 * - 0b0 - Address Status Register is not valid.
 * - 0b1 - Address Status Register is valid.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SSR_AVF field. */
#define LPI2C_RD_SSR_AVF(base) ((LPI2C_SSR_REG(base) & LPI2C_SSR_AVF_MASK) >> LPI2C_SSR_AVF_SHIFT)
#define LPI2C_BRD_SSR_AVF(base) (BME_UBFX32(&LPI2C_SSR_REG(base), LPI2C_SSR_AVF_SHIFT, LPI2C_SSR_AVF_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SSR, field TAF[3] (RO)
 *
 * This flag is cleared by writing the transmit ACK register.
 *
 * Values:
 * - 0b0 - Transmit ACK/NACK is not required.
 * - 0b1 - Transmit ACK/NACK is required.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SSR_TAF field. */
#define LPI2C_RD_SSR_TAF(base) ((LPI2C_SSR_REG(base) & LPI2C_SSR_TAF_MASK) >> LPI2C_SSR_TAF_SHIFT)
#define LPI2C_BRD_SSR_TAF(base) (BME_UBFX32(&LPI2C_SSR_REG(base), LPI2C_SSR_TAF_SHIFT, LPI2C_SSR_TAF_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SSR, field RSF[8] (W1C)
 *
 * This flag will set when the LPI2C slave detects a repeated START condition,
 * provided the LPI2C slave matched the last address byte. It does not set when
 * the slave first detects a START condition.
 *
 * Values:
 * - 0b0 - Slave has not detected a Repeated START condition.
 * - 0b1 - Slave has detected a Repeated START condition.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SSR_RSF field. */
#define LPI2C_RD_SSR_RSF(base) ((LPI2C_SSR_REG(base) & LPI2C_SSR_RSF_MASK) >> LPI2C_SSR_RSF_SHIFT)
#define LPI2C_BRD_SSR_RSF(base) (BME_UBFX32(&LPI2C_SSR_REG(base), LPI2C_SSR_RSF_SHIFT, LPI2C_SSR_RSF_WIDTH))

/*! @brief Set the RSF field to a new value. */
#define LPI2C_WR_SSR_RSF(base, value) (LPI2C_RMW_SSR(base, (LPI2C_SSR_RSF_MASK | LPI2C_SSR_SDF_MASK | LPI2C_SSR_BEF_MASK | LPI2C_SSR_FEF_MASK), LPI2C_SSR_RSF(value)))
#define LPI2C_BWR_SSR_RSF(base, value) (BME_BFI32(&LPI2C_SSR_REG(base), ((uint32_t)(value) << LPI2C_SSR_RSF_SHIFT), LPI2C_SSR_RSF_SHIFT, LPI2C_SSR_RSF_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SSR, field SDF[9] (W1C)
 *
 * This flag will set when the LPI2C slave detects a STOP condition, provided
 * the LPI2C slave matched the last address byte.
 *
 * Values:
 * - 0b0 - Slave has not detected a STOP condition.
 * - 0b1 - Slave has detected a STOP condition.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SSR_SDF field. */
#define LPI2C_RD_SSR_SDF(base) ((LPI2C_SSR_REG(base) & LPI2C_SSR_SDF_MASK) >> LPI2C_SSR_SDF_SHIFT)
#define LPI2C_BRD_SSR_SDF(base) (BME_UBFX32(&LPI2C_SSR_REG(base), LPI2C_SSR_SDF_SHIFT, LPI2C_SSR_SDF_WIDTH))

/*! @brief Set the SDF field to a new value. */
#define LPI2C_WR_SSR_SDF(base, value) (LPI2C_RMW_SSR(base, (LPI2C_SSR_SDF_MASK | LPI2C_SSR_RSF_MASK | LPI2C_SSR_BEF_MASK | LPI2C_SSR_FEF_MASK), LPI2C_SSR_SDF(value)))
#define LPI2C_BWR_SSR_SDF(base, value) (BME_BFI32(&LPI2C_SSR_REG(base), ((uint32_t)(value) << LPI2C_SSR_SDF_SHIFT), LPI2C_SSR_SDF_SHIFT, LPI2C_SSR_SDF_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SSR, field BEF[10] (W1C)
 *
 * This flag will set if the LPI2C slave transmits a logic one and detects a
 * logic zero on the I2C bus. The slave will ignore the rest of the transfer until
 * the next (repeated) START condition.
 *
 * Values:
 * - 0b0 - Slave has not detected a bit error.
 * - 0b1 - Slave has detected a bit error.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SSR_BEF field. */
#define LPI2C_RD_SSR_BEF(base) ((LPI2C_SSR_REG(base) & LPI2C_SSR_BEF_MASK) >> LPI2C_SSR_BEF_SHIFT)
#define LPI2C_BRD_SSR_BEF(base) (BME_UBFX32(&LPI2C_SSR_REG(base), LPI2C_SSR_BEF_SHIFT, LPI2C_SSR_BEF_WIDTH))

/*! @brief Set the BEF field to a new value. */
#define LPI2C_WR_SSR_BEF(base, value) (LPI2C_RMW_SSR(base, (LPI2C_SSR_BEF_MASK | LPI2C_SSR_RSF_MASK | LPI2C_SSR_SDF_MASK | LPI2C_SSR_FEF_MASK), LPI2C_SSR_BEF(value)))
#define LPI2C_BWR_SSR_BEF(base, value) (BME_BFI32(&LPI2C_SSR_REG(base), ((uint32_t)(value) << LPI2C_SSR_BEF_SHIFT), LPI2C_SSR_BEF_SHIFT, LPI2C_SSR_BEF_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SSR, field FEF[11] (W1C)
 *
 * FIFO error flag can only set when clock stretching is disabled.
 *
 * Values:
 * - 0b0 - FIFO underflow or overflow not detected.
 * - 0b1 - FIFO underflow or overflow detected.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SSR_FEF field. */
#define LPI2C_RD_SSR_FEF(base) ((LPI2C_SSR_REG(base) & LPI2C_SSR_FEF_MASK) >> LPI2C_SSR_FEF_SHIFT)
#define LPI2C_BRD_SSR_FEF(base) (BME_UBFX32(&LPI2C_SSR_REG(base), LPI2C_SSR_FEF_SHIFT, LPI2C_SSR_FEF_WIDTH))

/*! @brief Set the FEF field to a new value. */
#define LPI2C_WR_SSR_FEF(base, value) (LPI2C_RMW_SSR(base, (LPI2C_SSR_FEF_MASK | LPI2C_SSR_RSF_MASK | LPI2C_SSR_SDF_MASK | LPI2C_SSR_BEF_MASK), LPI2C_SSR_FEF(value)))
#define LPI2C_BWR_SSR_FEF(base, value) (BME_BFI32(&LPI2C_SSR_REG(base), ((uint32_t)(value) << LPI2C_SSR_FEF_SHIFT), LPI2C_SSR_FEF_SHIFT, LPI2C_SSR_FEF_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SSR, field AM0F[12] (RO)
 *
 * Indicates that the received address has matched the ADDR0 field as configured
 * by ADDRCFG. This flag is cleared by reading the Address Status Register. This
 * flag cannot generate an asynchronous wakeup.
 *
 * Values:
 * - 0b0 - Have not received ADDR0 matching address.
 * - 0b1 - Have received ADDR0 matching address.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SSR_AM0F field. */
#define LPI2C_RD_SSR_AM0F(base) ((LPI2C_SSR_REG(base) & LPI2C_SSR_AM0F_MASK) >> LPI2C_SSR_AM0F_SHIFT)
#define LPI2C_BRD_SSR_AM0F(base) (BME_UBFX32(&LPI2C_SSR_REG(base), LPI2C_SSR_AM0F_SHIFT, LPI2C_SSR_AM0F_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SSR, field AM1F[13] (RO)
 *
 * Indicates that the received address has matched the ADDR1 field or ADDR0 to
 * ADDR1 range as configured by ADDRCFG. This flag is cleared by reading the
 * Address Status Register. This flag cannot generate an asynchronous wakeup.
 *
 * Values:
 * - 0b0 - Have not received ADDR1 or ADDR0/ADDR1 range matching address.
 * - 0b1 - Have received ADDR1 or ADDR0/ADDR1 range matching address.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SSR_AM1F field. */
#define LPI2C_RD_SSR_AM1F(base) ((LPI2C_SSR_REG(base) & LPI2C_SSR_AM1F_MASK) >> LPI2C_SSR_AM1F_SHIFT)
#define LPI2C_BRD_SSR_AM1F(base) (BME_UBFX32(&LPI2C_SSR_REG(base), LPI2C_SSR_AM1F_SHIFT, LPI2C_SSR_AM1F_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SSR, field GCF[14] (RO)
 *
 * This flag is cleared by reading the Address Status Register. This flag cannot
 * generate an asynchronous wakeup.
 *
 * Values:
 * - 0b0 - Slave has not detected the General Call Address or General Call
 *     Address disabled.
 * - 0b1 - Slave has detected the General Call Address.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SSR_GCF field. */
#define LPI2C_RD_SSR_GCF(base) ((LPI2C_SSR_REG(base) & LPI2C_SSR_GCF_MASK) >> LPI2C_SSR_GCF_SHIFT)
#define LPI2C_BRD_SSR_GCF(base) (BME_UBFX32(&LPI2C_SSR_REG(base), LPI2C_SSR_GCF_SHIFT, LPI2C_SSR_GCF_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SSR, field SARF[15] (RO)
 *
 * This flag is cleared by reading the Address Status Register. This flag cannot
 * generate an asynchronous wakeup.
 *
 * Values:
 * - 0b0 - SMBus Alert Response disabled or not detected.
 * - 0b1 - SMBus Alert Response enabled and detected.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SSR_SARF field. */
#define LPI2C_RD_SSR_SARF(base) ((LPI2C_SSR_REG(base) & LPI2C_SSR_SARF_MASK) >> LPI2C_SSR_SARF_SHIFT)
#define LPI2C_BRD_SSR_SARF(base) (BME_UBFX32(&LPI2C_SSR_REG(base), LPI2C_SSR_SARF_SHIFT, LPI2C_SSR_SARF_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SSR, field SBF[24] (RO)
 *
 * Values:
 * - 0b0 - I2C Slave is idle.
 * - 0b1 - I2C Slave is busy.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SSR_SBF field. */
#define LPI2C_RD_SSR_SBF(base) ((LPI2C_SSR_REG(base) & LPI2C_SSR_SBF_MASK) >> LPI2C_SSR_SBF_SHIFT)
#define LPI2C_BRD_SSR_SBF(base) (BME_UBFX32(&LPI2C_SSR_REG(base), LPI2C_SSR_SBF_SHIFT, LPI2C_SSR_SBF_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SSR, field BBF[25] (RO)
 *
 * Values:
 * - 0b0 - I2C Bus is idle.
 * - 0b1 - I2C Bus is busy.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SSR_BBF field. */
#define LPI2C_RD_SSR_BBF(base) ((LPI2C_SSR_REG(base) & LPI2C_SSR_BBF_MASK) >> LPI2C_SSR_BBF_SHIFT)
#define LPI2C_BRD_SSR_BBF(base) (BME_UBFX32(&LPI2C_SSR_REG(base), LPI2C_SSR_BBF_SHIFT, LPI2C_SSR_BBF_WIDTH))
/*@}*/

