pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * LPI2C_SIER - Slave Interrupt Enable Register
 ******************************************************************************/

/*!
 * @brief LPI2C_SIER - Slave Interrupt Enable Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPI2C_SIER register
 */
/*@{*/
#define LPI2C_RD_SIER(base)      (LPI2C_SIER_REG(base))
#define LPI2C_WR_SIER(base, value) (LPI2C_SIER_REG(base) = (value))
#define LPI2C_RMW_SIER(base, mask, value) (LPI2C_WR_SIER(base, (LPI2C_RD_SIER(base) & ~(mask)) | (value)))
#define LPI2C_SET_SIER(base, value) (BME_OR32(&LPI2C_SIER_REG(base), (uint32_t)(value)))
#define LPI2C_CLR_SIER(base, value) (BME_AND32(&LPI2C_SIER_REG(base), (uint32_t)(~(value))))
#define LPI2C_TOG_SIER(base, value) (BME_XOR32(&LPI2C_SIER_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LPI2C_SIER bitfields
 */

/*!
 * @name Register LPI2C_SIER, field TDIE[0] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SIER_TDIE field. */
#define LPI2C_RD_SIER_TDIE(base) ((LPI2C_SIER_REG(base) & LPI2C_SIER_TDIE_MASK) >> LPI2C_SIER_TDIE_SHIFT)
#define LPI2C_BRD_SIER_TDIE(base) (BME_UBFX32(&LPI2C_SIER_REG(base), LPI2C_SIER_TDIE_SHIFT, LPI2C_SIER_TDIE_WIDTH))

/*! @brief Set the TDIE field to a new value. */
#define LPI2C_WR_SIER_TDIE(base, value) (LPI2C_RMW_SIER(base, LPI2C_SIER_TDIE_MASK, LPI2C_SIER_TDIE(value)))
#define LPI2C_BWR_SIER_TDIE(base, value) (BME_BFI32(&LPI2C_SIER_REG(base), ((uint32_t)(value) << LPI2C_SIER_TDIE_SHIFT), LPI2C_SIER_TDIE_SHIFT, LPI2C_SIER_TDIE_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SIER, field RDIE[1] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SIER_RDIE field. */
#define LPI2C_RD_SIER_RDIE(base) ((LPI2C_SIER_REG(base) & LPI2C_SIER_RDIE_MASK) >> LPI2C_SIER_RDIE_SHIFT)
#define LPI2C_BRD_SIER_RDIE(base) (BME_UBFX32(&LPI2C_SIER_REG(base), LPI2C_SIER_RDIE_SHIFT, LPI2C_SIER_RDIE_WIDTH))

/*! @brief Set the RDIE field to a new value. */
#define LPI2C_WR_SIER_RDIE(base, value) (LPI2C_RMW_SIER(base, LPI2C_SIER_RDIE_MASK, LPI2C_SIER_RDIE(value)))
#define LPI2C_BWR_SIER_RDIE(base, value) (BME_BFI32(&LPI2C_SIER_REG(base), ((uint32_t)(value) << LPI2C_SIER_RDIE_SHIFT), LPI2C_SIER_RDIE_SHIFT, LPI2C_SIER_RDIE_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SIER, field AVIE[2] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SIER_AVIE field. */
#define LPI2C_RD_SIER_AVIE(base) ((LPI2C_SIER_REG(base) & LPI2C_SIER_AVIE_MASK) >> LPI2C_SIER_AVIE_SHIFT)
#define LPI2C_BRD_SIER_AVIE(base) (BME_UBFX32(&LPI2C_SIER_REG(base), LPI2C_SIER_AVIE_SHIFT, LPI2C_SIER_AVIE_WIDTH))

/*! @brief Set the AVIE field to a new value. */
#define LPI2C_WR_SIER_AVIE(base, value) (LPI2C_RMW_SIER(base, LPI2C_SIER_AVIE_MASK, LPI2C_SIER_AVIE(value)))
#define LPI2C_BWR_SIER_AVIE(base, value) (BME_BFI32(&LPI2C_SIER_REG(base), ((uint32_t)(value) << LPI2C_SIER_AVIE_SHIFT), LPI2C_SIER_AVIE_SHIFT, LPI2C_SIER_AVIE_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SIER, field TAIE[3] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SIER_TAIE field. */
#define LPI2C_RD_SIER_TAIE(base) ((LPI2C_SIER_REG(base) & LPI2C_SIER_TAIE_MASK) >> LPI2C_SIER_TAIE_SHIFT)
#define LPI2C_BRD_SIER_TAIE(base) (BME_UBFX32(&LPI2C_SIER_REG(base), LPI2C_SIER_TAIE_SHIFT, LPI2C_SIER_TAIE_WIDTH))

/*! @brief Set the TAIE field to a new value. */
#define LPI2C_WR_SIER_TAIE(base, value) (LPI2C_RMW_SIER(base, LPI2C_SIER_TAIE_MASK, LPI2C_SIER_TAIE(value)))
#define LPI2C_BWR_SIER_TAIE(base, value) (BME_BFI32(&LPI2C_SIER_REG(base), ((uint32_t)(value) << LPI2C_SIER_TAIE_SHIFT), LPI2C_SIER_TAIE_SHIFT, LPI2C_SIER_TAIE_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SIER, field RSIE[8] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SIER_RSIE field. */
#define LPI2C_RD_SIER_RSIE(base) ((LPI2C_SIER_REG(base) & LPI2C_SIER_RSIE_MASK) >> LPI2C_SIER_RSIE_SHIFT)
#define LPI2C_BRD_SIER_RSIE(base) (BME_UBFX32(&LPI2C_SIER_REG(base), LPI2C_SIER_RSIE_SHIFT, LPI2C_SIER_RSIE_WIDTH))

/*! @brief Set the RSIE field to a new value. */
#define LPI2C_WR_SIER_RSIE(base, value) (LPI2C_RMW_SIER(base, LPI2C_SIER_RSIE_MASK, LPI2C_SIER_RSIE(value)))
#define LPI2C_BWR_SIER_RSIE(base, value) (BME_BFI32(&LPI2C_SIER_REG(base), ((uint32_t)(value) << LPI2C_SIER_RSIE_SHIFT), LPI2C_SIER_RSIE_SHIFT, LPI2C_SIER_RSIE_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SIER, field SDIE[9] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SIER_SDIE field. */
#define LPI2C_RD_SIER_SDIE(base) ((LPI2C_SIER_REG(base) & LPI2C_SIER_SDIE_MASK) >> LPI2C_SIER_SDIE_SHIFT)
#define LPI2C_BRD_SIER_SDIE(base) (BME_UBFX32(&LPI2C_SIER_REG(base), LPI2C_SIER_SDIE_SHIFT, LPI2C_SIER_SDIE_WIDTH))

/*! @brief Set the SDIE field to a new value. */
#define LPI2C_WR_SIER_SDIE(base, value) (LPI2C_RMW_SIER(base, LPI2C_SIER_SDIE_MASK, LPI2C_SIER_SDIE(value)))
#define LPI2C_BWR_SIER_SDIE(base, value) (BME_BFI32(&LPI2C_SIER_REG(base), ((uint32_t)(value) << LPI2C_SIER_SDIE_SHIFT), LPI2C_SIER_SDIE_SHIFT, LPI2C_SIER_SDIE_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SIER, field BEIE[10] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SIER_BEIE field. */
#define LPI2C_RD_SIER_BEIE(base) ((LPI2C_SIER_REG(base) & LPI2C_SIER_BEIE_MASK) >> LPI2C_SIER_BEIE_SHIFT)
#define LPI2C_BRD_SIER_BEIE(base) (BME_UBFX32(&LPI2C_SIER_REG(base), LPI2C_SIER_BEIE_SHIFT, LPI2C_SIER_BEIE_WIDTH))

/*! @brief Set the BEIE field to a new value. */
#define LPI2C_WR_SIER_BEIE(base, value) (LPI2C_RMW_SIER(base, LPI2C_SIER_BEIE_MASK, LPI2C_SIER_BEIE(value)))
#define LPI2C_BWR_SIER_BEIE(base, value) (BME_BFI32(&LPI2C_SIER_REG(base), ((uint32_t)(value) << LPI2C_SIER_BEIE_SHIFT), LPI2C_SIER_BEIE_SHIFT, LPI2C_SIER_BEIE_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SIER, field FEIE[11] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SIER_FEIE field. */
#define LPI2C_RD_SIER_FEIE(base) ((LPI2C_SIER_REG(base) & LPI2C_SIER_FEIE_MASK) >> LPI2C_SIER_FEIE_SHIFT)
#define LPI2C_BRD_SIER_FEIE(base) (BME_UBFX32(&LPI2C_SIER_REG(base), LPI2C_SIER_FEIE_SHIFT, LPI2C_SIER_FEIE_WIDTH))

/*! @brief Set the FEIE field to a new value. */
#define LPI2C_WR_SIER_FEIE(base, value) (LPI2C_RMW_SIER(base, LPI2C_SIER_FEIE_MASK, LPI2C_SIER_FEIE(value)))
#define LPI2C_BWR_SIER_FEIE(base, value) (BME_BFI32(&LPI2C_SIER_REG(base), ((uint32_t)(value) << LPI2C_SIER_FEIE_SHIFT), LPI2C_SIER_FEIE_SHIFT, LPI2C_SIER_FEIE_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SIER, field AM0IE[12] (RW)
 *
 * Values:
 * - 0b0 - Interrupt enabled.
 * - 0b1 - Interrupt disabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SIER_AM0IE field. */
#define LPI2C_RD_SIER_AM0IE(base) ((LPI2C_SIER_REG(base) & LPI2C_SIER_AM0IE_MASK) >> LPI2C_SIER_AM0IE_SHIFT)
#define LPI2C_BRD_SIER_AM0IE(base) (BME_UBFX32(&LPI2C_SIER_REG(base), LPI2C_SIER_AM0IE_SHIFT, LPI2C_SIER_AM0IE_WIDTH))

/*! @brief Set the AM0IE field to a new value. */
#define LPI2C_WR_SIER_AM0IE(base, value) (LPI2C_RMW_SIER(base, LPI2C_SIER_AM0IE_MASK, LPI2C_SIER_AM0IE(value)))
#define LPI2C_BWR_SIER_AM0IE(base, value) (BME_BFI32(&LPI2C_SIER_REG(base), ((uint32_t)(value) << LPI2C_SIER_AM0IE_SHIFT), LPI2C_SIER_AM0IE_SHIFT, LPI2C_SIER_AM0IE_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SIER, field AM1F[13] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SIER_AM1F field. */
#define LPI2C_RD_SIER_AM1F(base) ((LPI2C_SIER_REG(base) & LPI2C_SIER_AM1F_MASK) >> LPI2C_SIER_AM1F_SHIFT)
#define LPI2C_BRD_SIER_AM1F(base) (BME_UBFX32(&LPI2C_SIER_REG(base), LPI2C_SIER_AM1F_SHIFT, LPI2C_SIER_AM1F_WIDTH))

