pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the AM1F field to a new value. */
#define LPI2C_WR_SIER_AM1F(base, value) (LPI2C_RMW_SIER(base, LPI2C_SIER_AM1F_MASK, LPI2C_SIER_AM1F(value)))
#define LPI2C_BWR_SIER_AM1F(base, value) (BME_BFI32(&LPI2C_SIER_REG(base), ((uint32_t)(value) << LPI2C_SIER_AM1F_SHIFT), LPI2C_SIER_AM1F_SHIFT, LPI2C_SIER_AM1F_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SIER, field GCIE[14] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SIER_GCIE field. */
#define LPI2C_RD_SIER_GCIE(base) ((LPI2C_SIER_REG(base) & LPI2C_SIER_GCIE_MASK) >> LPI2C_SIER_GCIE_SHIFT)
#define LPI2C_BRD_SIER_GCIE(base) (BME_UBFX32(&LPI2C_SIER_REG(base), LPI2C_SIER_GCIE_SHIFT, LPI2C_SIER_GCIE_WIDTH))

/*! @brief Set the GCIE field to a new value. */
#define LPI2C_WR_SIER_GCIE(base, value) (LPI2C_RMW_SIER(base, LPI2C_SIER_GCIE_MASK, LPI2C_SIER_GCIE(value)))
#define LPI2C_BWR_SIER_GCIE(base, value) (BME_BFI32(&LPI2C_SIER_REG(base), ((uint32_t)(value) << LPI2C_SIER_GCIE_SHIFT), LPI2C_SIER_GCIE_SHIFT, LPI2C_SIER_GCIE_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SIER, field SARIE[15] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SIER_SARIE field. */
#define LPI2C_RD_SIER_SARIE(base) ((LPI2C_SIER_REG(base) & LPI2C_SIER_SARIE_MASK) >> LPI2C_SIER_SARIE_SHIFT)
#define LPI2C_BRD_SIER_SARIE(base) (BME_UBFX32(&LPI2C_SIER_REG(base), LPI2C_SIER_SARIE_SHIFT, LPI2C_SIER_SARIE_WIDTH))

/*! @brief Set the SARIE field to a new value. */
#define LPI2C_WR_SIER_SARIE(base, value) (LPI2C_RMW_SIER(base, LPI2C_SIER_SARIE_MASK, LPI2C_SIER_SARIE(value)))
#define LPI2C_BWR_SIER_SARIE(base, value) (BME_BFI32(&LPI2C_SIER_REG(base), ((uint32_t)(value) << LPI2C_SIER_SARIE_SHIFT), LPI2C_SIER_SARIE_SHIFT, LPI2C_SIER_SARIE_WIDTH))
/*@}*/

/*******************************************************************************
 * LPI2C_SDER - Slave DMA Enable Register
 ******************************************************************************/

/*!
 * @brief LPI2C_SDER - Slave DMA Enable Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPI2C_SDER register
 */
/*@{*/
#define LPI2C_RD_SDER(base)      (LPI2C_SDER_REG(base))
#define LPI2C_WR_SDER(base, value) (LPI2C_SDER_REG(base) = (value))
#define LPI2C_RMW_SDER(base, mask, value) (LPI2C_WR_SDER(base, (LPI2C_RD_SDER(base) & ~(mask)) | (value)))
#define LPI2C_SET_SDER(base, value) (BME_OR32(&LPI2C_SDER_REG(base), (uint32_t)(value)))
#define LPI2C_CLR_SDER(base, value) (BME_AND32(&LPI2C_SDER_REG(base), (uint32_t)(~(value))))
#define LPI2C_TOG_SDER(base, value) (BME_XOR32(&LPI2C_SDER_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LPI2C_SDER bitfields
 */

/*!
 * @name Register LPI2C_SDER, field TDDE[0] (RW)
 *
 * Values:
 * - 0b0 - DMA request disabled.
 * - 0b1 - DMA request enabled
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SDER_TDDE field. */
#define LPI2C_RD_SDER_TDDE(base) ((LPI2C_SDER_REG(base) & LPI2C_SDER_TDDE_MASK) >> LPI2C_SDER_TDDE_SHIFT)
#define LPI2C_BRD_SDER_TDDE(base) (BME_UBFX32(&LPI2C_SDER_REG(base), LPI2C_SDER_TDDE_SHIFT, LPI2C_SDER_TDDE_WIDTH))

/*! @brief Set the TDDE field to a new value. */
#define LPI2C_WR_SDER_TDDE(base, value) (LPI2C_RMW_SDER(base, LPI2C_SDER_TDDE_MASK, LPI2C_SDER_TDDE(value)))
#define LPI2C_BWR_SDER_TDDE(base, value) (BME_BFI32(&LPI2C_SDER_REG(base), ((uint32_t)(value) << LPI2C_SDER_TDDE_SHIFT), LPI2C_SDER_TDDE_SHIFT, LPI2C_SDER_TDDE_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SDER, field RDDE[1] (RW)
 *
 * Values:
 * - 0b0 - DMA request disabled.
 * - 0b1 - DMA request enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SDER_RDDE field. */
#define LPI2C_RD_SDER_RDDE(base) ((LPI2C_SDER_REG(base) & LPI2C_SDER_RDDE_MASK) >> LPI2C_SDER_RDDE_SHIFT)
#define LPI2C_BRD_SDER_RDDE(base) (BME_UBFX32(&LPI2C_SDER_REG(base), LPI2C_SDER_RDDE_SHIFT, LPI2C_SDER_RDDE_WIDTH))

/*! @brief Set the RDDE field to a new value. */
#define LPI2C_WR_SDER_RDDE(base, value) (LPI2C_RMW_SDER(base, LPI2C_SDER_RDDE_MASK, LPI2C_SDER_RDDE(value)))
#define LPI2C_BWR_SDER_RDDE(base, value) (BME_BFI32(&LPI2C_SDER_REG(base), ((uint32_t)(value) << LPI2C_SDER_RDDE_SHIFT), LPI2C_SDER_RDDE_SHIFT, LPI2C_SDER_RDDE_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SDER, field AVDE[2] (RW)
 *
 * The Address Valid DMA request is shared with the Receive Data DMA request. If
 * both are enabled, then set RXCFG to allow the DMA to read the address from
 * the Receive Data Register.
 *
 * Values:
 * - 0b0 - DMA request disabled.
 * - 0b1 - DMA request enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SDER_AVDE field. */
#define LPI2C_RD_SDER_AVDE(base) ((LPI2C_SDER_REG(base) & LPI2C_SDER_AVDE_MASK) >> LPI2C_SDER_AVDE_SHIFT)
#define LPI2C_BRD_SDER_AVDE(base) (BME_UBFX32(&LPI2C_SDER_REG(base), LPI2C_SDER_AVDE_SHIFT, LPI2C_SDER_AVDE_WIDTH))

/*! @brief Set the AVDE field to a new value. */
#define LPI2C_WR_SDER_AVDE(base, value) (LPI2C_RMW_SDER(base, LPI2C_SDER_AVDE_MASK, LPI2C_SDER_AVDE(value)))
#define LPI2C_BWR_SDER_AVDE(base, value) (BME_BFI32(&LPI2C_SDER_REG(base), ((uint32_t)(value) << LPI2C_SDER_AVDE_SHIFT), LPI2C_SDER_AVDE_SHIFT, LPI2C_SDER_AVDE_WIDTH))
/*@}*/

/*******************************************************************************
 * LPI2C_SCFGR1 - Slave Configuration Register 1
 ******************************************************************************/

/*!
 * @brief LPI2C_SCFGR1 - Slave Configuration Register 1 (RW)
 *
 * Reset value: 0x00000000U
 *
 * The SCFGR1 should only be written when the I2C Slave is disabled.
 */
/*!
 * @name Constants and macros for entire LPI2C_SCFGR1 register
 */
/*@{*/
#define LPI2C_RD_SCFGR1(base)    (LPI2C_SCFGR1_REG(base))
#define LPI2C_WR_SCFGR1(base, value) (LPI2C_SCFGR1_REG(base) = (value))
#define LPI2C_RMW_SCFGR1(base, mask, value) (LPI2C_WR_SCFGR1(base, (LPI2C_RD_SCFGR1(base) & ~(mask)) | (value)))
#define LPI2C_SET_SCFGR1(base, value) (BME_OR32(&LPI2C_SCFGR1_REG(base), (uint32_t)(value)))
#define LPI2C_CLR_SCFGR1(base, value) (BME_AND32(&LPI2C_SCFGR1_REG(base), (uint32_t)(~(value))))
#define LPI2C_TOG_SCFGR1(base, value) (BME_XOR32(&LPI2C_SCFGR1_REG(base), (uint32_t)(value)))
/*@}*/

