pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * Constants & macros for individual LPI2C_SCFGR1 bitfields
 */

/*!
 * @name Register LPI2C_SCFGR1, field ADRSTALL[0] (RW)
 *
 * Enables SCL clock stretching when the address valid flag is asserted. Clock
 * stretching only occurs following the 9th bit and is therefore compatible with
 * high speed mode.
 *
 * Values:
 * - 0b0 - Clock stretching disabled.
 * - 0b1 - Clock stretching enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SCFGR1_ADRSTALL field. */
#define LPI2C_RD_SCFGR1_ADRSTALL(base) ((LPI2C_SCFGR1_REG(base) & LPI2C_SCFGR1_ADRSTALL_MASK) >> LPI2C_SCFGR1_ADRSTALL_SHIFT)
#define LPI2C_BRD_SCFGR1_ADRSTALL(base) (BME_UBFX32(&LPI2C_SCFGR1_REG(base), LPI2C_SCFGR1_ADRSTALL_SHIFT, LPI2C_SCFGR1_ADRSTALL_WIDTH))

/*! @brief Set the ADRSTALL field to a new value. */
#define LPI2C_WR_SCFGR1_ADRSTALL(base, value) (LPI2C_RMW_SCFGR1(base, LPI2C_SCFGR1_ADRSTALL_MASK, LPI2C_SCFGR1_ADRSTALL(value)))
#define LPI2C_BWR_SCFGR1_ADRSTALL(base, value) (BME_BFI32(&LPI2C_SCFGR1_REG(base), ((uint32_t)(value) << LPI2C_SCFGR1_ADRSTALL_SHIFT), LPI2C_SCFGR1_ADRSTALL_SHIFT, LPI2C_SCFGR1_ADRSTALL_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SCFGR1, field RXSTALL[1] (RW)
 *
 * Enables SCL clock stretching when receive data flag is set during a
 * slave-receive transfer. Clock stretching occurs following the 9th bit and is therefore
 * compatible with high speed mode.
 *
 * Values:
 * - 0b0 - Clock stretching disabled.
 * - 0b1 - Clock stretching enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SCFGR1_RXSTALL field. */
#define LPI2C_RD_SCFGR1_RXSTALL(base) ((LPI2C_SCFGR1_REG(base) & LPI2C_SCFGR1_RXSTALL_MASK) >> LPI2C_SCFGR1_RXSTALL_SHIFT)
#define LPI2C_BRD_SCFGR1_RXSTALL(base) (BME_UBFX32(&LPI2C_SCFGR1_REG(base), LPI2C_SCFGR1_RXSTALL_SHIFT, LPI2C_SCFGR1_RXSTALL_WIDTH))

/*! @brief Set the RXSTALL field to a new value. */
#define LPI2C_WR_SCFGR1_RXSTALL(base, value) (LPI2C_RMW_SCFGR1(base, LPI2C_SCFGR1_RXSTALL_MASK, LPI2C_SCFGR1_RXSTALL(value)))
#define LPI2C_BWR_SCFGR1_RXSTALL(base, value) (BME_BFI32(&LPI2C_SCFGR1_REG(base), ((uint32_t)(value) << LPI2C_SCFGR1_RXSTALL_SHIFT), LPI2C_SCFGR1_RXSTALL_SHIFT, LPI2C_SCFGR1_RXSTALL_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SCFGR1, field TXDSTALL[2] (RW)
 *
 * Enables SCL clock stretching when the transmit data flag is set during a
 * slave-transmit transfer. Clock stretching occurs following the 9th bit and is
 * therefore compatible with high speed mode.
 *
 * Values:
 * - 0b0 - Clock stretching disabled.
 * - 0b1 - Clock stretching enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SCFGR1_TXDSTALL field. */
#define LPI2C_RD_SCFGR1_TXDSTALL(base) ((LPI2C_SCFGR1_REG(base) & LPI2C_SCFGR1_TXDSTALL_MASK) >> LPI2C_SCFGR1_TXDSTALL_SHIFT)
#define LPI2C_BRD_SCFGR1_TXDSTALL(base) (BME_UBFX32(&LPI2C_SCFGR1_REG(base), LPI2C_SCFGR1_TXDSTALL_SHIFT, LPI2C_SCFGR1_TXDSTALL_WIDTH))

/*! @brief Set the TXDSTALL field to a new value. */
#define LPI2C_WR_SCFGR1_TXDSTALL(base, value) (LPI2C_RMW_SCFGR1(base, LPI2C_SCFGR1_TXDSTALL_MASK, LPI2C_SCFGR1_TXDSTALL(value)))
#define LPI2C_BWR_SCFGR1_TXDSTALL(base, value) (BME_BFI32(&LPI2C_SCFGR1_REG(base), ((uint32_t)(value) << LPI2C_SCFGR1_TXDSTALL_SHIFT), LPI2C_SCFGR1_TXDSTALL_SHIFT, LPI2C_SCFGR1_TXDSTALL_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SCFGR1, field ACKSTALL[3] (RW)
 *
 * Enables SCL clock stretching during slave-transmit address byte(s) and
 * slave-receiver address and data byte(s) to allow software to write the Transmit ACK
 * Register before the ACK or NACK is transmitted. Clock stretching occurs when
 * transmitting the 9th bit and is therefore not compatible with high speed mode.
 * When ACKSTALL is enabled, there is no need to set either RXSTALL or ADRSTALL
 *
 * Values:
 * - 0b0 - Clock stretching disabled.
 * - 0b1 - Clock stretching enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SCFGR1_ACKSTALL field. */
#define LPI2C_RD_SCFGR1_ACKSTALL(base) ((LPI2C_SCFGR1_REG(base) & LPI2C_SCFGR1_ACKSTALL_MASK) >> LPI2C_SCFGR1_ACKSTALL_SHIFT)
#define LPI2C_BRD_SCFGR1_ACKSTALL(base) (BME_UBFX32(&LPI2C_SCFGR1_REG(base), LPI2C_SCFGR1_ACKSTALL_SHIFT, LPI2C_SCFGR1_ACKSTALL_WIDTH))

/*! @brief Set the ACKSTALL field to a new value. */
#define LPI2C_WR_SCFGR1_ACKSTALL(base, value) (LPI2C_RMW_SCFGR1(base, LPI2C_SCFGR1_ACKSTALL_MASK, LPI2C_SCFGR1_ACKSTALL(value)))
#define LPI2C_BWR_SCFGR1_ACKSTALL(base, value) (BME_BFI32(&LPI2C_SCFGR1_REG(base), ((uint32_t)(value) << LPI2C_SCFGR1_ACKSTALL_SHIFT), LPI2C_SCFGR1_ACKSTALL_SHIFT, LPI2C_SCFGR1_ACKSTALL_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SCFGR1, field GCEN[8] (RW)
 *
 * Values:
 * - 0b0 - General Call address is disabled.
 * - 0b1 - General call address is enabled.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SCFGR1_GCEN field. */
#define LPI2C_RD_SCFGR1_GCEN(base) ((LPI2C_SCFGR1_REG(base) & LPI2C_SCFGR1_GCEN_MASK) >> LPI2C_SCFGR1_GCEN_SHIFT)
#define LPI2C_BRD_SCFGR1_GCEN(base) (BME_UBFX32(&LPI2C_SCFGR1_REG(base), LPI2C_SCFGR1_GCEN_SHIFT, LPI2C_SCFGR1_GCEN_WIDTH))

/*! @brief Set the GCEN field to a new value. */
#define LPI2C_WR_SCFGR1_GCEN(base, value) (LPI2C_RMW_SCFGR1(base, LPI2C_SCFGR1_GCEN_MASK, LPI2C_SCFGR1_GCEN(value)))
#define LPI2C_BWR_SCFGR1_GCEN(base, value) (BME_BFI32(&LPI2C_SCFGR1_REG(base), ((uint32_t)(value) << LPI2C_SCFGR1_GCEN_SHIFT), LPI2C_SCFGR1_GCEN_SHIFT, LPI2C_SCFGR1_GCEN_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SCFGR1, field SAEN[9] (RW)
 *
 * Values:
 * - 0b0 - Disables match on SMBus Alert.
 * - 0b1 - Enables match on SMBus Alert.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SCFGR1_SAEN field. */
#define LPI2C_RD_SCFGR1_SAEN(base) ((LPI2C_SCFGR1_REG(base) & LPI2C_SCFGR1_SAEN_MASK) >> LPI2C_SCFGR1_SAEN_SHIFT)
#define LPI2C_BRD_SCFGR1_SAEN(base) (BME_UBFX32(&LPI2C_SCFGR1_REG(base), LPI2C_SCFGR1_SAEN_SHIFT, LPI2C_SCFGR1_SAEN_WIDTH))

/*! @brief Set the SAEN field to a new value. */
#define LPI2C_WR_SCFGR1_SAEN(base, value) (LPI2C_RMW_SCFGR1(base, LPI2C_SCFGR1_SAEN_MASK, LPI2C_SCFGR1_SAEN(value)))
#define LPI2C_BWR_SCFGR1_SAEN(base, value) (BME_BFI32(&LPI2C_SCFGR1_REG(base), ((uint32_t)(value) << LPI2C_SCFGR1_SAEN_SHIFT), LPI2C_SCFGR1_SAEN_SHIFT, LPI2C_SCFGR1_SAEN_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SCFGR1, field TXCFG[10] (RW)
 *
 * The transmit data flag will always assert before a NACK is detected at the
 * end of a slave-transmit transfer. This can cause an extra word to be written to
 * the transmit data FIFO. When TXCFG=0, the transmit data register is
 * automatically emptied when a slave-transmit transfer is detected. This cause the
 * transmit data flag to assert whenever a slave-transmit transfer is detected and
 * negate at the end of the slave-transmit transfer. When TXCFG=1, the transmit data
 * flag will assert whenver the transit data register is empty and negate when the
 * transmit data register is full. This allows the transmit data register to be
 * filled before a slave-transmit transfer is detected, but can cause the
 * transmit data register to be written before a NACK is detected on the last byte of a
 * slave transmit transfer.
 *
 * Values:
 * - 0b0 - Transmit Data Flag will only assert during a slave-transmit transfer
 *     when the transmit data register is empty.
 * - 0b1 - Transmit Data Flag will assert whenever the transmit data register is
 *     empty.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SCFGR1_TXCFG field. */
#define LPI2C_RD_SCFGR1_TXCFG(base) ((LPI2C_SCFGR1_REG(base) & LPI2C_SCFGR1_TXCFG_MASK) >> LPI2C_SCFGR1_TXCFG_SHIFT)
#define LPI2C_BRD_SCFGR1_TXCFG(base) (BME_UBFX32(&LPI2C_SCFGR1_REG(base), LPI2C_SCFGR1_TXCFG_SHIFT, LPI2C_SCFGR1_TXCFG_WIDTH))

