pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the TXCFG field to a new value. */
#define LPI2C_WR_SCFGR1_TXCFG(base, value) (LPI2C_RMW_SCFGR1(base, LPI2C_SCFGR1_TXCFG_MASK, LPI2C_SCFGR1_TXCFG(value)))
#define LPI2C_BWR_SCFGR1_TXCFG(base, value) (BME_BFI32(&LPI2C_SCFGR1_REG(base), ((uint32_t)(value) << LPI2C_SCFGR1_TXCFG_SHIFT), LPI2C_SCFGR1_TXCFG_SHIFT, LPI2C_SCFGR1_TXCFG_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SCFGR1, field RXCFG[11] (RW)
 *
 * Values:
 * - 0b0 - Reading the receive data register will return receive data and clear
 *     the receive data flag.
 * - 0b1 - Reading the receive data register when the address valid flag is set
 *     will return the address status register and clear the address valid flag.
 *     Reading the receive data register when the address valid flag is clear
 *     will return receive data and clear the receive data flag.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SCFGR1_RXCFG field. */
#define LPI2C_RD_SCFGR1_RXCFG(base) ((LPI2C_SCFGR1_REG(base) & LPI2C_SCFGR1_RXCFG_MASK) >> LPI2C_SCFGR1_RXCFG_SHIFT)
#define LPI2C_BRD_SCFGR1_RXCFG(base) (BME_UBFX32(&LPI2C_SCFGR1_REG(base), LPI2C_SCFGR1_RXCFG_SHIFT, LPI2C_SCFGR1_RXCFG_WIDTH))

/*! @brief Set the RXCFG field to a new value. */
#define LPI2C_WR_SCFGR1_RXCFG(base, value) (LPI2C_RMW_SCFGR1(base, LPI2C_SCFGR1_RXCFG_MASK, LPI2C_SCFGR1_RXCFG(value)))
#define LPI2C_BWR_SCFGR1_RXCFG(base, value) (BME_BFI32(&LPI2C_SCFGR1_REG(base), ((uint32_t)(value) << LPI2C_SCFGR1_RXCFG_SHIFT), LPI2C_SCFGR1_RXCFG_SHIFT, LPI2C_SCFGR1_RXCFG_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SCFGR1, field IGNACK[12] (RW)
 *
 * When set, the LPI2C slave will continue transfers after a NACK is detected.
 * This bit is required to be set in Ultra-Fast Mode.
 *
 * Values:
 * - 0b0 - Slave will end transfer when NACK detected.
 * - 0b1 - Slave will not end transfer when NACK detected.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SCFGR1_IGNACK field. */
#define LPI2C_RD_SCFGR1_IGNACK(base) ((LPI2C_SCFGR1_REG(base) & LPI2C_SCFGR1_IGNACK_MASK) >> LPI2C_SCFGR1_IGNACK_SHIFT)
#define LPI2C_BRD_SCFGR1_IGNACK(base) (BME_UBFX32(&LPI2C_SCFGR1_REG(base), LPI2C_SCFGR1_IGNACK_SHIFT, LPI2C_SCFGR1_IGNACK_WIDTH))

/*! @brief Set the IGNACK field to a new value. */
#define LPI2C_WR_SCFGR1_IGNACK(base, value) (LPI2C_RMW_SCFGR1(base, LPI2C_SCFGR1_IGNACK_MASK, LPI2C_SCFGR1_IGNACK(value)))
#define LPI2C_BWR_SCFGR1_IGNACK(base, value) (BME_BFI32(&LPI2C_SCFGR1_REG(base), ((uint32_t)(value) << LPI2C_SCFGR1_IGNACK_SHIFT), LPI2C_SCFGR1_IGNACK_SHIFT, LPI2C_SCFGR1_IGNACK_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SCFGR1, field HSMEN[13] (RW)
 *
 * Enables detection of the High-speed Mode master code of slave address
 * 0000_1XX, but does not cause an address match on this code. When set and any Hs-mode
 * master code is detected, the FILTEN and ACKSTALL bits are ignored until the
 * next STOP condition is detected.
 *
 * Values:
 * - 0b0 - Disables detection of Hs-mode master code.
 * - 0b1 - Enables detection of Hs-mode master code.
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SCFGR1_HSMEN field. */
#define LPI2C_RD_SCFGR1_HSMEN(base) ((LPI2C_SCFGR1_REG(base) & LPI2C_SCFGR1_HSMEN_MASK) >> LPI2C_SCFGR1_HSMEN_SHIFT)
#define LPI2C_BRD_SCFGR1_HSMEN(base) (BME_UBFX32(&LPI2C_SCFGR1_REG(base), LPI2C_SCFGR1_HSMEN_SHIFT, LPI2C_SCFGR1_HSMEN_WIDTH))

/*! @brief Set the HSMEN field to a new value. */
#define LPI2C_WR_SCFGR1_HSMEN(base, value) (LPI2C_RMW_SCFGR1(base, LPI2C_SCFGR1_HSMEN_MASK, LPI2C_SCFGR1_HSMEN(value)))
#define LPI2C_BWR_SCFGR1_HSMEN(base, value) (BME_BFI32(&LPI2C_SCFGR1_REG(base), ((uint32_t)(value) << LPI2C_SCFGR1_HSMEN_SHIFT), LPI2C_SCFGR1_HSMEN_SHIFT, LPI2C_SCFGR1_HSMEN_WIDTH))
/*@}*/

/*!
 * @name Register LPI2C_SCFGR1, field ADDRCFG[18:16] (RW)
 *
 * Configures the condition that will cause an address to match.
 *
 * Values:
 * - 0b000 - Address match 0 (7-bit).
 * - 0b001 - Address match 0 (10-bit).
 * - 0b010 - Address match 0 (7-bit) or Address match 1 (7-bit).
 * - 0b011 - Address match 0 (10-bit) or Address match 1 (10-bit).
 * - 0b100 - Address match 0 (7-bit) or Address match 1 (10-bit).
 * - 0b101 - Address match 0 (10-bit) or Address match 1 (7-bit).
 * - 0b110 - From Address match 0 (7-bit) to Address match 1 (7-bit).
 * - 0b111 - From Address match 0 (10-bit) to Address match 1 (10-bit).
 */
/*@{*/
/*! @brief Read current value of the LPI2C_SCFGR1_ADDRCFG field. */
#define LPI2C_RD_SCFGR1_ADDRCFG(base) ((LPI2C_SCFGR1_REG(base) & LPI2C_SCFGR1_ADDRCFG_MASK) >> LPI2C_SCFGR1_ADDRCFG_SHIFT)
#define LPI2C_BRD_SCFGR1_ADDRCFG(base) (BME_UBFX32(&LPI2C_SCFGR1_REG(base), LPI2C_SCFGR1_ADDRCFG_SHIFT, LPI2C_SCFGR1_ADDRCFG_WIDTH))

/*! @brief Set the ADDRCFG field to a new value. */
#define LPI2C_WR_SCFGR1_ADDRCFG(base, value) (LPI2C_RMW_SCFGR1(base, LPI2C_SCFGR1_ADDRCFG_MASK, LPI2C_SCFGR1_ADDRCFG(value)))
#define LPI2C_BWR_SCFGR1_ADDRCFG(base, value) (BME_BFI32(&LPI2C_SCFGR1_REG(base), ((uint32_t)(value) << LPI2C_SCFGR1_ADDRCFG_SHIFT), LPI2C_SCFGR1_ADDRCFG_SHIFT, LPI2C_SCFGR1_ADDRCFG_WIDTH))
/*@}*/

/*******************************************************************************
 * LPI2C_SCFGR2 - Slave Configuration Register 2
 ******************************************************************************/

/*!
 * @brief LPI2C_SCFGR2 - Slave Configuration Register 2 (RW)
 *
 * Reset value: 0x00000000U
 *
 * The SCFGR2 should only be written when the I2C Slave is disabled.
 */
/*!
 * @name Constants and macros for entire LPI2C_SCFGR2 register
 */
/*@{*/
#define LPI2C_RD_SCFGR2(base)    (LPI2C_SCFGR2_REG(base))
#define LPI2C_WR_SCFGR2(base, value) (LPI2C_SCFGR2_REG(base) = (value))
#define LPI2C_RMW_SCFGR2(base, mask, value) (LPI2C_WR_SCFGR2(base, (LPI2C_RD_SCFGR2(base) & ~(mask)) | (value)))
#define LPI2C_SET_SCFGR2(base, value) (BME_OR32(&LPI2C_SCFGR2_REG(base), (uint32_t)(value)))
#define LPI2C_CLR_SCFGR2(base, value) (BME_AND32(&LPI2C_SCFGR2_REG(base), (uint32_t)(~(value))))
#define LPI2C_TOG_SCFGR2(base, value) (BME_XOR32(&LPI2C_SCFGR2_REG(base), (uint32_t)(value)))
/*@}*/

