pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * LPIT_MSR - Module Status Register
 ******************************************************************************/

/*!
 * @brief LPIT_MSR - Module Status Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPIT_MSR register
 */
/*@{*/
#define LPIT_RD_MSR(base)        (LPIT_MSR_REG(base))
#define LPIT_WR_MSR(base, value) (LPIT_MSR_REG(base) = (value))
#define LPIT_RMW_MSR(base, mask, value) (LPIT_WR_MSR(base, (LPIT_RD_MSR(base) & ~(mask)) | (value)))
#define LPIT_SET_MSR(base, value) (BME_OR32(&LPIT_MSR_REG(base), (uint32_t)(value)))
#define LPIT_CLR_MSR(base, value) (BME_AND32(&LPIT_MSR_REG(base), (uint32_t)(~(value))))
#define LPIT_TOG_MSR(base, value) (BME_XOR32(&LPIT_MSR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LPIT_MSR bitfields
 */

/*!
 * @name Register LPIT_MSR, field TIF0[0] (W1C)
 *
 * In compare modes, sets to 1 at the end of the timer period. In capture modes,
 * sets to 1 when the trigger asserts. Writing logic 1 to this flag clears it.
 * Writing 0 has no effect.
 *
 * Values:
 * - 0b0 - Timer has not timed out
 * - 0b1 - Timeout has occurred
 */
/*@{*/
/*! @brief Read current value of the LPIT_MSR_TIF0 field. */
#define LPIT_RD_MSR_TIF0(base) ((LPIT_MSR_REG(base) & LPIT_MSR_TIF0_MASK) >> LPIT_MSR_TIF0_SHIFT)
#define LPIT_BRD_MSR_TIF0(base) (BME_UBFX32(&LPIT_MSR_REG(base), LPIT_MSR_TIF0_SHIFT, LPIT_MSR_TIF0_WIDTH))

/*! @brief Set the TIF0 field to a new value. */
#define LPIT_WR_MSR_TIF0(base, value) (LPIT_RMW_MSR(base, (LPIT_MSR_TIF0_MASK | LPIT_MSR_TIF1_MASK | LPIT_MSR_TIF2_MASK | LPIT_MSR_TIF3_MASK), LPIT_MSR_TIF0(value)))
#define LPIT_BWR_MSR_TIF0(base, value) (BME_BFI32(&LPIT_MSR_REG(base), ((uint32_t)(value) << LPIT_MSR_TIF0_SHIFT), LPIT_MSR_TIF0_SHIFT, LPIT_MSR_TIF0_WIDTH))
/*@}*/

/*!
 * @name Register LPIT_MSR, field TIF1[1] (W1C)
 *
 * In compare modes, sets to 1 at the end of the timer period. In capture modes,
 * sets to 1 when the trigger asserts. Writing logic 1 to this flag clears it.
 * Writing 0 has no effect.
 *
 * Values:
 * - 0b0 - Timer has not timed out
 * - 0b1 - Timeout has occurred
 */
/*@{*/
/*! @brief Read current value of the LPIT_MSR_TIF1 field. */
#define LPIT_RD_MSR_TIF1(base) ((LPIT_MSR_REG(base) & LPIT_MSR_TIF1_MASK) >> LPIT_MSR_TIF1_SHIFT)
#define LPIT_BRD_MSR_TIF1(base) (BME_UBFX32(&LPIT_MSR_REG(base), LPIT_MSR_TIF1_SHIFT, LPIT_MSR_TIF1_WIDTH))

/*! @brief Set the TIF1 field to a new value. */
#define LPIT_WR_MSR_TIF1(base, value) (LPIT_RMW_MSR(base, (LPIT_MSR_TIF1_MASK | LPIT_MSR_TIF0_MASK | LPIT_MSR_TIF2_MASK | LPIT_MSR_TIF3_MASK), LPIT_MSR_TIF1(value)))
#define LPIT_BWR_MSR_TIF1(base, value) (BME_BFI32(&LPIT_MSR_REG(base), ((uint32_t)(value) << LPIT_MSR_TIF1_SHIFT), LPIT_MSR_TIF1_SHIFT, LPIT_MSR_TIF1_WIDTH))
/*@}*/

/*!
 * @name Register LPIT_MSR, field TIF2[2] (W1C)
 *
 * In compare modes, sets to 1 at the end of the timer period. In capture modes,
 * sets to 1 when the trigger asserts. Writing logic 1 to this flag clears it.
 * Writing 0 has no effect.
 *
 * Values:
 * - 0b0 - Timer has not timed out
 * - 0b1 - Timeout has occurred
 */
/*@{*/
/*! @brief Read current value of the LPIT_MSR_TIF2 field. */
#define LPIT_RD_MSR_TIF2(base) ((LPIT_MSR_REG(base) & LPIT_MSR_TIF2_MASK) >> LPIT_MSR_TIF2_SHIFT)
#define LPIT_BRD_MSR_TIF2(base) (BME_UBFX32(&LPIT_MSR_REG(base), LPIT_MSR_TIF2_SHIFT, LPIT_MSR_TIF2_WIDTH))

/*! @brief Set the TIF2 field to a new value. */
#define LPIT_WR_MSR_TIF2(base, value) (LPIT_RMW_MSR(base, (LPIT_MSR_TIF2_MASK | LPIT_MSR_TIF0_MASK | LPIT_MSR_TIF1_MASK | LPIT_MSR_TIF3_MASK), LPIT_MSR_TIF2(value)))
#define LPIT_BWR_MSR_TIF2(base, value) (BME_BFI32(&LPIT_MSR_REG(base), ((uint32_t)(value) << LPIT_MSR_TIF2_SHIFT), LPIT_MSR_TIF2_SHIFT, LPIT_MSR_TIF2_WIDTH))
/*@}*/

/*!
 * @name Register LPIT_MSR, field TIF3[3] (W1C)
 *
 * In compare modes, sets to 1 at the end of the timer period. In capture modes,
 * sets to 1 when the trigger asserts. Writing logic 1 to this flag clears it.
 * Writing 0 has no effect.
 *
 * Values:
 * - 0b0 - Timer has not timed out
 * - 0b1 - Timeout has occurred
 */
/*@{*/
/*! @brief Read current value of the LPIT_MSR_TIF3 field. */
#define LPIT_RD_MSR_TIF3(base) ((LPIT_MSR_REG(base) & LPIT_MSR_TIF3_MASK) >> LPIT_MSR_TIF3_SHIFT)
#define LPIT_BRD_MSR_TIF3(base) (BME_UBFX32(&LPIT_MSR_REG(base), LPIT_MSR_TIF3_SHIFT, LPIT_MSR_TIF3_WIDTH))

/*! @brief Set the TIF3 field to a new value. */
#define LPIT_WR_MSR_TIF3(base, value) (LPIT_RMW_MSR(base, (LPIT_MSR_TIF3_MASK | LPIT_MSR_TIF0_MASK | LPIT_MSR_TIF1_MASK | LPIT_MSR_TIF2_MASK), LPIT_MSR_TIF3(value)))
#define LPIT_BWR_MSR_TIF3(base, value) (BME_BFI32(&LPIT_MSR_REG(base), ((uint32_t)(value) << LPIT_MSR_TIF3_SHIFT), LPIT_MSR_TIF3_SHIFT, LPIT_MSR_TIF3_WIDTH))
/*@}*/

/*******************************************************************************
 * LPIT_MIER - Module Interrupt Enable Register
 ******************************************************************************/

/*!
 * @brief LPIT_MIER - Module Interrupt Enable Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPIT_MIER register
 */
/*@{*/
#define LPIT_RD_MIER(base)       (LPIT_MIER_REG(base))
#define LPIT_WR_MIER(base, value) (LPIT_MIER_REG(base) = (value))
#define LPIT_RMW_MIER(base, mask, value) (LPIT_WR_MIER(base, (LPIT_RD_MIER(base) & ~(mask)) | (value)))
#define LPIT_SET_MIER(base, value) (BME_OR32(&LPIT_MIER_REG(base), (uint32_t)(value)))
#define LPIT_CLR_MIER(base, value) (BME_AND32(&LPIT_MIER_REG(base), (uint32_t)(~(value))))
#define LPIT_TOG_MIER(base, value) (BME_XOR32(&LPIT_MIER_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LPIT_MIER bitfields
 */

/*!
 * @name Register LPIT_MIER, field TIE0[0] (RW)
 *
 * Enables interrupt generation when this bit is set to 1 and if corresponding
 * Timer Interrupt Flag is asserted.
 *
 * Values:
 * - 0b0 - Interrupt generation is disabled
 * - 0b1 - Interrupt generation is enabled
 */
/*@{*/
/*! @brief Read current value of the LPIT_MIER_TIE0 field. */
#define LPIT_RD_MIER_TIE0(base) ((LPIT_MIER_REG(base) & LPIT_MIER_TIE0_MASK) >> LPIT_MIER_TIE0_SHIFT)
#define LPIT_BRD_MIER_TIE0(base) (BME_UBFX32(&LPIT_MIER_REG(base), LPIT_MIER_TIE0_SHIFT, LPIT_MIER_TIE0_WIDTH))

