pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the TIE0 field to a new value. */
#define LPIT_WR_MIER_TIE0(base, value) (LPIT_RMW_MIER(base, LPIT_MIER_TIE0_MASK, LPIT_MIER_TIE0(value)))
#define LPIT_BWR_MIER_TIE0(base, value) (BME_BFI32(&LPIT_MIER_REG(base), ((uint32_t)(value) << LPIT_MIER_TIE0_SHIFT), LPIT_MIER_TIE0_SHIFT, LPIT_MIER_TIE0_WIDTH))
/*@}*/

/*!
 * @name Register LPIT_MIER, field TIE1[1] (RW)
 *
 * Enables interrupt generation when this bit is set to 1 and if corresponding
 * Timer Interrupt Flag is asserted.
 *
 * Values:
 * - 0b0 - Interrupt generation is disabled
 * - 0b1 - Interrupt generation is enabled
 */
/*@{*/
/*! @brief Read current value of the LPIT_MIER_TIE1 field. */
#define LPIT_RD_MIER_TIE1(base) ((LPIT_MIER_REG(base) & LPIT_MIER_TIE1_MASK) >> LPIT_MIER_TIE1_SHIFT)
#define LPIT_BRD_MIER_TIE1(base) (BME_UBFX32(&LPIT_MIER_REG(base), LPIT_MIER_TIE1_SHIFT, LPIT_MIER_TIE1_WIDTH))

/*! @brief Set the TIE1 field to a new value. */
#define LPIT_WR_MIER_TIE1(base, value) (LPIT_RMW_MIER(base, LPIT_MIER_TIE1_MASK, LPIT_MIER_TIE1(value)))
#define LPIT_BWR_MIER_TIE1(base, value) (BME_BFI32(&LPIT_MIER_REG(base), ((uint32_t)(value) << LPIT_MIER_TIE1_SHIFT), LPIT_MIER_TIE1_SHIFT, LPIT_MIER_TIE1_WIDTH))
/*@}*/

/*!
 * @name Register LPIT_MIER, field TIE2[2] (RW)
 *
 * Enables interrupt generation when this bit is set to 1 and if corresponding
 * Timer Interrupt Flag is asserted.
 *
 * Values:
 * - 0b0 - Interrupt generation is disabled
 * - 0b1 - Interrupt generation is enabled
 */
/*@{*/
/*! @brief Read current value of the LPIT_MIER_TIE2 field. */
#define LPIT_RD_MIER_TIE2(base) ((LPIT_MIER_REG(base) & LPIT_MIER_TIE2_MASK) >> LPIT_MIER_TIE2_SHIFT)
#define LPIT_BRD_MIER_TIE2(base) (BME_UBFX32(&LPIT_MIER_REG(base), LPIT_MIER_TIE2_SHIFT, LPIT_MIER_TIE2_WIDTH))

/*! @brief Set the TIE2 field to a new value. */
#define LPIT_WR_MIER_TIE2(base, value) (LPIT_RMW_MIER(base, LPIT_MIER_TIE2_MASK, LPIT_MIER_TIE2(value)))
#define LPIT_BWR_MIER_TIE2(base, value) (BME_BFI32(&LPIT_MIER_REG(base), ((uint32_t)(value) << LPIT_MIER_TIE2_SHIFT), LPIT_MIER_TIE2_SHIFT, LPIT_MIER_TIE2_WIDTH))
/*@}*/

/*!
 * @name Register LPIT_MIER, field TIE3[3] (RW)
 *
 * Enables interrupt generation when this bit is set to 1 and if corresponding
 * Timer Interrupt Flag is asserted.
 *
 * Values:
 * - 0b0 - Interrupt generation is disabled
 * - 0b1 - Interrupt generation is enabled
 */
/*@{*/
/*! @brief Read current value of the LPIT_MIER_TIE3 field. */
#define LPIT_RD_MIER_TIE3(base) ((LPIT_MIER_REG(base) & LPIT_MIER_TIE3_MASK) >> LPIT_MIER_TIE3_SHIFT)
#define LPIT_BRD_MIER_TIE3(base) (BME_UBFX32(&LPIT_MIER_REG(base), LPIT_MIER_TIE3_SHIFT, LPIT_MIER_TIE3_WIDTH))

/*! @brief Set the TIE3 field to a new value. */
#define LPIT_WR_MIER_TIE3(base, value) (LPIT_RMW_MIER(base, LPIT_MIER_TIE3_MASK, LPIT_MIER_TIE3(value)))
#define LPIT_BWR_MIER_TIE3(base, value) (BME_BFI32(&LPIT_MIER_REG(base), ((uint32_t)(value) << LPIT_MIER_TIE3_SHIFT), LPIT_MIER_TIE3_SHIFT, LPIT_MIER_TIE3_WIDTH))
/*@}*/

/*******************************************************************************
 * LPIT_SETTEN - Set Timer Enable Register
 ******************************************************************************/

/*!
 * @brief LPIT_SETTEN - Set Timer Enable Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register allows simulataneous enabling of timer channels. Timer channels
 * can be enabled either by writing '1' to T_EN in respective TCTRLn register or
 * setting the corresponding bit in this register. Writing a '0' to this
 * register has no effect. CLRTEN register should be used to disable timer channels
 * simultaneously.
 */
/*!
 * @name Constants and macros for entire LPIT_SETTEN register
 */
/*@{*/
#define LPIT_RD_SETTEN(base)     (LPIT_SETTEN_REG(base))
#define LPIT_WR_SETTEN(base, value) (LPIT_SETTEN_REG(base) = (value))
#define LPIT_RMW_SETTEN(base, mask, value) (LPIT_WR_SETTEN(base, (LPIT_RD_SETTEN(base) & ~(mask)) | (value)))
#define LPIT_SET_SETTEN(base, value) (BME_OR32(&LPIT_SETTEN_REG(base), (uint32_t)(value)))
#define LPIT_CLR_SETTEN(base, value) (BME_AND32(&LPIT_SETTEN_REG(base), (uint32_t)(~(value))))
#define LPIT_TOG_SETTEN(base, value) (BME_XOR32(&LPIT_SETTEN_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LPIT_SETTEN bitfields
 */

/*!
 * @name Register LPIT_SETTEN, field SET_T_EN_0[0] (RW)
 *
 * Writing '1' to this bit will enable the timer channel 0. This bit can be used
 * in addition to T_EN bit in TCTRL0 register. Writing a 0 will not disable the
 * counter. This bit will be cleared when T_EN bit in TCTRL0 is set to 0 or '1'
 * is written to the CLR_T_EN_0 bit in CLRTEN register.
 *
 * Values:
 * - 0b0 - No effect
 * - 0b1 - Enables the Timer Channel 0
 */
/*@{*/
/*! @brief Read current value of the LPIT_SETTEN_SET_T_EN_0 field. */
#define LPIT_RD_SETTEN_SET_T_EN_0(base) ((LPIT_SETTEN_REG(base) & LPIT_SETTEN_SET_T_EN_0_MASK) >> LPIT_SETTEN_SET_T_EN_0_SHIFT)
#define LPIT_BRD_SETTEN_SET_T_EN_0(base) (BME_UBFX32(&LPIT_SETTEN_REG(base), LPIT_SETTEN_SET_T_EN_0_SHIFT, LPIT_SETTEN_SET_T_EN_0_WIDTH))

/*! @brief Set the SET_T_EN_0 field to a new value. */
#define LPIT_WR_SETTEN_SET_T_EN_0(base, value) (LPIT_RMW_SETTEN(base, LPIT_SETTEN_SET_T_EN_0_MASK, LPIT_SETTEN_SET_T_EN_0(value)))
#define LPIT_BWR_SETTEN_SET_T_EN_0(base, value) (BME_BFI32(&LPIT_SETTEN_REG(base), ((uint32_t)(value) << LPIT_SETTEN_SET_T_EN_0_SHIFT), LPIT_SETTEN_SET_T_EN_0_SHIFT, LPIT_SETTEN_SET_T_EN_0_WIDTH))
/*@}*/

/*!
 * @name Register LPIT_SETTEN, field SET_T_EN_1[1] (RW)
 *
 * Writing '1' to this bit will enable the timer channel 1. This bit can be used
 * in addition to T_EN bit in TCTRL1 register. Writing a 0 will not disable the
 * counter. This bit will be cleared when T_EN bit in TCTRL1 is set to '0' or '1'
 * is written to the CLR_T_EN_1 bit in CLRTEN register.
 *
 * Values:
 * - 0b0 - No Effect
 * - 0b1 - Enables the Timer Channel 1
 */
/*@{*/
/*! @brief Read current value of the LPIT_SETTEN_SET_T_EN_1 field. */
#define LPIT_RD_SETTEN_SET_T_EN_1(base) ((LPIT_SETTEN_REG(base) & LPIT_SETTEN_SET_T_EN_1_MASK) >> LPIT_SETTEN_SET_T_EN_1_SHIFT)
#define LPIT_BRD_SETTEN_SET_T_EN_1(base) (BME_UBFX32(&LPIT_SETTEN_REG(base), LPIT_SETTEN_SET_T_EN_1_SHIFT, LPIT_SETTEN_SET_T_EN_1_WIDTH))

