pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the SET_T_EN_1 field to a new value. */
#define LPIT_WR_SETTEN_SET_T_EN_1(base, value) (LPIT_RMW_SETTEN(base, LPIT_SETTEN_SET_T_EN_1_MASK, LPIT_SETTEN_SET_T_EN_1(value)))
#define LPIT_BWR_SETTEN_SET_T_EN_1(base, value) (BME_BFI32(&LPIT_SETTEN_REG(base), ((uint32_t)(value) << LPIT_SETTEN_SET_T_EN_1_SHIFT), LPIT_SETTEN_SET_T_EN_1_SHIFT, LPIT_SETTEN_SET_T_EN_1_WIDTH))
/*@}*/

/*!
 * @name Register LPIT_SETTEN, field SET_T_EN_2[2] (RW)
 *
 * Writing '1' to this bit will enable the timer channel 2. This bit can be used
 * in addition to T_EN bit in TCTRL2 register. Writing a 0 will not disable the
 * counter. This bit will be cleared when T_EN bit in TCTRL2 is set to '0' or '1'
 * is written to the CLR_T_EN_2 bit in CLRTEN register.
 *
 * Values:
 * - 0b0 - No Effect
 * - 0b1 - Enables the Timer Channel 2
 */
/*@{*/
/*! @brief Read current value of the LPIT_SETTEN_SET_T_EN_2 field. */
#define LPIT_RD_SETTEN_SET_T_EN_2(base) ((LPIT_SETTEN_REG(base) & LPIT_SETTEN_SET_T_EN_2_MASK) >> LPIT_SETTEN_SET_T_EN_2_SHIFT)
#define LPIT_BRD_SETTEN_SET_T_EN_2(base) (BME_UBFX32(&LPIT_SETTEN_REG(base), LPIT_SETTEN_SET_T_EN_2_SHIFT, LPIT_SETTEN_SET_T_EN_2_WIDTH))

/*! @brief Set the SET_T_EN_2 field to a new value. */
#define LPIT_WR_SETTEN_SET_T_EN_2(base, value) (LPIT_RMW_SETTEN(base, LPIT_SETTEN_SET_T_EN_2_MASK, LPIT_SETTEN_SET_T_EN_2(value)))
#define LPIT_BWR_SETTEN_SET_T_EN_2(base, value) (BME_BFI32(&LPIT_SETTEN_REG(base), ((uint32_t)(value) << LPIT_SETTEN_SET_T_EN_2_SHIFT), LPIT_SETTEN_SET_T_EN_2_SHIFT, LPIT_SETTEN_SET_T_EN_2_WIDTH))
/*@}*/

/*!
 * @name Register LPIT_SETTEN, field SET_T_EN_3[3] (RW)
 *
 * Writing '1' to this bit will enable the timer channel 3. This bit can be used
 * in addition to T_EN bit in TCTRL3 register. Writing a 0 will not disable the
 * counter. This bit will be cleared when T_EN bit in TCTRL3 is set to '0' or '1'
 * is written to the CLR_T_EN_3 bit in CLRTEN register.
 *
 * Values:
 * - 0b0 - No effect
 * - 0b1 - Enables the Timer Channel 3
 */
/*@{*/
/*! @brief Read current value of the LPIT_SETTEN_SET_T_EN_3 field. */
#define LPIT_RD_SETTEN_SET_T_EN_3(base) ((LPIT_SETTEN_REG(base) & LPIT_SETTEN_SET_T_EN_3_MASK) >> LPIT_SETTEN_SET_T_EN_3_SHIFT)
#define LPIT_BRD_SETTEN_SET_T_EN_3(base) (BME_UBFX32(&LPIT_SETTEN_REG(base), LPIT_SETTEN_SET_T_EN_3_SHIFT, LPIT_SETTEN_SET_T_EN_3_WIDTH))

/*! @brief Set the SET_T_EN_3 field to a new value. */
#define LPIT_WR_SETTEN_SET_T_EN_3(base, value) (LPIT_RMW_SETTEN(base, LPIT_SETTEN_SET_T_EN_3_MASK, LPIT_SETTEN_SET_T_EN_3(value)))
#define LPIT_BWR_SETTEN_SET_T_EN_3(base, value) (BME_BFI32(&LPIT_SETTEN_REG(base), ((uint32_t)(value) << LPIT_SETTEN_SET_T_EN_3_SHIFT), LPIT_SETTEN_SET_T_EN_3_SHIFT, LPIT_SETTEN_SET_T_EN_3_WIDTH))
/*@}*/

/*******************************************************************************
 * LPIT_CLRTEN - Clear Timer Enable Register
 ******************************************************************************/

/*!
 * @brief LPIT_CLRTEN - Clear Timer Enable Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPIT_CLRTEN register
 */
/*@{*/
#define LPIT_RD_CLRTEN(base)     (LPIT_CLRTEN_REG(base))
#define LPIT_WR_CLRTEN(base, value) (LPIT_CLRTEN_REG(base) = (value))
#define LPIT_RMW_CLRTEN(base, mask, value) (LPIT_WR_CLRTEN(base, (LPIT_RD_CLRTEN(base) & ~(mask)) | (value)))
#define LPIT_SET_CLRTEN(base, value) (BME_OR32(&LPIT_CLRTEN_REG(base), (uint32_t)(value)))
#define LPIT_CLR_CLRTEN(base, value) (BME_AND32(&LPIT_CLRTEN_REG(base), (uint32_t)(~(value))))
#define LPIT_TOG_CLRTEN(base, value) (BME_XOR32(&LPIT_CLRTEN_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LPIT_CLRTEN bitfields
 */

/*!
 * @name Register LPIT_CLRTEN, field CLR_T_EN_0[0] (WORZ)
 *
 * Writing a '1' to this bit will disable the timer channel 0. This bit can be
 * used in addition to T_EN bit in TCTRL0 register. Writing a 1 will not enable
 * the counter. This bit is self clearing and will always read 0.
 *
 * Values:
 * - 0b0 - No action
 * - 0b1 - Clear T_EN bit for Timer Channel 0
 */
/*@{*/
/*! @brief Set the CLR_T_EN_0 field to a new value. */
#define LPIT_WR_CLRTEN_CLR_T_EN_0(base, value) (LPIT_RMW_CLRTEN(base, LPIT_CLRTEN_CLR_T_EN_0_MASK, LPIT_CLRTEN_CLR_T_EN_0(value)))
#define LPIT_BWR_CLRTEN_CLR_T_EN_0(base, value) (BME_BFI32(&LPIT_CLRTEN_REG(base), ((uint32_t)(value) << LPIT_CLRTEN_CLR_T_EN_0_SHIFT), LPIT_CLRTEN_CLR_T_EN_0_SHIFT, LPIT_CLRTEN_CLR_T_EN_0_WIDTH))
/*@}*/

/*!
 * @name Register LPIT_CLRTEN, field CLR_T_EN_1[1] (WORZ)
 *
 * Writing a '1' to this bit will disable the timer channel 1. This bit can be
 * used in addition to T_EN bit in TCTRL1 register. Writing a 1 will not enable
 * the counter. This bit is self clearing and will always read 0.
 *
 * Values:
 * - 0b0 - No Action
 * - 0b1 - Clear T_EN bit for Timer Channel 1
 */
/*@{*/
/*! @brief Set the CLR_T_EN_1 field to a new value. */
#define LPIT_WR_CLRTEN_CLR_T_EN_1(base, value) (LPIT_RMW_CLRTEN(base, LPIT_CLRTEN_CLR_T_EN_1_MASK, LPIT_CLRTEN_CLR_T_EN_1(value)))
#define LPIT_BWR_CLRTEN_CLR_T_EN_1(base, value) (BME_BFI32(&LPIT_CLRTEN_REG(base), ((uint32_t)(value) << LPIT_CLRTEN_CLR_T_EN_1_SHIFT), LPIT_CLRTEN_CLR_T_EN_1_SHIFT, LPIT_CLRTEN_CLR_T_EN_1_WIDTH))
/*@}*/

/*!
 * @name Register LPIT_CLRTEN, field CLR_T_EN_2[2] (WORZ)
 *
 * Writing a '1' to this bit will disable the timer channel 2. This bit can be
 * used in addition to T_EN bit in TCTRL2 register. Writing a 1 will not enable
 * the counter. This bit is self clearing and will always read 0.
 *
 * Values:
 * - 0b0 - No Action
 * - 0b1 - Clear T_EN bit for Timer Channel 2
 */
/*@{*/
/*! @brief Set the CLR_T_EN_2 field to a new value. */
#define LPIT_WR_CLRTEN_CLR_T_EN_2(base, value) (LPIT_RMW_CLRTEN(base, LPIT_CLRTEN_CLR_T_EN_2_MASK, LPIT_CLRTEN_CLR_T_EN_2(value)))
#define LPIT_BWR_CLRTEN_CLR_T_EN_2(base, value) (BME_BFI32(&LPIT_CLRTEN_REG(base), ((uint32_t)(value) << LPIT_CLRTEN_CLR_T_EN_2_SHIFT), LPIT_CLRTEN_CLR_T_EN_2_SHIFT, LPIT_CLRTEN_CLR_T_EN_2_WIDTH))
/*@}*/

/*!
 * @name Register LPIT_CLRTEN, field CLR_T_EN_3[3] (WORZ)
 *
 * Writing a '1' to this bit will disable the timer channel 3. This bit can be
 * used in addition to T_EN bit in TCTRL3 register. Writing a 1 will not enable
 * the counter. This bit is self clearing and will always read 0.
 *
 * Values:
 * - 0b0 - No Action
 * - 0b1 - Clear T_EN bit for Timer Channel 3
 */
/*@{*/
/*! @brief Set the CLR_T_EN_3 field to a new value. */
#define LPIT_WR_CLRTEN_CLR_T_EN_3(base, value) (LPIT_RMW_CLRTEN(base, LPIT_CLRTEN_CLR_T_EN_3_MASK, LPIT_CLRTEN_CLR_T_EN_3(value)))
#define LPIT_BWR_CLRTEN_CLR_T_EN_3(base, value) (BME_BFI32(&LPIT_CLRTEN_REG(base), ((uint32_t)(value) << LPIT_CLRTEN_CLR_T_EN_3_SHIFT), LPIT_CLRTEN_CLR_T_EN_3_SHIFT, LPIT_CLRTEN_CLR_T_EN_3_WIDTH))
/*@}*/

