pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * LPIT_TVAL - Timer Value Register
 ******************************************************************************/

/*!
 * @brief LPIT_TVAL - Timer Value Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * In compare modes, these registers select the timeout period for the timer
 * channels. In capture modes, these registers are loaded with the value of the
 * counter when the trigger asserts.
 */
/*!
 * @name Constants and macros for entire LPIT_TVAL register
 */
/*@{*/
#define LPIT_RD_TVAL(base, index) (LPIT_TVAL_REG(base, index))
#define LPIT_WR_TVAL(base, index, value) (LPIT_TVAL_REG(base, index) = (value))
#define LPIT_RMW_TVAL(base, index, mask, value) (LPIT_WR_TVAL(base, index, (LPIT_RD_TVAL(base, index) & ~(mask)) | (value)))
#define LPIT_SET_TVAL(base, index, value) (BME_OR32(&LPIT_TVAL_REG(base, index), (uint32_t)(value)))
#define LPIT_CLR_TVAL(base, index, value) (BME_AND32(&LPIT_TVAL_REG(base, index), (uint32_t)(~(value))))
#define LPIT_TOG_TVAL(base, index, value) (BME_XOR32(&LPIT_TVAL_REG(base, index), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * LPIT_CVAL - Current Timer Value
 ******************************************************************************/

/*!
 * @brief LPIT_CVAL - Current Timer Value (RO)
 *
 * Reset value: 0xFFFFFFFFU
 *
 * These registers indicate the current timer counter value.
 */
/*!
 * @name Constants and macros for entire LPIT_CVAL register
 */
/*@{*/
#define LPIT_RD_CVAL(base, index) (LPIT_CVAL_REG(base, index))
/*@}*/

/*******************************************************************************
 * LPIT_TCTRL - Timer Control Register
 ******************************************************************************/

/*!
 * @brief LPIT_TCTRL - Timer Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * These registers contain the control bits for each timer channel
 */
/*!
 * @name Constants and macros for entire LPIT_TCTRL register
 */
/*@{*/
#define LPIT_RD_TCTRL(base, index) (LPIT_TCTRL_REG(base, index))
#define LPIT_WR_TCTRL(base, index, value) (LPIT_TCTRL_REG(base, index) = (value))
#define LPIT_RMW_TCTRL(base, index, mask, value) (LPIT_WR_TCTRL(base, index, (LPIT_RD_TCTRL(base, index) & ~(mask)) | (value)))
#define LPIT_SET_TCTRL(base, index, value) (BME_OR32(&LPIT_TCTRL_REG(base, index), (uint32_t)(value)))
#define LPIT_CLR_TCTRL(base, index, value) (BME_AND32(&LPIT_TCTRL_REG(base, index), (uint32_t)(~(value))))
#define LPIT_TOG_TCTRL(base, index, value) (BME_XOR32(&LPIT_TCTRL_REG(base, index), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LPIT_TCTRL bitfields
 */

/*!
 * @name Register LPIT_TCTRL, field T_EN[0] (RW)
 *
 * Enables or disables the Timer Channel
 *
 * Values:
 * - 0b0 - Timer Channel is disabled
 * - 0b1 - Timer Channel is enabled
 */
/*@{*/
/*! @brief Read current value of the LPIT_TCTRL_T_EN field. */
#define LPIT_RD_TCTRL_T_EN(base, index) ((LPIT_TCTRL_REG(base, index) & LPIT_TCTRL_T_EN_MASK) >> LPIT_TCTRL_T_EN_SHIFT)
#define LPIT_BRD_TCTRL_T_EN(base, index) (BME_UBFX32(&LPIT_TCTRL_REG(base, index), LPIT_TCTRL_T_EN_SHIFT, LPIT_TCTRL_T_EN_WIDTH))

/*! @brief Set the T_EN field to a new value. */
#define LPIT_WR_TCTRL_T_EN(base, index, value) (LPIT_RMW_TCTRL(base, index, LPIT_TCTRL_T_EN_MASK, LPIT_TCTRL_T_EN(value)))
#define LPIT_BWR_TCTRL_T_EN(base, index, value) (BME_BFI32(&LPIT_TCTRL_REG(base, index), ((uint32_t)(value) << LPIT_TCTRL_T_EN_SHIFT), LPIT_TCTRL_T_EN_SHIFT, LPIT_TCTRL_T_EN_WIDTH))
/*@}*/

/*!
 * @name Register LPIT_TCTRL, field CHAIN[1] (RW)
 *
 * When enabled, timer channel will decrement when channel N-1 trigger asserts.
 * Channel 0 cannot be chained.
 *
 * Values:
 * - 0b0 - Channel Chaining is disabled. Channel Timer runs independently.
 * - 0b1 - Channel Chaining is enabled. Timer decrements on previous channel's
 *     timeout
 */
/*@{*/
/*! @brief Read current value of the LPIT_TCTRL_CHAIN field. */
#define LPIT_RD_TCTRL_CHAIN(base, index) ((LPIT_TCTRL_REG(base, index) & LPIT_TCTRL_CHAIN_MASK) >> LPIT_TCTRL_CHAIN_SHIFT)
#define LPIT_BRD_TCTRL_CHAIN(base, index) (BME_UBFX32(&LPIT_TCTRL_REG(base, index), LPIT_TCTRL_CHAIN_SHIFT, LPIT_TCTRL_CHAIN_WIDTH))

/*! @brief Set the CHAIN field to a new value. */
#define LPIT_WR_TCTRL_CHAIN(base, index, value) (LPIT_RMW_TCTRL(base, index, LPIT_TCTRL_CHAIN_MASK, LPIT_TCTRL_CHAIN(value)))
#define LPIT_BWR_TCTRL_CHAIN(base, index, value) (BME_BFI32(&LPIT_TCTRL_REG(base, index), ((uint32_t)(value) << LPIT_TCTRL_CHAIN_SHIFT), LPIT_TCTRL_CHAIN_SHIFT, LPIT_TCTRL_CHAIN_WIDTH))
/*@}*/

/*!
 * @name Register LPIT_TCTRL, field MODE[3:2] (RW)
 *
 * Configures the Channel Timer Mode of Operation. The mode bits control how the
 * timer decrements. See Functional Description for more details.
 *
 * Values:
 * - 0b00 - 32-bit Periodic Counter
 * - 0b01 - Dual 16-bit Periodic Counter
 * - 0b10 - 32-bit Trigger Accumulator
 * - 0b11 - 32-bit Trigger Input Capture
 */
/*@{*/
/*! @brief Read current value of the LPIT_TCTRL_MODE field. */
#define LPIT_RD_TCTRL_MODE(base, index) ((LPIT_TCTRL_REG(base, index) & LPIT_TCTRL_MODE_MASK) >> LPIT_TCTRL_MODE_SHIFT)
#define LPIT_BRD_TCTRL_MODE(base, index) (BME_UBFX32(&LPIT_TCTRL_REG(base, index), LPIT_TCTRL_MODE_SHIFT, LPIT_TCTRL_MODE_WIDTH))

/*! @brief Set the MODE field to a new value. */
#define LPIT_WR_TCTRL_MODE(base, index, value) (LPIT_RMW_TCTRL(base, index, LPIT_TCTRL_MODE_MASK, LPIT_TCTRL_MODE(value)))
#define LPIT_BWR_TCTRL_MODE(base, index, value) (BME_BFI32(&LPIT_TCTRL_REG(base, index), ((uint32_t)(value) << LPIT_TCTRL_MODE_SHIFT), LPIT_TCTRL_MODE_SHIFT, LPIT_TCTRL_MODE_WIDTH))
/*@}*/

/*!
 * @name Register LPIT_TCTRL, field TSOT[16] (RW)
 *
 * This bit controls when the timer starts decrementing.
 *
 * Values:
 * - 0b0 - Timer starts to decrement immediately based on restart condition
 *     (controlled by TSOI bit)
 * - 0b1 - Timer starts to decrement when rising edge on selected trigger is
 *     detected
 */
/*@{*/
/*! @brief Read current value of the LPIT_TCTRL_TSOT field. */
#define LPIT_RD_TCTRL_TSOT(base, index) ((LPIT_TCTRL_REG(base, index) & LPIT_TCTRL_TSOT_MASK) >> LPIT_TCTRL_TSOT_SHIFT)
#define LPIT_BRD_TCTRL_TSOT(base, index) (BME_UBFX32(&LPIT_TCTRL_REG(base, index), LPIT_TCTRL_TSOT_SHIFT, LPIT_TCTRL_TSOT_WIDTH))

/*! @brief Set the TSOT field to a new value. */
#define LPIT_WR_TCTRL_TSOT(base, index, value) (LPIT_RMW_TCTRL(base, index, LPIT_TCTRL_TSOT_MASK, LPIT_TCTRL_TSOT(value)))
#define LPIT_BWR_TCTRL_TSOT(base, index, value) (BME_BFI32(&LPIT_TCTRL_REG(base, index), ((uint32_t)(value) << LPIT_TCTRL_TSOT_SHIFT), LPIT_TCTRL_TSOT_SHIFT, LPIT_TCTRL_TSOT_WIDTH))
/*@}*/

/*!
 * @name Register LPIT_TCTRL, field TSOI[17] (RW)
 *
 * This bit controls whether the channel timer will stop after it times out and
 * when it can restart (when TSOT = 0). If TSOT = 1, then the timer will stop on
 * timeout and will restart after a rising edge on the selected trigger is
 * detected. If TSOT = 0, then this bit controls when the timer restarts.
 *
 * Values:
 * - 0b0 - Timer does not stop after timeout
 * - 0b1 - Timer will stop after timeout and will restart after rising edge on
 *     the T_EN bit is detected (i.e. timer channel is disabled and then enabled)
 */
/*@{*/
/*! @brief Read current value of the LPIT_TCTRL_TSOI field. */
#define LPIT_RD_TCTRL_TSOI(base, index) ((LPIT_TCTRL_REG(base, index) & LPIT_TCTRL_TSOI_MASK) >> LPIT_TCTRL_TSOI_SHIFT)
#define LPIT_BRD_TCTRL_TSOI(base, index) (BME_UBFX32(&LPIT_TCTRL_REG(base, index), LPIT_TCTRL_TSOI_SHIFT, LPIT_TCTRL_TSOI_WIDTH))

/*! @brief Set the TSOI field to a new value. */
#define LPIT_WR_TCTRL_TSOI(base, index, value) (LPIT_RMW_TCTRL(base, index, LPIT_TCTRL_TSOI_MASK, LPIT_TCTRL_TSOI(value)))
#define LPIT_BWR_TCTRL_TSOI(base, index, value) (BME_BFI32(&LPIT_TCTRL_REG(base, index), ((uint32_t)(value) << LPIT_TCTRL_TSOI_SHIFT), LPIT_TCTRL_TSOI_SHIFT, LPIT_TCTRL_TSOI_WIDTH))
/*@}*/

/*!
 * @name Register LPIT_TCTRL, field TROT[18] (RW)
 *
 * When set, the LPIT timer will reload when a rising edge is detected on the
 * selected trigger input. The trigger input is ignored if the LPIT is disabled
 * during debug mode or DOZE mode (DOZE_EN or DBGEN = 0)
 *
 * Values:
 * - 0b0 - Timer will not reload on selected trigger
 * - 0b1 - Timer will reload on selected trigger
 */
/*@{*/
/*! @brief Read current value of the LPIT_TCTRL_TROT field. */
#define LPIT_RD_TCTRL_TROT(base, index) ((LPIT_TCTRL_REG(base, index) & LPIT_TCTRL_TROT_MASK) >> LPIT_TCTRL_TROT_SHIFT)
#define LPIT_BRD_TCTRL_TROT(base, index) (BME_UBFX32(&LPIT_TCTRL_REG(base, index), LPIT_TCTRL_TROT_SHIFT, LPIT_TCTRL_TROT_WIDTH))

/*! @brief Set the TROT field to a new value. */
#define LPIT_WR_TCTRL_TROT(base, index, value) (LPIT_RMW_TCTRL(base, index, LPIT_TCTRL_TROT_MASK, LPIT_TCTRL_TROT(value)))
#define LPIT_BWR_TCTRL_TROT(base, index, value) (BME_BFI32(&LPIT_TCTRL_REG(base, index), ((uint32_t)(value) << LPIT_TCTRL_TROT_SHIFT), LPIT_TCTRL_TROT_SHIFT, LPIT_TCTRL_TROT_WIDTH))
/*@}*/

/*!
 * @name Register LPIT_TCTRL, field TRG_SRC[23] (RW)
 *
 * Selects between internal or external trigger sources. The final trigger is
 * selected by TRG_SEL depending on which trigger source out of internal triggers
 * or external triggers are selected by TRG_SRC. Refer to the chip configuration
 * section for available external trigger options. If a channel does not have an
 * associated external trigger then this bit for that channel should be set to 1.
 *
 * Values:
 * - 0b0 - Trigger source selected in external
 * - 0b1 - Trigger source selected is the internal trigger
 */
/*@{*/
/*! @brief Read current value of the LPIT_TCTRL_TRG_SRC field. */
#define LPIT_RD_TCTRL_TRG_SRC(base, index) ((LPIT_TCTRL_REG(base, index) & LPIT_TCTRL_TRG_SRC_MASK) >> LPIT_TCTRL_TRG_SRC_SHIFT)
#define LPIT_BRD_TCTRL_TRG_SRC(base, index) (BME_UBFX32(&LPIT_TCTRL_REG(base, index), LPIT_TCTRL_TRG_SRC_SHIFT, LPIT_TCTRL_TRG_SRC_WIDTH))

/*! @brief Set the TRG_SRC field to a new value. */
#define LPIT_WR_TCTRL_TRG_SRC(base, index, value) (LPIT_RMW_TCTRL(base, index, LPIT_TCTRL_TRG_SRC_MASK, LPIT_TCTRL_TRG_SRC(value)))
#define LPIT_BWR_TCTRL_TRG_SRC(base, index, value) (BME_BFI32(&LPIT_TCTRL_REG(base, index), ((uint32_t)(value) << LPIT_TCTRL_TRG_SRC_SHIFT), LPIT_TCTRL_TRG_SRC_SHIFT, LPIT_TCTRL_TRG_SRC_WIDTH))
/*@}*/

/*!
 * @name Register LPIT_TCTRL, field TRG_SEL[27:24] (RW)
 *
 * Selects the trigger to use for starting and/or reloading the LPIT timer. This
 * field should only be changed when the LPIT timer channel is disabled. The
 * TRG_SRC bit selects between internal and external trigger signals for each
 * channel. The TRG_SEL bits select one trigger from the set of internal or external
 * triggers selected by TRG_SRC.
 *
 * Values:
 * - 0b0000 - Timer channel 0 trigger source is selected
 * - 0b0001 - Timer channel 1 trigger source is selected
 */
/*@{*/
/*! @brief Read current value of the LPIT_TCTRL_TRG_SEL field. */
#define LPIT_RD_TCTRL_TRG_SEL(base, index) ((LPIT_TCTRL_REG(base, index) & LPIT_TCTRL_TRG_SEL_MASK) >> LPIT_TCTRL_TRG_SEL_SHIFT)
#define LPIT_BRD_TCTRL_TRG_SEL(base, index) (BME_UBFX32(&LPIT_TCTRL_REG(base, index), LPIT_TCTRL_TRG_SEL_SHIFT, LPIT_TCTRL_TRG_SEL_WIDTH))

