pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * LPSPI_DER - DMA Enable Register
 ******************************************************************************/

/*!
 * @brief LPSPI_DER - DMA Enable Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPSPI_DER register
 */
/*@{*/
#define LPSPI_RD_DER(base)       (LPSPI_DER_REG(base))
#define LPSPI_WR_DER(base, value) (LPSPI_DER_REG(base) = (value))
#define LPSPI_RMW_DER(base, mask, value) (LPSPI_WR_DER(base, (LPSPI_RD_DER(base) & ~(mask)) | (value)))
#define LPSPI_SET_DER(base, value) (BME_OR32(&LPSPI_DER_REG(base), (uint32_t)(value)))
#define LPSPI_CLR_DER(base, value) (BME_AND32(&LPSPI_DER_REG(base), (uint32_t)(~(value))))
#define LPSPI_TOG_DER(base, value) (BME_XOR32(&LPSPI_DER_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LPSPI_DER bitfields
 */

/*!
 * @name Register LPSPI_DER, field TDDE[0] (RW)
 *
 * Values:
 * - 0b0 - DMA request disabled.
 * - 0b1 - DMA request enabled
 */
/*@{*/
/*! @brief Read current value of the LPSPI_DER_TDDE field. */
#define LPSPI_RD_DER_TDDE(base) ((LPSPI_DER_REG(base) & LPSPI_DER_TDDE_MASK) >> LPSPI_DER_TDDE_SHIFT)
#define LPSPI_BRD_DER_TDDE(base) (BME_UBFX32(&LPSPI_DER_REG(base), LPSPI_DER_TDDE_SHIFT, LPSPI_DER_TDDE_WIDTH))

/*! @brief Set the TDDE field to a new value. */
#define LPSPI_WR_DER_TDDE(base, value) (LPSPI_RMW_DER(base, LPSPI_DER_TDDE_MASK, LPSPI_DER_TDDE(value)))
#define LPSPI_BWR_DER_TDDE(base, value) (BME_BFI32(&LPSPI_DER_REG(base), ((uint32_t)(value) << LPSPI_DER_TDDE_SHIFT), LPSPI_DER_TDDE_SHIFT, LPSPI_DER_TDDE_WIDTH))
/*@}*/

/*!
 * @name Register LPSPI_DER, field RDDE[1] (RW)
 *
 * Values:
 * - 0b0 - DMA request disabled.
 * - 0b1 - DMA request enabled.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_DER_RDDE field. */
#define LPSPI_RD_DER_RDDE(base) ((LPSPI_DER_REG(base) & LPSPI_DER_RDDE_MASK) >> LPSPI_DER_RDDE_SHIFT)
#define LPSPI_BRD_DER_RDDE(base) (BME_UBFX32(&LPSPI_DER_REG(base), LPSPI_DER_RDDE_SHIFT, LPSPI_DER_RDDE_WIDTH))

/*! @brief Set the RDDE field to a new value. */
#define LPSPI_WR_DER_RDDE(base, value) (LPSPI_RMW_DER(base, LPSPI_DER_RDDE_MASK, LPSPI_DER_RDDE(value)))
#define LPSPI_BWR_DER_RDDE(base, value) (BME_BFI32(&LPSPI_DER_REG(base), ((uint32_t)(value) << LPSPI_DER_RDDE_SHIFT), LPSPI_DER_RDDE_SHIFT, LPSPI_DER_RDDE_WIDTH))
/*@}*/

/*******************************************************************************
 * LPSPI_CFGR0 - Configuration Register 0
 ******************************************************************************/

/*!
 * @brief LPSPI_CFGR0 - Configuration Register 0 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPSPI_CFGR0 register
 */
/*@{*/
#define LPSPI_RD_CFGR0(base)     (LPSPI_CFGR0_REG(base))
#define LPSPI_WR_CFGR0(base, value) (LPSPI_CFGR0_REG(base) = (value))
#define LPSPI_RMW_CFGR0(base, mask, value) (LPSPI_WR_CFGR0(base, (LPSPI_RD_CFGR0(base) & ~(mask)) | (value)))
#define LPSPI_SET_CFGR0(base, value) (BME_OR32(&LPSPI_CFGR0_REG(base), (uint32_t)(value)))
#define LPSPI_CLR_CFGR0(base, value) (BME_AND32(&LPSPI_CFGR0_REG(base), (uint32_t)(~(value))))
#define LPSPI_TOG_CFGR0(base, value) (BME_XOR32(&LPSPI_CFGR0_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LPSPI_CFGR0 bitfields
 */

/*!
 * @name Register LPSPI_CFGR0, field HREN[0] (RW)
 *
 * When enabled in master mode, the LPSPI will only initiate a SPI bus transfer
 * if the host request input is asserted.
 *
 * Values:
 * - 0b0 - Host request is disabled.
 * - 0b1 - Host request is enabled.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_CFGR0_HREN field. */
#define LPSPI_RD_CFGR0_HREN(base) ((LPSPI_CFGR0_REG(base) & LPSPI_CFGR0_HREN_MASK) >> LPSPI_CFGR0_HREN_SHIFT)
#define LPSPI_BRD_CFGR0_HREN(base) (BME_UBFX32(&LPSPI_CFGR0_REG(base), LPSPI_CFGR0_HREN_SHIFT, LPSPI_CFGR0_HREN_WIDTH))

/*! @brief Set the HREN field to a new value. */
#define LPSPI_WR_CFGR0_HREN(base, value) (LPSPI_RMW_CFGR0(base, LPSPI_CFGR0_HREN_MASK, LPSPI_CFGR0_HREN(value)))
#define LPSPI_BWR_CFGR0_HREN(base, value) (BME_BFI32(&LPSPI_CFGR0_REG(base), ((uint32_t)(value) << LPSPI_CFGR0_HREN_SHIFT), LPSPI_CFGR0_HREN_SHIFT, LPSPI_CFGR0_HREN_WIDTH))
/*@}*/

/*!
 * @name Register LPSPI_CFGR0, field HRPOL[1] (RW)
 *
 * Configures the polarity of the host request pin.
 *
 * Values:
 * - 0b0 - Active low.
 * - 0b1 - Active high.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_CFGR0_HRPOL field. */
#define LPSPI_RD_CFGR0_HRPOL(base) ((LPSPI_CFGR0_REG(base) & LPSPI_CFGR0_HRPOL_MASK) >> LPSPI_CFGR0_HRPOL_SHIFT)
#define LPSPI_BRD_CFGR0_HRPOL(base) (BME_UBFX32(&LPSPI_CFGR0_REG(base), LPSPI_CFGR0_HRPOL_SHIFT, LPSPI_CFGR0_HRPOL_WIDTH))

/*! @brief Set the HRPOL field to a new value. */
#define LPSPI_WR_CFGR0_HRPOL(base, value) (LPSPI_RMW_CFGR0(base, LPSPI_CFGR0_HRPOL_MASK, LPSPI_CFGR0_HRPOL(value)))
#define LPSPI_BWR_CFGR0_HRPOL(base, value) (BME_BFI32(&LPSPI_CFGR0_REG(base), ((uint32_t)(value) << LPSPI_CFGR0_HRPOL_SHIFT), LPSPI_CFGR0_HRPOL_SHIFT, LPSPI_CFGR0_HRPOL_WIDTH))
/*@}*/

/*!
 * @name Register LPSPI_CFGR0, field HRSEL[2] (RW)
 *
 * Selects the source of the host request input. When the host request function
 * is enabled with the LPSPI_HREQ pin, the LPSPI_PCS[1] function is disabled.
 *
 * Values:
 * - 0b0 - Host request input is pin LPSPI_HREQ.
 * - 0b1 - Host request input is input trigger.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_CFGR0_HRSEL field. */
#define LPSPI_RD_CFGR0_HRSEL(base) ((LPSPI_CFGR0_REG(base) & LPSPI_CFGR0_HRSEL_MASK) >> LPSPI_CFGR0_HRSEL_SHIFT)
#define LPSPI_BRD_CFGR0_HRSEL(base) (BME_UBFX32(&LPSPI_CFGR0_REG(base), LPSPI_CFGR0_HRSEL_SHIFT, LPSPI_CFGR0_HRSEL_WIDTH))

/*! @brief Set the HRSEL field to a new value. */
#define LPSPI_WR_CFGR0_HRSEL(base, value) (LPSPI_RMW_CFGR0(base, LPSPI_CFGR0_HRSEL_MASK, LPSPI_CFGR0_HRSEL(value)))
#define LPSPI_BWR_CFGR0_HRSEL(base, value) (BME_BFI32(&LPSPI_CFGR0_REG(base), ((uint32_t)(value) << LPSPI_CFGR0_HRSEL_SHIFT), LPSPI_CFGR0_HRSEL_SHIFT, LPSPI_CFGR0_HRSEL_WIDTH))
/*@}*/

/*!
 * @name Register LPSPI_CFGR0, field CIRFIFO[8] (RW)
 *
 * When enabled, the transmit FIFO read pointer is saved to a temporary
 * register. The transmit FIFO will be emptied as normal, but once the LPSPI is idle and
 * the transmit FIFO is empty, then the read pointer value will be restored from
 * the temporary register. This will cause the contents of the transmit FIFO to
 * be cycled through repeatedly.
 *
 * Values:
 * - 0b0 - Circular FIFO is disabled.
 * - 0b1 - Circular FIFO is enabled.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_CFGR0_CIRFIFO field. */
#define LPSPI_RD_CFGR0_CIRFIFO(base) ((LPSPI_CFGR0_REG(base) & LPSPI_CFGR0_CIRFIFO_MASK) >> LPSPI_CFGR0_CIRFIFO_SHIFT)
#define LPSPI_BRD_CFGR0_CIRFIFO(base) (BME_UBFX32(&LPSPI_CFGR0_REG(base), LPSPI_CFGR0_CIRFIFO_SHIFT, LPSPI_CFGR0_CIRFIFO_WIDTH))

/*! @brief Set the CIRFIFO field to a new value. */
#define LPSPI_WR_CFGR0_CIRFIFO(base, value) (LPSPI_RMW_CFGR0(base, LPSPI_CFGR0_CIRFIFO_MASK, LPSPI_CFGR0_CIRFIFO(value)))
#define LPSPI_BWR_CFGR0_CIRFIFO(base, value) (BME_BFI32(&LPSPI_CFGR0_REG(base), ((uint32_t)(value) << LPSPI_CFGR0_CIRFIFO_SHIFT), LPSPI_CFGR0_CIRFIFO_SHIFT, LPSPI_CFGR0_CIRFIFO_WIDTH))
/*@}*/

/*!
 * @name Register LPSPI_CFGR0, field RDMO[9] (RW)
 *
 * When enabled, all received data that does not cause DMF to set is discarded.
 * Once DMF is set, the RDMO configuration is ignored. When disabling RDMO, clear
 * RDMO before clearing DMF to ensure no receive data is lost.
 *
 * Values:
 * - 0b0 - Received data is stored in the receive FIFO as normal.
 * - 0b1 - Received data is discarded unless the DMF is set.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_CFGR0_RDMO field. */
#define LPSPI_RD_CFGR0_RDMO(base) ((LPSPI_CFGR0_REG(base) & LPSPI_CFGR0_RDMO_MASK) >> LPSPI_CFGR0_RDMO_SHIFT)
#define LPSPI_BRD_CFGR0_RDMO(base) (BME_UBFX32(&LPSPI_CFGR0_REG(base), LPSPI_CFGR0_RDMO_SHIFT, LPSPI_CFGR0_RDMO_WIDTH))

/*! @brief Set the RDMO field to a new value. */
#define LPSPI_WR_CFGR0_RDMO(base, value) (LPSPI_RMW_CFGR0(base, LPSPI_CFGR0_RDMO_MASK, LPSPI_CFGR0_RDMO(value)))
#define LPSPI_BWR_CFGR0_RDMO(base, value) (BME_BFI32(&LPSPI_CFGR0_REG(base), ((uint32_t)(value) << LPSPI_CFGR0_RDMO_SHIFT), LPSPI_CFGR0_RDMO_SHIFT, LPSPI_CFGR0_RDMO_WIDTH))
/*@}*/

