pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the PINCFG field to a new value. */
#define LPSPI_WR_CFGR1_PINCFG(base, value) (LPSPI_RMW_CFGR1(base, LPSPI_CFGR1_PINCFG_MASK, LPSPI_CFGR1_PINCFG(value)))
#define LPSPI_BWR_CFGR1_PINCFG(base, value) (BME_BFI32(&LPSPI_CFGR1_REG(base), ((uint32_t)(value) << LPSPI_CFGR1_PINCFG_SHIFT), LPSPI_CFGR1_PINCFG_SHIFT, LPSPI_CFGR1_PINCFG_WIDTH))
/*@}*/

/*!
 * @name Register LPSPI_CFGR1, field OUTCFG[26] (RW)
 *
 * Configures if the output data is tristated between accesses (LPSPI_PCS is
 * negated).
 *
 * Values:
 * - 0b0 - Output data retains last value when chip select is negated.
 * - 0b1 - Output data is tristated when chip select is negated.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_CFGR1_OUTCFG field. */
#define LPSPI_RD_CFGR1_OUTCFG(base) ((LPSPI_CFGR1_REG(base) & LPSPI_CFGR1_OUTCFG_MASK) >> LPSPI_CFGR1_OUTCFG_SHIFT)
#define LPSPI_BRD_CFGR1_OUTCFG(base) (BME_UBFX32(&LPSPI_CFGR1_REG(base), LPSPI_CFGR1_OUTCFG_SHIFT, LPSPI_CFGR1_OUTCFG_WIDTH))

/*! @brief Set the OUTCFG field to a new value. */
#define LPSPI_WR_CFGR1_OUTCFG(base, value) (LPSPI_RMW_CFGR1(base, LPSPI_CFGR1_OUTCFG_MASK, LPSPI_CFGR1_OUTCFG(value)))
#define LPSPI_BWR_CFGR1_OUTCFG(base, value) (BME_BFI32(&LPSPI_CFGR1_REG(base), ((uint32_t)(value) << LPSPI_CFGR1_OUTCFG_SHIFT), LPSPI_CFGR1_OUTCFG_SHIFT, LPSPI_CFGR1_OUTCFG_WIDTH))
/*@}*/

/*!
 * @name Register LPSPI_CFGR1, field PCSCFG[27] (RW)
 *
 * PCSCFG must be set if performing 4-bit transfers.
 *
 * Values:
 * - 0b0 - PCS[3:2] are enabled.
 * - 0b1 - PCS[3:2] are disabled.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_CFGR1_PCSCFG field. */
#define LPSPI_RD_CFGR1_PCSCFG(base) ((LPSPI_CFGR1_REG(base) & LPSPI_CFGR1_PCSCFG_MASK) >> LPSPI_CFGR1_PCSCFG_SHIFT)
#define LPSPI_BRD_CFGR1_PCSCFG(base) (BME_UBFX32(&LPSPI_CFGR1_REG(base), LPSPI_CFGR1_PCSCFG_SHIFT, LPSPI_CFGR1_PCSCFG_WIDTH))

/*! @brief Set the PCSCFG field to a new value. */
#define LPSPI_WR_CFGR1_PCSCFG(base, value) (LPSPI_RMW_CFGR1(base, LPSPI_CFGR1_PCSCFG_MASK, LPSPI_CFGR1_PCSCFG(value)))
#define LPSPI_BWR_CFGR1_PCSCFG(base, value) (BME_BFI32(&LPSPI_CFGR1_REG(base), ((uint32_t)(value) << LPSPI_CFGR1_PCSCFG_SHIFT), LPSPI_CFGR1_PCSCFG_SHIFT, LPSPI_CFGR1_PCSCFG_WIDTH))
/*@}*/

/*******************************************************************************
 * LPSPI_DMR0 - Data Match Register 0
 ******************************************************************************/

/*!
 * @brief LPSPI_DMR0 - Data Match Register 0 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPSPI_DMR0 register
 */
/*@{*/
#define LPSPI_RD_DMR0(base)      (LPSPI_DMR0_REG(base))
#define LPSPI_WR_DMR0(base, value) (LPSPI_DMR0_REG(base) = (value))
#define LPSPI_RMW_DMR0(base, mask, value) (LPSPI_WR_DMR0(base, (LPSPI_RD_DMR0(base) & ~(mask)) | (value)))
#define LPSPI_SET_DMR0(base, value) (BME_OR32(&LPSPI_DMR0_REG(base), (uint32_t)(value)))
#define LPSPI_CLR_DMR0(base, value) (BME_AND32(&LPSPI_DMR0_REG(base), (uint32_t)(~(value))))
#define LPSPI_TOG_DMR0(base, value) (BME_XOR32(&LPSPI_DMR0_REG(base), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * LPSPI_DMR1 - Data Match Register 1
 ******************************************************************************/

/*!
 * @brief LPSPI_DMR1 - Data Match Register 1 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPSPI_DMR1 register
 */
/*@{*/
#define LPSPI_RD_DMR1(base)      (LPSPI_DMR1_REG(base))
#define LPSPI_WR_DMR1(base, value) (LPSPI_DMR1_REG(base) = (value))
#define LPSPI_RMW_DMR1(base, mask, value) (LPSPI_WR_DMR1(base, (LPSPI_RD_DMR1(base) & ~(mask)) | (value)))
#define LPSPI_SET_DMR1(base, value) (BME_OR32(&LPSPI_DMR1_REG(base), (uint32_t)(value)))
#define LPSPI_CLR_DMR1(base, value) (BME_AND32(&LPSPI_DMR1_REG(base), (uint32_t)(~(value))))
#define LPSPI_TOG_DMR1(base, value) (BME_XOR32(&LPSPI_DMR1_REG(base), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * LPSPI_CCR - Clock Configuration Register
 ******************************************************************************/

/*!
 * @brief LPSPI_CCR - Clock Configuration Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The CCR is only used in master mode and cannot be changed when the LPSPI is
 * enabled.
 */
/*!
 * @name Constants and macros for entire LPSPI_CCR register
 */
/*@{*/
#define LPSPI_RD_CCR(base)       (LPSPI_CCR_REG(base))
#define LPSPI_WR_CCR(base, value) (LPSPI_CCR_REG(base) = (value))
#define LPSPI_RMW_CCR(base, mask, value) (LPSPI_WR_CCR(base, (LPSPI_RD_CCR(base) & ~(mask)) | (value)))
#define LPSPI_SET_CCR(base, value) (BME_OR32(&LPSPI_CCR_REG(base), (uint32_t)(value)))
#define LPSPI_CLR_CCR(base, value) (BME_AND32(&LPSPI_CCR_REG(base), (uint32_t)(~(value))))
#define LPSPI_TOG_CCR(base, value) (BME_XOR32(&LPSPI_CCR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LPSPI_CCR bitfields
 */

/*!
 * @name Register LPSPI_CCR, field SCKDIV[7:0] (RW)
 *
 * Configures the divide ratio of the SCK pin in master mode, from the LPSPI
 * baud rate clock. The SCK period is equal to SCKDIV+2 cycles of the LPSPI baud
 * rate clock and the minimum period is 2 cycles. If the period is an odd number of
 * cycles, then the first half of the period will be one cycle longer than the
 * second half. The LPSPI baud rate clock is itself divided by the PRESCALE
 * setting, which can vary between transfers.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_CCR_SCKDIV field. */
#define LPSPI_RD_CCR_SCKDIV(base) ((LPSPI_CCR_REG(base) & LPSPI_CCR_SCKDIV_MASK) >> LPSPI_CCR_SCKDIV_SHIFT)
#define LPSPI_BRD_CCR_SCKDIV(base) (BME_UBFX32(&LPSPI_CCR_REG(base), LPSPI_CCR_SCKDIV_SHIFT, LPSPI_CCR_SCKDIV_WIDTH))

/*! @brief Set the SCKDIV field to a new value. */
#define LPSPI_WR_CCR_SCKDIV(base, value) (LPSPI_RMW_CCR(base, LPSPI_CCR_SCKDIV_MASK, LPSPI_CCR_SCKDIV(value)))
#define LPSPI_BWR_CCR_SCKDIV(base, value) (BME_BFI32(&LPSPI_CCR_REG(base), ((uint32_t)(value) << LPSPI_CCR_SCKDIV_SHIFT), LPSPI_CCR_SCKDIV_SHIFT, LPSPI_CCR_SCKDIV_WIDTH))
/*@}*/

/*!
 * @name Register LPSPI_CCR, field DBT[15:8] (RW)
 *
 * Configures the delay in master mode from the PCS negation to the next PCS
 * assertion. The delay is equal to (DBT + 2) cycles of the LPSPI baud rate clock
 * and the minimum delay is 2 cycles. Note that half the delay occurs before PCS
 * assertion and the other half occurs after PCS negation, the full command word
 * can only update in the middle. The LPSPI baud rate clock is itself divided by
 * the PRESCALE setting, which can vary between transfers. Also configures the
 * delay in master mode from the last SCK edge of a transfer word and the first SCK
 * edge of the next transfer word in a continuous transfer. The delay is equal to
 * (DBT + 1) cycles of the LPSPI baud rate clock and the minimum delay is 1
 * cycle. The LPSPI baud rate clock is itself divided by the PRESCALE setting, which
 * can vary between transfers.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_CCR_DBT field. */
#define LPSPI_RD_CCR_DBT(base) ((LPSPI_CCR_REG(base) & LPSPI_CCR_DBT_MASK) >> LPSPI_CCR_DBT_SHIFT)
#define LPSPI_BRD_CCR_DBT(base) (BME_UBFX32(&LPSPI_CCR_REG(base), LPSPI_CCR_DBT_SHIFT, LPSPI_CCR_DBT_WIDTH))

/*! @brief Set the DBT field to a new value. */
#define LPSPI_WR_CCR_DBT(base, value) (LPSPI_RMW_CCR(base, LPSPI_CCR_DBT_MASK, LPSPI_CCR_DBT(value)))
#define LPSPI_BWR_CCR_DBT(base, value) (BME_BFI32(&LPSPI_CCR_REG(base), ((uint32_t)(value) << LPSPI_CCR_DBT_SHIFT), LPSPI_CCR_DBT_SHIFT, LPSPI_CCR_DBT_WIDTH))
/*@}*/

/*!
 * @name Register LPSPI_CCR, field PCSSCK[23:16] (RW)
 *
 * Configures the delay in master mode from the PCS assertion to the first SCK
 * edge. The delay is equal to (PCSSCK + 1) cycles of the LPSPI baud rate clock
 * and the minimum delay is 1 cycle. The LPSPI baud rate clock is itself divided by
 * the PRESCALE setting, which can vary between transfers.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_CCR_PCSSCK field. */
#define LPSPI_RD_CCR_PCSSCK(base) ((LPSPI_CCR_REG(base) & LPSPI_CCR_PCSSCK_MASK) >> LPSPI_CCR_PCSSCK_SHIFT)
#define LPSPI_BRD_CCR_PCSSCK(base) (BME_UBFX32(&LPSPI_CCR_REG(base), LPSPI_CCR_PCSSCK_SHIFT, LPSPI_CCR_PCSSCK_WIDTH))

/*! @brief Set the PCSSCK field to a new value. */
#define LPSPI_WR_CCR_PCSSCK(base, value) (LPSPI_RMW_CCR(base, LPSPI_CCR_PCSSCK_MASK, LPSPI_CCR_PCSSCK(value)))
#define LPSPI_BWR_CCR_PCSSCK(base, value) (BME_BFI32(&LPSPI_CCR_REG(base), ((uint32_t)(value) << LPSPI_CCR_PCSSCK_SHIFT), LPSPI_CCR_PCSSCK_SHIFT, LPSPI_CCR_PCSSCK_WIDTH))
/*@}*/

/*!
 * @name Register LPSPI_CCR, field SCKPCS[31:24] (RW)
 *
 * Configures the delay in master mode from the last SCK edge to the PCS
 * negation. The delay is equal to (PCSSCK + 1) cycles of the LPSPI baud rate clock and
 * the minimum delay is 1 cycle. The LPSPI baud rate clock is itself divided by
 * the PRESCALE setting, which can vary between transfers.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_CCR_SCKPCS field. */
#define LPSPI_RD_CCR_SCKPCS(base) ((LPSPI_CCR_REG(base) & LPSPI_CCR_SCKPCS_MASK) >> LPSPI_CCR_SCKPCS_SHIFT)
#define LPSPI_BRD_CCR_SCKPCS(base) (BME_UBFX32(&LPSPI_CCR_REG(base), LPSPI_CCR_SCKPCS_SHIFT, LPSPI_CCR_SCKPCS_WIDTH))

/*! @brief Set the SCKPCS field to a new value. */
#define LPSPI_WR_CCR_SCKPCS(base, value) (LPSPI_RMW_CCR(base, LPSPI_CCR_SCKPCS_MASK, LPSPI_CCR_SCKPCS(value)))
#define LPSPI_BWR_CCR_SCKPCS(base, value) (BME_BFI32(&LPSPI_CCR_REG(base), ((uint32_t)(value) << LPSPI_CCR_SCKPCS_SHIFT), LPSPI_CCR_SCKPCS_SHIFT, LPSPI_CCR_SCKPCS_WIDTH))
/*@}*/

