pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * LPSPI_FCR - FIFO Control Register
 ******************************************************************************/

/*!
 * @brief LPSPI_FCR - FIFO Control Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPSPI_FCR register
 */
/*@{*/
#define LPSPI_RD_FCR(base)       (LPSPI_FCR_REG(base))
#define LPSPI_WR_FCR(base, value) (LPSPI_FCR_REG(base) = (value))
#define LPSPI_RMW_FCR(base, mask, value) (LPSPI_WR_FCR(base, (LPSPI_RD_FCR(base) & ~(mask)) | (value)))
#define LPSPI_SET_FCR(base, value) (BME_OR32(&LPSPI_FCR_REG(base), (uint32_t)(value)))
#define LPSPI_CLR_FCR(base, value) (BME_AND32(&LPSPI_FCR_REG(base), (uint32_t)(~(value))))
#define LPSPI_TOG_FCR(base, value) (BME_XOR32(&LPSPI_FCR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LPSPI_FCR bitfields
 */

/*!
 * @name Register LPSPI_FCR, field TXWATER[7:0] (RW)
 *
 * The Transmit Data Flag is set whenever the number of words in the transmit
 * FIFO is equal or less than TXWATER. Writing a value equal or greater than the
 * FIFO size will be truncated.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_FCR_TXWATER field. */
#define LPSPI_RD_FCR_TXWATER(base) ((LPSPI_FCR_REG(base) & LPSPI_FCR_TXWATER_MASK) >> LPSPI_FCR_TXWATER_SHIFT)
#define LPSPI_BRD_FCR_TXWATER(base) (BME_UBFX32(&LPSPI_FCR_REG(base), LPSPI_FCR_TXWATER_SHIFT, LPSPI_FCR_TXWATER_WIDTH))

/*! @brief Set the TXWATER field to a new value. */
#define LPSPI_WR_FCR_TXWATER(base, value) (LPSPI_RMW_FCR(base, LPSPI_FCR_TXWATER_MASK, LPSPI_FCR_TXWATER(value)))
#define LPSPI_BWR_FCR_TXWATER(base, value) (BME_BFI32(&LPSPI_FCR_REG(base), ((uint32_t)(value) << LPSPI_FCR_TXWATER_SHIFT), LPSPI_FCR_TXWATER_SHIFT, LPSPI_FCR_TXWATER_WIDTH))
/*@}*/

/*!
 * @name Register LPSPI_FCR, field RXWATER[23:16] (RW)
 *
 * The Receive Data Flag is set whenever the number of words in the receive FIFO
 * is greater than RXWATER. Writing a value equal or greater than the FIFO size
 * will be truncated.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_FCR_RXWATER field. */
#define LPSPI_RD_FCR_RXWATER(base) ((LPSPI_FCR_REG(base) & LPSPI_FCR_RXWATER_MASK) >> LPSPI_FCR_RXWATER_SHIFT)
#define LPSPI_BRD_FCR_RXWATER(base) (BME_UBFX32(&LPSPI_FCR_REG(base), LPSPI_FCR_RXWATER_SHIFT, LPSPI_FCR_RXWATER_WIDTH))

/*! @brief Set the RXWATER field to a new value. */
#define LPSPI_WR_FCR_RXWATER(base, value) (LPSPI_RMW_FCR(base, LPSPI_FCR_RXWATER_MASK, LPSPI_FCR_RXWATER(value)))
#define LPSPI_BWR_FCR_RXWATER(base, value) (BME_BFI32(&LPSPI_FCR_REG(base), ((uint32_t)(value) << LPSPI_FCR_RXWATER_SHIFT), LPSPI_FCR_RXWATER_SHIFT, LPSPI_FCR_RXWATER_WIDTH))
/*@}*/

/*******************************************************************************
 * LPSPI_FSR - FIFO Status Register
 ******************************************************************************/

/*!
 * @brief LPSPI_FSR - FIFO Status Register (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPSPI_FSR register
 */
/*@{*/
#define LPSPI_RD_FSR(base)       (LPSPI_FSR_REG(base))
/*@}*/

/*
 * Constants & macros for individual LPSPI_FSR bitfields
 */

/*!
 * @name Register LPSPI_FSR, field TXCOUNT[7:0] (RO)
 *
 * Returns the number of words in the transmit FIFO.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_FSR_TXCOUNT field. */
#define LPSPI_RD_FSR_TXCOUNT(base) ((LPSPI_FSR_REG(base) & LPSPI_FSR_TXCOUNT_MASK) >> LPSPI_FSR_TXCOUNT_SHIFT)
#define LPSPI_BRD_FSR_TXCOUNT(base) (BME_UBFX32(&LPSPI_FSR_REG(base), LPSPI_FSR_TXCOUNT_SHIFT, LPSPI_FSR_TXCOUNT_WIDTH))
/*@}*/

/*!
 * @name Register LPSPI_FSR, field RXCOUNT[23:16] (RO)
 *
 * Returns the number of words in the receive FIFO.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_FSR_RXCOUNT field. */
#define LPSPI_RD_FSR_RXCOUNT(base) ((LPSPI_FSR_REG(base) & LPSPI_FSR_RXCOUNT_MASK) >> LPSPI_FSR_RXCOUNT_SHIFT)
#define LPSPI_BRD_FSR_RXCOUNT(base) (BME_UBFX32(&LPSPI_FSR_REG(base), LPSPI_FSR_RXCOUNT_SHIFT, LPSPI_FSR_RXCOUNT_WIDTH))
/*@}*/

/*******************************************************************************
 * LPSPI_TCR - Transmit Command Register
 ******************************************************************************/

/*!
 * @brief LPSPI_TCR - Transmit Command Register (RW)
 *
 * Reset value: 0x0000001FU
 *
 * Writes to either the Transmit Command Register or Transmit Data Register will
 * push the data into the transmit FIFO in the order they are written. Command
 * Register writes will be tagged and cause the command register to update once
 * that entry reaches the top of the FIFO. This allows changes to the command word
 * and the transmit data itself to be interleaved. Changing the command word will
 * cause all subsequent SPI bus transfer to be performed using the new command
 * word. In master mode, writing a new command word does not initiate a new
 * transfer, unless TXMSK is set. Transfers are initiated by transmit data in the
 * transmit FIFO, or a new command word with TXMSK set. Hardware will clear TXMSK when
 * the LPSPI_PCS negates. In master mode if the command word is changed before
 * an existing frame has completed, then the existing frame will terminate and the
 * command word will then update. The command word can be changed during a
 * continuous transfer, provided CONTC of the new command word is set and the command
 * word is written on a frame size boundary. In slave mode, the command word
 * should be changed only when the LPSPI is idle and there is no SPI bus transfer.
 * Reading the Transmit Command Register will return the current state of the
 * command register.
 */
/*!
 * @name Constants and macros for entire LPSPI_TCR register
 */
/*@{*/
#define LPSPI_RD_TCR(base)       (LPSPI_TCR_REG(base))
#define LPSPI_WR_TCR(base, value) (LPSPI_TCR_REG(base) = (value))
#define LPSPI_RMW_TCR(base, mask, value) (LPSPI_WR_TCR(base, (LPSPI_RD_TCR(base) & ~(mask)) | (value)))
#define LPSPI_SET_TCR(base, value) (BME_OR32(&LPSPI_TCR_REG(base), (uint32_t)(value)))
#define LPSPI_CLR_TCR(base, value) (BME_AND32(&LPSPI_TCR_REG(base), (uint32_t)(~(value))))
#define LPSPI_TOG_TCR(base, value) (BME_XOR32(&LPSPI_TCR_REG(base), (uint32_t)(value)))
/*@}*/

