pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the LSBF field to a new value. */
#define LPSPI_WR_TCR_LSBF(base, value) (LPSPI_RMW_TCR(base, LPSPI_TCR_LSBF_MASK, LPSPI_TCR_LSBF(value)))
#define LPSPI_BWR_TCR_LSBF(base, value) (BME_BFI32(&LPSPI_TCR_REG(base), ((uint32_t)(value) << LPSPI_TCR_LSBF_SHIFT), LPSPI_TCR_LSBF_SHIFT, LPSPI_TCR_LSBF_WIDTH))
/*@}*/

/*!
 * @name Register LPSPI_TCR, field PCS[25:24] (RW)
 *
 * Configures the peripheral chip select used for the transfer. This field is
 * only updated between frames.
 *
 * Values:
 * - 0b00 - Transfer using LPSPI_PCS[0]
 * - 0b01 - Transfer using LPSPI_PCS[1]
 * - 0b10 - Transfer using LPSPI_PCS[2]
 * - 0b11 - Transfer using LPSPI_PCS[3]
 */
/*@{*/
/*! @brief Read current value of the LPSPI_TCR_PCS field. */
#define LPSPI_RD_TCR_PCS(base) ((LPSPI_TCR_REG(base) & LPSPI_TCR_PCS_MASK) >> LPSPI_TCR_PCS_SHIFT)
#define LPSPI_BRD_TCR_PCS(base) (BME_UBFX32(&LPSPI_TCR_REG(base), LPSPI_TCR_PCS_SHIFT, LPSPI_TCR_PCS_WIDTH))

/*! @brief Set the PCS field to a new value. */
#define LPSPI_WR_TCR_PCS(base, value) (LPSPI_RMW_TCR(base, LPSPI_TCR_PCS_MASK, LPSPI_TCR_PCS(value)))
#define LPSPI_BWR_TCR_PCS(base, value) (BME_BFI32(&LPSPI_TCR_REG(base), ((uint32_t)(value) << LPSPI_TCR_PCS_SHIFT), LPSPI_TCR_PCS_SHIFT, LPSPI_TCR_PCS_WIDTH))
/*@}*/

/*!
 * @name Register LPSPI_TCR, field PRESCALE[29:27] (RW)
 *
 * Prescaler applied to the clock configuration register for all SPI bus
 * transfers. This field is only updated between frames.
 *
 * Values:
 * - 0b000 - Divide by 1.
 * - 0b001 - Divide by 2.
 * - 0b010 - Divide by 4.
 * - 0b011 - Divide by 8.
 * - 0b100 - Divide by 16.
 * - 0b101 - Divide by 32.
 * - 0b110 - Divide by 64.
 * - 0b111 - Divide by 128.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_TCR_PRESCALE field. */
#define LPSPI_RD_TCR_PRESCALE(base) ((LPSPI_TCR_REG(base) & LPSPI_TCR_PRESCALE_MASK) >> LPSPI_TCR_PRESCALE_SHIFT)
#define LPSPI_BRD_TCR_PRESCALE(base) (BME_UBFX32(&LPSPI_TCR_REG(base), LPSPI_TCR_PRESCALE_SHIFT, LPSPI_TCR_PRESCALE_WIDTH))

/*! @brief Set the PRESCALE field to a new value. */
#define LPSPI_WR_TCR_PRESCALE(base, value) (LPSPI_RMW_TCR(base, LPSPI_TCR_PRESCALE_MASK, LPSPI_TCR_PRESCALE(value)))
#define LPSPI_BWR_TCR_PRESCALE(base, value) (BME_BFI32(&LPSPI_TCR_REG(base), ((uint32_t)(value) << LPSPI_TCR_PRESCALE_SHIFT), LPSPI_TCR_PRESCALE_SHIFT, LPSPI_TCR_PRESCALE_WIDTH))
/*@}*/

/*!
 * @name Register LPSPI_TCR, field CPHA[30] (RW)
 *
 * This field is only updated between frames.
 *
 * Values:
 * - 0b0 - Data is captured on the leading edge of SCK and changed on the
 *     following edge.
 * - 0b1 - Data is changed on the leading edge of SCK and captured on the
 *     following edge.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_TCR_CPHA field. */
#define LPSPI_RD_TCR_CPHA(base) ((LPSPI_TCR_REG(base) & LPSPI_TCR_CPHA_MASK) >> LPSPI_TCR_CPHA_SHIFT)
#define LPSPI_BRD_TCR_CPHA(base) (BME_UBFX32(&LPSPI_TCR_REG(base), LPSPI_TCR_CPHA_SHIFT, LPSPI_TCR_CPHA_WIDTH))

/*! @brief Set the CPHA field to a new value. */
#define LPSPI_WR_TCR_CPHA(base, value) (LPSPI_RMW_TCR(base, LPSPI_TCR_CPHA_MASK, LPSPI_TCR_CPHA(value)))
#define LPSPI_BWR_TCR_CPHA(base, value) (BME_BFI32(&LPSPI_TCR_REG(base), ((uint32_t)(value) << LPSPI_TCR_CPHA_SHIFT), LPSPI_TCR_CPHA_SHIFT, LPSPI_TCR_CPHA_WIDTH))
/*@}*/

/*!
 * @name Register LPSPI_TCR, field CPOL[31] (RW)
 *
 * This field is only updated between frames.
 *
 * Values:
 * - 0b0 - The inactive state value of SCK is low.
 * - 0b1 - The inactive state value of SCK is high.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_TCR_CPOL field. */
#define LPSPI_RD_TCR_CPOL(base) ((LPSPI_TCR_REG(base) & LPSPI_TCR_CPOL_MASK) >> LPSPI_TCR_CPOL_SHIFT)
#define LPSPI_BRD_TCR_CPOL(base) (BME_UBFX32(&LPSPI_TCR_REG(base), LPSPI_TCR_CPOL_SHIFT, LPSPI_TCR_CPOL_WIDTH))

/*! @brief Set the CPOL field to a new value. */
#define LPSPI_WR_TCR_CPOL(base, value) (LPSPI_RMW_TCR(base, LPSPI_TCR_CPOL_MASK, LPSPI_TCR_CPOL(value)))
#define LPSPI_BWR_TCR_CPOL(base, value) (BME_BFI32(&LPSPI_TCR_REG(base), ((uint32_t)(value) << LPSPI_TCR_CPOL_SHIFT), LPSPI_TCR_CPOL_SHIFT, LPSPI_TCR_CPOL_WIDTH))
/*@}*/

/*******************************************************************************
 * LPSPI_TDR - Transmit Data Register
 ******************************************************************************/

/*!
 * @brief LPSPI_TDR - Transmit Data Register (WO)
 *
 * Reset value: 0x00000000U
 *
 * Writes to either the Transmit Command Register or Transmit Data Register will
 * push the data into the transmit FIFO in the order it was written.
 */
/*!
 * @name Constants and macros for entire LPSPI_TDR register
 */
/*@{*/
#define LPSPI_WR_TDR(base, value) (LPSPI_TDR_REG(base) = (value))
/*@}*/

/*******************************************************************************
 * LPSPI_RSR - Receive Status Register
 ******************************************************************************/

/*!
 * @brief LPSPI_RSR - Receive Status Register (RO)
 *
 * Reset value: 0x00000002U
 */
/*!
 * @name Constants and macros for entire LPSPI_RSR register
 */
/*@{*/
#define LPSPI_RD_RSR(base)       (LPSPI_RSR_REG(base))
/*@}*/

/*
 * Constants & macros for individual LPSPI_RSR bitfields
 */

/*!
 * @name Register LPSPI_RSR, field SOF[0] (RO)
 *
 * Indicates that this is the first data word received after LPSPI_PCS assertion.
 *
 * Values:
 * - 0b0 - Subsequent data word received after LPSPI_PCS assertion.
 * - 0b1 - First data word received after LPSPI_PCS assertion.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_RSR_SOF field. */
#define LPSPI_RD_RSR_SOF(base) ((LPSPI_RSR_REG(base) & LPSPI_RSR_SOF_MASK) >> LPSPI_RSR_SOF_SHIFT)
#define LPSPI_BRD_RSR_SOF(base) (BME_UBFX32(&LPSPI_RSR_REG(base), LPSPI_RSR_SOF_SHIFT, LPSPI_RSR_SOF_WIDTH))
/*@}*/

/*!
 * @name Register LPSPI_RSR, field RXEMPTY[1] (RO)
 *
 * Values:
 * - 0b0 - RX FIFO is not empty.
 * - 0b1 - RX FIFO is empty.
 */
/*@{*/
/*! @brief Read current value of the LPSPI_RSR_RXEMPTY field. */
#define LPSPI_RD_RSR_RXEMPTY(base) ((LPSPI_RSR_REG(base) & LPSPI_RSR_RXEMPTY_MASK) >> LPSPI_RSR_RXEMPTY_SHIFT)
#define LPSPI_BRD_RSR_RXEMPTY(base) (BME_UBFX32(&LPSPI_RSR_REG(base), LPSPI_RSR_RXEMPTY_SHIFT, LPSPI_RSR_RXEMPTY_WIDTH))
/*@}*/

