pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * MCM_CPO - Compute Operation Control Register
 ******************************************************************************/

/*!
 * @brief MCM_CPO - Compute Operation Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register controls the Compute Operation.
 */
/*!
 * @name Constants and macros for entire MCM_CPO register
 */
/*@{*/
#define MCM_RD_CPO(base)         (MCM_CPO_REG(base))
#define MCM_WR_CPO(base, value)  (MCM_CPO_REG(base) = (value))
#define MCM_RMW_CPO(base, mask, value) (MCM_WR_CPO(base, (MCM_RD_CPO(base) & ~(mask)) | (value)))
#define MCM_SET_CPO(base, value) (MCM_WR_CPO(base, MCM_RD_CPO(base) |  (value)))
#define MCM_CLR_CPO(base, value) (MCM_WR_CPO(base, MCM_RD_CPO(base) & ~(value)))
#define MCM_TOG_CPO(base, value) (MCM_WR_CPO(base, MCM_RD_CPO(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MCM_CPO bitfields
 */

/*!
 * @name Register MCM_CPO, field CPOREQ[0] (RW)
 *
 * This bit is auto-cleared by vector fetching if CPOWOI = 1.
 *
 * Values:
 * - 0b0 - Request is cleared.
 * - 0b1 - Request Compute Operation.
 */
/*@{*/
/*! @brief Read current value of the MCM_CPO_CPOREQ field. */
#define MCM_RD_CPO_CPOREQ(base) ((MCM_CPO_REG(base) & MCM_CPO_CPOREQ_MASK) >> MCM_CPO_CPOREQ_SHIFT)
#define MCM_BRD_CPO_CPOREQ(base) (MCM_RD_CPO_CPOREQ(base))

/*! @brief Set the CPOREQ field to a new value. */
#define MCM_WR_CPO_CPOREQ(base, value) (MCM_RMW_CPO(base, MCM_CPO_CPOREQ_MASK, MCM_CPO_CPOREQ(value)))
#define MCM_BWR_CPO_CPOREQ(base, value) (MCM_WR_CPO_CPOREQ(base, value))
/*@}*/

/*!
 * @name Register MCM_CPO, field CPOACK[1] (RO)
 *
 * Values:
 * - 0b0 - Compute operation entry has not completed or compute operation exit
 *     has completed.
 * - 0b1 - Compute operation entry has completed or compute operation exit has
 *     not completed.
 */
/*@{*/
/*! @brief Read current value of the MCM_CPO_CPOACK field. */
#define MCM_RD_CPO_CPOACK(base) ((MCM_CPO_REG(base) & MCM_CPO_CPOACK_MASK) >> MCM_CPO_CPOACK_SHIFT)
#define MCM_BRD_CPO_CPOACK(base) (MCM_RD_CPO_CPOACK(base))
/*@}*/

/*!
 * @name Register MCM_CPO, field CPOWOI[2] (RW)
 *
 * Values:
 * - 0b0 - No effect.
 * - 0b1 - When set, the CPOREQ is cleared on any interrupt or exception vector
 *     fetch.
 */
/*@{*/
/*! @brief Read current value of the MCM_CPO_CPOWOI field. */
#define MCM_RD_CPO_CPOWOI(base) ((MCM_CPO_REG(base) & MCM_CPO_CPOWOI_MASK) >> MCM_CPO_CPOWOI_SHIFT)
#define MCM_BRD_CPO_CPOWOI(base) (MCM_RD_CPO_CPOWOI(base))

/*! @brief Set the CPOWOI field to a new value. */
#define MCM_WR_CPO_CPOWOI(base, value) (MCM_RMW_CPO(base, MCM_CPO_CPOWOI_MASK, MCM_CPO_CPOWOI(value)))
#define MCM_BWR_CPO_CPOWOI(base, value) (MCM_WR_CPO_CPOWOI(base, value))
/*@}*/

/*
 * MKL28Z7 MMDVSQ
 *
 * Divide and Square Root
 *
 * Registers defined in this header file:
 * - MMDVSQ_DEND - Dividend Register
 * - MMDVSQ_DSOR - Divisor Register
 * - MMDVSQ_CSR - Control/Status Register
 * - MMDVSQ_RES - Result Register
 * - MMDVSQ_RCND - Radicand Register
 */

#define MMDVSQ_INSTANCE_COUNT (2U) /*!< Number of instances of the MMDVSQ module. */
#define MMDVSQ0_IDX (0U) /*!< Instance number for MMDVSQ0. */
#define MMDVSQ1_IDX (1U) /*!< Instance number for MMDVSQ1. */

/*******************************************************************************
 * MMDVSQ_DEND - Dividend Register
 ******************************************************************************/

/*!
 * @brief MMDVSQ_DEND - Dividend Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is loaded with the input dividend operand before a divide
 * operation is initiated. The register is updated by the MMDVSQ hardware during the
 * execution of a divide or square root calculation. Any memory access (read or
 * write) of the DEND register while the module is busy during a calculation causes
 * the access to be stalled (using wait states) until the calculation completes.
 */
/*!
 * @name Constants and macros for entire MMDVSQ_DEND register
 */
/*@{*/
#define MMDVSQ_RD_DEND(base)     (MMDVSQ_DEND_REG(base))
#define MMDVSQ_WR_DEND(base, value) (MMDVSQ_DEND_REG(base) = (value))
#define MMDVSQ_RMW_DEND(base, mask, value) (MMDVSQ_WR_DEND(base, (MMDVSQ_RD_DEND(base) & ~(mask)) | (value)))
#define MMDVSQ_SET_DEND(base, value) (MMDVSQ_WR_DEND(base, MMDVSQ_RD_DEND(base) |  (value)))
#define MMDVSQ_CLR_DEND(base, value) (MMDVSQ_WR_DEND(base, MMDVSQ_RD_DEND(base) & ~(value)))
#define MMDVSQ_TOG_DEND(base, value) (MMDVSQ_WR_DEND(base, MMDVSQ_RD_DEND(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * MMDVSQ_DSOR - Divisor Register
 ******************************************************************************/

/*!
 * @brief MMDVSQ_DSOR - Divisor Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is loaded with the input divisor operand before a divide
 * operation is initiated. If CSR[DFS] = 0, a write to this register inititates a
 * divide operation. Any memory access (read or write) of the DSOR register while the
 * module is busy during a calculation causes the access to be stalled (using
 * wait states) until the calculation completes. If a divide operation is inititated
 * with DSOR = 0, the hardware signals a divide-by-zero condition and sets RES =
 * 0 and CSR[DZ] = 1. If CSR[DZE] = 1, an attempted read of the RES result is
 * error terminated.
 */
/*!
 * @name Constants and macros for entire MMDVSQ_DSOR register
 */
/*@{*/
#define MMDVSQ_RD_DSOR(base)     (MMDVSQ_DSOR_REG(base))
#define MMDVSQ_WR_DSOR(base, value) (MMDVSQ_DSOR_REG(base) = (value))
#define MMDVSQ_RMW_DSOR(base, mask, value) (MMDVSQ_WR_DSOR(base, (MMDVSQ_RD_DSOR(base) & ~(mask)) | (value)))
#define MMDVSQ_SET_DSOR(base, value) (MMDVSQ_WR_DSOR(base, MMDVSQ_RD_DSOR(base) |  (value)))
#define MMDVSQ_CLR_DSOR(base, value) (MMDVSQ_WR_DSOR(base, MMDVSQ_RD_DSOR(base) & ~(value)))
#define MMDVSQ_TOG_DSOR(base, value) (MMDVSQ_WR_DSOR(base, MMDVSQ_RD_DSOR(base) ^  (value)))
/*@}*/

