pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * MMDVSQ_CSR - Control/Status Register
 ******************************************************************************/

/*!
 * @brief MMDVSQ_CSR - Control/Status Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register defines the operating configuration of divide operations and
 * provides status information. The upper 3 bits provide busy status indicators,
 * while the low-order byte defines the configuration for divide operations. The
 * read-only status bits in CSR[31:29] are valid for both divide and square root
 * operations; the configuration and status bit in CSR[5:0] are only valid for
 * divides. A memory write access of the CSR register while the module is busy during
 * a calculation causes the access to be stalled (using wait states) until the
 * calculation completes.
 */
/*!
 * @name Constants and macros for entire MMDVSQ_CSR register
 */
/*@{*/
#define MMDVSQ_RD_CSR(base)      (MMDVSQ_CSR_REG(base))
#define MMDVSQ_WR_CSR(base, value) (MMDVSQ_CSR_REG(base) = (value))
#define MMDVSQ_RMW_CSR(base, mask, value) (MMDVSQ_WR_CSR(base, (MMDVSQ_RD_CSR(base) & ~(mask)) | (value)))
#define MMDVSQ_SET_CSR(base, value) (MMDVSQ_WR_CSR(base, MMDVSQ_RD_CSR(base) |  (value)))
#define MMDVSQ_CLR_CSR(base, value) (MMDVSQ_WR_CSR(base, MMDVSQ_RD_CSR(base) & ~(value)))
#define MMDVSQ_TOG_CSR(base, value) (MMDVSQ_WR_CSR(base, MMDVSQ_RD_CSR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MMDVSQ_CSR bitfields
 */

/*!
 * @name Register MMDVSQ_CSR, field SRT[0] (WORZ)
 *
 * When written with a logical one and CSR[DFS] = 1, this flag initiates a
 * divide operation. If written as a logical one with CSR[DFS] = 0, it is ignored.
 * This bit always reads as a zero. The state of the register write data defines
 * this bit's function.
 *
 * Values:
 * - 0b0 - No operation initiated
 * - 0b1 - If CSR[DFS] = 1, then initiate a divide calculation, else ignore
 */
/*@{*/
/*! @brief Set the SRT field to a new value. */
#define MMDVSQ_WR_CSR_SRT(base, value) (MMDVSQ_RMW_CSR(base, MMDVSQ_CSR_SRT_MASK, MMDVSQ_CSR_SRT(value)))
#define MMDVSQ_BWR_CSR_SRT(base, value) (MMDVSQ_WR_CSR_SRT(base, value))
/*@}*/

/*!
 * @name Register MMDVSQ_CSR, field USGN[1] (RW)
 *
 * This indicator selects whether a signed (default) or unsigned divide is
 * performed. See the CSR[REM] description for the encoding of the four possible
 * divide operations.
 *
 * Values:
 * - 0b0 - Perform a signed divide
 * - 0b1 - Perform an unsigned divide
 */
/*@{*/
/*! @brief Read current value of the MMDVSQ_CSR_USGN field. */
#define MMDVSQ_RD_CSR_USGN(base) ((MMDVSQ_CSR_REG(base) & MMDVSQ_CSR_USGN_MASK) >> MMDVSQ_CSR_USGN_SHIFT)
#define MMDVSQ_BRD_CSR_USGN(base) (MMDVSQ_RD_CSR_USGN(base))

/*! @brief Set the USGN field to a new value. */
#define MMDVSQ_WR_CSR_USGN(base, value) (MMDVSQ_RMW_CSR(base, MMDVSQ_CSR_USGN_MASK, MMDVSQ_CSR_USGN(value)))
#define MMDVSQ_BWR_CSR_USGN(base, value) (MMDVSQ_WR_CSR_USGN(base, value))
/*@}*/

/*!
 * @name Register MMDVSQ_CSR, field REM[2] (RW)
 *
 * This indicator selects whether the quotient or the remainder is returned in
 * the RES register. The combined CSR[REM] and CSR[USGN] bits define four possible
 * divide operations: If CSR[REM, USGN] = 0b00, perform a signed divide,
 * returning the quotient If CSR[REM, USGN] = 0b01, perform an unsigned divide,
 * returning the quotient If CSR[REM, USGN] = 0b10, perform a signed divide, returning
 * the remainder If CSR[REM, USGN] = 0b11, perform an unsigned divide, returning
 * the remainder
 *
 * Values:
 * - 0b0 - Return the quotient in the RES for the divide calculation
 * - 0b1 - Return the remainder in the RES for the divide calculation
 */
/*@{*/
/*! @brief Read current value of the MMDVSQ_CSR_REM field. */
#define MMDVSQ_RD_CSR_REM(base) ((MMDVSQ_CSR_REG(base) & MMDVSQ_CSR_REM_MASK) >> MMDVSQ_CSR_REM_SHIFT)
#define MMDVSQ_BRD_CSR_REM(base) (MMDVSQ_RD_CSR_REM(base))

/*! @brief Set the REM field to a new value. */
#define MMDVSQ_WR_CSR_REM(base, value) (MMDVSQ_RMW_CSR(base, MMDVSQ_CSR_REM_MASK, MMDVSQ_CSR_REM(value)))
#define MMDVSQ_BWR_CSR_REM(base, value) (MMDVSQ_WR_CSR_REM(base, value))
/*@}*/

/*!
 * @name Register MMDVSQ_CSR, field DZE[3] (RW)
 *
 * This indicator configures the MMDVSQ's response to divide-by-zero
 * calculations. If both CSR[DZ] and CSR[DZE] are set, then a subsequent read of the RES
 * register is error terminated to signal the processor of the attempted
 * divide-by-zero.
 *
 * Values:
 * - 0b0 - Reads of the RES register return the register contents
 * - 0b1 - If CSR[DZ] = 1, an attempted read of RES register is error terminated
 *     to signal a divide-by-zero, else the register contents are returned
 */
/*@{*/
/*! @brief Read current value of the MMDVSQ_CSR_DZE field. */
#define MMDVSQ_RD_CSR_DZE(base) ((MMDVSQ_CSR_REG(base) & MMDVSQ_CSR_DZE_MASK) >> MMDVSQ_CSR_DZE_SHIFT)
#define MMDVSQ_BRD_CSR_DZE(base) (MMDVSQ_RD_CSR_DZE(base))

/*! @brief Set the DZE field to a new value. */
#define MMDVSQ_WR_CSR_DZE(base, value) (MMDVSQ_RMW_CSR(base, MMDVSQ_CSR_DZE_MASK, MMDVSQ_CSR_DZE(value)))
#define MMDVSQ_BWR_CSR_DZE(base, value) (MMDVSQ_WR_CSR_DZE(base, value))
/*@}*/

/*!
 * @name Register MMDVSQ_CSR, field DZ[4] (RO)
 *
 * This read-only status indicator signals the last divide operation had a zero
 * divisor, that is, DSOR = 0x0000_0000. For this case, RES is set to 0x0000_0000
 * and this indicator bit set. After a divide-by-zero operation, a read of the
 * RES register returns either the zero result, or, if CSR[DZE] = 1, terminates
 * the read with an error. The CSR[DZ] indicator is cleared by the hardware at the
 * beginning of each operation.
 *
 * Values:
 * - 0b0 - The last divide operation had a non-zero divisor, that is, DSOR != 0
 * - 0b1 - The last divide operation had a zero divisor, that is, DSOR = 0
 */
/*@{*/
/*! @brief Read current value of the MMDVSQ_CSR_DZ field. */
#define MMDVSQ_RD_CSR_DZ(base) ((MMDVSQ_CSR_REG(base) & MMDVSQ_CSR_DZ_MASK) >> MMDVSQ_CSR_DZ_SHIFT)
#define MMDVSQ_BRD_CSR_DZ(base) (MMDVSQ_RD_CSR_DZ(base))
/*@}*/

/*!
 * @name Register MMDVSQ_CSR, field DFS[5] (RW)
 *
 * The MMDVSQ supports 2 mechanisms for initiating a divide operation. The
 * default mechanism is a "fast start" where a write to the DSOR register begins the
 * divide. Alternatively, the start mechanism can begin after a write to the CSR
 * register with CSR[SRT] set. The CSR[DFS] indicator selects the divide start
 * mechanism.
 *
 * Values:
 * - 0b0 - A divide operation is initiated by a write to the DSOR register
 * - 0b1 - A divide operation is initiated by a write to the CSR register with
 *     CSR[SRT] = 1
 */
/*@{*/
/*! @brief Read current value of the MMDVSQ_CSR_DFS field. */
#define MMDVSQ_RD_CSR_DFS(base) ((MMDVSQ_CSR_REG(base) & MMDVSQ_CSR_DFS_MASK) >> MMDVSQ_CSR_DFS_SHIFT)
#define MMDVSQ_BRD_CSR_DFS(base) (MMDVSQ_RD_CSR_DFS(base))

/*! @brief Set the DFS field to a new value. */
#define MMDVSQ_WR_CSR_DFS(base, value) (MMDVSQ_RMW_CSR(base, MMDVSQ_CSR_DFS_MASK, MMDVSQ_CSR_DFS(value)))
#define MMDVSQ_BWR_CSR_DFS(base, value) (MMDVSQ_WR_CSR_DFS(base, value))
/*@}*/

/*!
 * @name Register MMDVSQ_CSR, field SQRT[29] (RO)
 *
 * Current or last operation was a square root. This read-only indicator bit
 * signals if the current or last operation performed by the MMDVSQ was a square
 * root.
 *
 * Values:
 * - 0b0 - Current or last MMDVSQ operation was not a square root
 * - 0b1 - Current or last MMDVSQ operation was a square root
 */
/*@{*/
/*! @brief Read current value of the MMDVSQ_CSR_SQRT field. */
#define MMDVSQ_RD_CSR_SQRT(base) ((MMDVSQ_CSR_REG(base) & MMDVSQ_CSR_SQRT_MASK) >> MMDVSQ_CSR_SQRT_SHIFT)
#define MMDVSQ_BRD_CSR_SQRT(base) (MMDVSQ_RD_CSR_SQRT(base))
/*@}*/

/*!
 * @name Register MMDVSQ_CSR, field DIV[30] (RO)
 *
 * Current or last operation was a divide. This read-only indicator bit signals
 * if the current or last operation performed by the MMDVSQ was a divide.
 *
 * Values:
 * - 0b0 - Current or last MMDVSQ operation was not a divide
 * - 0b1 - Current or last MMDVSQ operation was a divide
 */
/*@{*/
/*! @brief Read current value of the MMDVSQ_CSR_DIV field. */
#define MMDVSQ_RD_CSR_DIV(base) ((MMDVSQ_CSR_REG(base) & MMDVSQ_CSR_DIV_MASK) >> MMDVSQ_CSR_DIV_SHIFT)
#define MMDVSQ_BRD_CSR_DIV(base) (MMDVSQ_RD_CSR_DIV(base))
/*@}*/

/*!
 * @name Register MMDVSQ_CSR, field BUSY[31] (RO)
 *
 * This read-only bit is asserted when the MMDVSQ is performing a divide or
 * square root. When an operation is initiated, the hardware sets this flag. It
 * remains asserted until the operation completes and the hardware automatically
 * clears the indicator. This bit can be used to poll the DVSQ's execution status. The
 * combined CSR[BUSY, DIV, SQRT] indicators provide an encoded module status: If
 * 0b001, then MMDVSQ is idle and the last calculation was a square root If
 * 0b010, then MMDVSQ is idle and the last calculation was a divide If 0b101, then
 * MMDVSQ is busy processing a square root calculation If 0b110, then MMDVSQ is
 * busy processing a divide calculation The remaining encodings of CSR[BUSY, DIV,
 * SQRT] are reserved.
 *
 * Values:
 * - 0b0 - MMDVSQ is idle
 * - 0b1 - MMDVSQ is busy performing a divide or square root calculation
 */
/*@{*/
/*! @brief Read current value of the MMDVSQ_CSR_BUSY field. */
#define MMDVSQ_RD_CSR_BUSY(base) ((MMDVSQ_CSR_REG(base) & MMDVSQ_CSR_BUSY_MASK) >> MMDVSQ_CSR_BUSY_SHIFT)
#define MMDVSQ_BRD_CSR_BUSY(base) (MMDVSQ_RD_CSR_BUSY(base))
/*@}*/

