pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * MMDVSQ_RES - Result Register
 ******************************************************************************/

/*!
 * @brief MMDVSQ_RES - Result Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is loaded with the result of the divide or square root
 * calculation. It is updated by the MMDVSQ hardware at the completion of the
 * calculation. When a square root operation is performed (on an unsigned 32-bit number),
 * the result is limited to a 16-bit value with RES[31:16] = 0x0000. Any memory
 * access (read or write) of the RES register while the module is busy during a
 * calculation causes the access to be stalled (using wait states) until the
 * calculation completes and the new result written into the register.
 */
/*!
 * @name Constants and macros for entire MMDVSQ_RES register
 */
/*@{*/
#define MMDVSQ_RD_RES(base)      (MMDVSQ_RES_REG(base))
#define MMDVSQ_WR_RES(base, value) (MMDVSQ_RES_REG(base) = (value))
#define MMDVSQ_RMW_RES(base, mask, value) (MMDVSQ_WR_RES(base, (MMDVSQ_RD_RES(base) & ~(mask)) | (value)))
#define MMDVSQ_SET_RES(base, value) (MMDVSQ_WR_RES(base, MMDVSQ_RD_RES(base) |  (value)))
#define MMDVSQ_CLR_RES(base, value) (MMDVSQ_WR_RES(base, MMDVSQ_RD_RES(base) & ~(value)))
#define MMDVSQ_TOG_RES(base, value) (MMDVSQ_WR_RES(base, MMDVSQ_RD_RES(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * MMDVSQ_RCND - Radicand Register
 ******************************************************************************/

/*!
 * @brief MMDVSQ_RCND - Radicand Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The write-only radicand register is loaded with the input "square" number. A
 * memory write to the radicand register initiates a square root calculation.
 * While the MMDVSQ module is busy performing a square root calculation, any memory
 * write access to the RCND register causes the write access to be stalled (using
 * wait states) until the square root calculation finishes. Any attempted read
 * of the radicand register terminates with an error.
 */
/*!
 * @name Constants and macros for entire MMDVSQ_RCND register
 */
/*@{*/
#define MMDVSQ_RD_RCND(base)     (MMDVSQ_RCND_REG(base))
#define MMDVSQ_WR_RCND(base, value) (MMDVSQ_RCND_REG(base) = (value))
#define MMDVSQ_RMW_RCND(base, mask, value) (MMDVSQ_WR_RCND(base, (MMDVSQ_RD_RCND(base) & ~(mask)) | (value)))
#define MMDVSQ_SET_RCND(base, value) (MMDVSQ_WR_RCND(base, MMDVSQ_RD_RCND(base) |  (value)))
#define MMDVSQ_CLR_RCND(base, value) (MMDVSQ_WR_RCND(base, MMDVSQ_RD_RCND(base) & ~(value)))
#define MMDVSQ_TOG_RCND(base, value) (MMDVSQ_WR_RCND(base, MMDVSQ_RD_RCND(base) ^  (value)))
/*@}*/

/*
 * MKL28Z7 MSCM
 *
 * MSCM
 *
 * Registers defined in this header file:
 * - MSCM_CPxTYPE - Processor X Type Register
 * - MSCM_CPxNUM - Processor X Number Register
 * - MSCM_CPxMASTER - Processor X Master Register
 * - MSCM_CPxCOUNT - Processor X Count Register
 * - MSCM_CPxCFG - Processor X Configuration Register
 * - MSCM_CP0TYPE - Processor 0 Type Register
 * - MSCM_CP0NUM - Processor 0 Number Register
 * - MSCM_CP0MASTER - Processor 0 Master Register
 * - MSCM_CP0COUNT - Processor 0 Count Register
 * - MSCM_CP0CFG - Processor 0 Configuration Register
 * - MSCM_CP1TYPE - Processor 1 Type Register
 * - MSCM_CP1NUM - Processor 1 Number Register
 * - MSCM_CP1MASTER - Processor 1 Master Register
 * - MSCM_CP1COUNT - Processor 1 Count Register
 * - MSCM_CP1CFG - Processor 1 Configuration Register
 * - MSCM_OCMDR - On-Chip Memory Descriptor Register
 */

#define MSCM_INSTANCE_COUNT (1U) /*!< Number of instances of the MSCM module. */
#define MSCM_IDX (0U) /*!< Instance number for MSCM. */

/*******************************************************************************
 * MSCM_CPxTYPE - Processor X Type Register
 ******************************************************************************/

/*!
 * @brief MSCM_CPxTYPE - Processor X Type Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the personality of
 * the core making the access. The 32-bit response includes 3 ASCII characters
 * that define the CPU type, along with a byte that defines the logical revision
 * number. The logical revision number follows ARM's rYpZ nomenclature.
 */
/*!
 * @name Constants and macros for entire MSCM_CPxTYPE register
 */
/*@{*/
#define MSCM_RD_CPxTYPE(base)    (MSCM_CPxTYPE_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CPxTYPE bitfields
 */

/*!
 * @name Register MSCM_CPxTYPE, field RYPZ[7:0] (RO)
 *
 * This read-only field defines the processor revision for CPx: 0x00 corresponds
 * to the r0p0 core release. 0x01 corresponds to the r0p1 core release. ...
 */
/*@{*/
/*! @brief Read current value of the MSCM_CPxTYPE_RYPZ field. */
#define MSCM_RD_CPxTYPE_RYPZ(base) ((MSCM_CPxTYPE_REG(base) & MSCM_CPxTYPE_RYPZ_MASK) >> MSCM_CPxTYPE_RYPZ_SHIFT)
#define MSCM_BRD_CPxTYPE_RYPZ(base) (BME_UBFX32(&MSCM_CPxTYPE_REG(base), MSCM_CPxTYPE_RYPZ_SHIFT, MSCM_CPxTYPE_RYPZ_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CPxTYPE, field PERSONALITY[31:8] (RO)
 *
 * This read-only field defines the processor personality for CPx if CPx =
 * Cortex-M0, then PERSONALITY = 0x43_4D_30 ("CM0").
 */
/*@{*/
/*! @brief Read current value of the MSCM_CPxTYPE_PERSONALITY field. */
#define MSCM_RD_CPxTYPE_PERSONALITY(base) ((MSCM_CPxTYPE_REG(base) & MSCM_CPxTYPE_PERSONALITY_MASK) >> MSCM_CPxTYPE_PERSONALITY_SHIFT)
#define MSCM_BRD_CPxTYPE_PERSONALITY(base) (MSCM_RD_CPxTYPE_PERSONALITY(base))
/*@}*/

/*******************************************************************************
 * MSCM_CPxNUM - Processor X Number Register
 ******************************************************************************/

/*!
 * @brief MSCM_CPxNUM - Processor X Number Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the logical
 * processor number of the core making the access. The boot (or primary) core is assigned
 * the number 0, while the secondary core is defined as number 1.
 */
/*!
 * @name Constants and macros for entire MSCM_CPxNUM register
 */
/*@{*/
#define MSCM_RD_CPxNUM(base)     (MSCM_CPxNUM_REG(base))
/*@}*/

