pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * Constants & macros for individual MSCM_CPxNUM bitfields
 */

/*!
 * @name Register MSCM_CPxNUM, field CPN[0] (RO)
 *
 * This zero-filled word defines the logical processor number for CPx If boot
 * (primary) core, then CPN = 0 For secondary core, CPN = 1
 */
/*@{*/
/*! @brief Read current value of the MSCM_CPxNUM_CPN field. */
#define MSCM_RD_CPxNUM_CPN(base) ((MSCM_CPxNUM_REG(base) & MSCM_CPxNUM_CPN_MASK) >> MSCM_CPxNUM_CPN_SHIFT)
#define MSCM_BRD_CPxNUM_CPN(base) (BME_UBFX32(&MSCM_CPxNUM_REG(base), MSCM_CPxNUM_CPN_SHIFT, MSCM_CPxNUM_CPN_WIDTH))
/*@}*/

/*******************************************************************************
 * MSCM_CPxMASTER - Processor X Master Register
 ******************************************************************************/

/*!
 * @brief MSCM_CPxMASTER - Processor X Master Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the physical bus
 * master number of the core that is making the access. The 32-bit response defines
 * the physical master number for processor x. A privileged read from the CM0+
 * returns the appropriate processor information. Reads from any other bus master
 * return all zeroes. Attempted user mode or write accesses are terminated with an
 * error.
 */
/*!
 * @name Constants and macros for entire MSCM_CPxMASTER register
 */
/*@{*/
#define MSCM_RD_CPxMASTER(base)  (MSCM_CPxMASTER_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CPxMASTER bitfields
 */

/*!
 * @name Register MSCM_CPxMASTER, field PPN[5:0] (RO)
 *
 * This read-only field defines the physical port number for CoreN . For Core0,
 * PPN = 0x00 For Core1, PPN = 0x24
 */
/*@{*/
/*! @brief Read current value of the MSCM_CPxMASTER_PPN field. */
#define MSCM_RD_CPxMASTER_PPN(base) ((MSCM_CPxMASTER_REG(base) & MSCM_CPxMASTER_PPN_MASK) >> MSCM_CPxMASTER_PPN_SHIFT)
#define MSCM_BRD_CPxMASTER_PPN(base) (BME_UBFX32(&MSCM_CPxMASTER_REG(base), MSCM_CPxMASTER_PPN_SHIFT, MSCM_CPxMASTER_PPN_WIDTH))
/*@}*/

/*******************************************************************************
 * MSCM_CPxCOUNT - Processor X Count Register
 ******************************************************************************/

/*!
 * @brief MSCM_CPxCOUNT - Processor X Count Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the total number of
 * processor cores in the chip configuration.
 */
/*!
 * @name Constants and macros for entire MSCM_CPxCOUNT register
 */
/*@{*/
#define MSCM_RD_CPxCOUNT(base)   (MSCM_CPxCOUNT_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CPxCOUNT bitfields
 */

/*!
 * @name Register MSCM_CPxCOUNT, field PCNT[1:0] (RO)
 *
 * This read-only field defines the processor count for the chip configuration:
 * PCNT = 01
 */
/*@{*/
/*! @brief Read current value of the MSCM_CPxCOUNT_PCNT field. */
#define MSCM_RD_CPxCOUNT_PCNT(base) ((MSCM_CPxCOUNT_REG(base) & MSCM_CPxCOUNT_PCNT_MASK) >> MSCM_CPxCOUNT_PCNT_SHIFT)
#define MSCM_BRD_CPxCOUNT_PCNT(base) (BME_UBFX32(&MSCM_CPxCOUNT_REG(base), MSCM_CPxCOUNT_PCNT_SHIFT, MSCM_CPxCOUNT_PCNT_WIDTH))
/*@}*/

/*******************************************************************************
 * MSCM_CPxCFG - Processor X Configuration Register
 ******************************************************************************/

/*!
 * @brief MSCM_CPxCFG - Processor X Configuration Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides information on the Level 1 caches (if present).
 */
/*!
 * @name Constants and macros for entire MSCM_CPxCFG register
 */
/*@{*/
#define MSCM_RD_CPxCFG(base, index) (MSCM_CPxCFG_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual MSCM_CPxCFG bitfields
 */

/*!
 * @name Register MSCM_CPxCFG, field DCWY[7:0] (RO)
 *
 * This read-only field provides the number of cache ways for the Data Cache.
 */
/*@{*/
/*! @brief Read current value of the MSCM_CPxCFG_DCWY field. */
#define MSCM_RD_CPxCFG_DCWY(base, index) ((MSCM_CPxCFG_REG(base, index) & MSCM_CPxCFG_DCWY_MASK) >> MSCM_CPxCFG_DCWY_SHIFT)
#define MSCM_BRD_CPxCFG_DCWY(base, index) (BME_UBFX32(&MSCM_CPxCFG_REG(base, index), MSCM_CPxCFG_DCWY_SHIFT, MSCM_CPxCFG_DCWY_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CPxCFG, field DCSZ[15:8] (RO)
 *
 * This read-only field provides an encoded value of the Data Cache size. The
 * capacity of the memory is expressed as Size [bytes] = 2(8+SZ) ,where SZ is
 * non-zero; a SZ = 0 indicates the memory is not present.
 */
/*@{*/
/*! @brief Read current value of the MSCM_CPxCFG_DCSZ field. */
#define MSCM_RD_CPxCFG_DCSZ(base, index) ((MSCM_CPxCFG_REG(base, index) & MSCM_CPxCFG_DCSZ_MASK) >> MSCM_CPxCFG_DCSZ_SHIFT)
#define MSCM_BRD_CPxCFG_DCSZ(base, index) (BME_UBFX32(&MSCM_CPxCFG_REG(base, index), MSCM_CPxCFG_DCSZ_SHIFT, MSCM_CPxCFG_DCSZ_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CPxCFG, field ICWY[23:16] (RO)
 *
 * This read-only field provides the number of cache ways for the Instruction
 * Cache.
 */
/*@{*/
/*! @brief Read current value of the MSCM_CPxCFG_ICWY field. */
#define MSCM_RD_CPxCFG_ICWY(base, index) ((MSCM_CPxCFG_REG(base, index) & MSCM_CPxCFG_ICWY_MASK) >> MSCM_CPxCFG_ICWY_SHIFT)
#define MSCM_BRD_CPxCFG_ICWY(base, index) (BME_UBFX32(&MSCM_CPxCFG_REG(base, index), MSCM_CPxCFG_ICWY_SHIFT, MSCM_CPxCFG_ICWY_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CPxCFG, field ICSZ[31:24] (RO)
 *
 * This read-only field provides an encoded value of the Instruction Cache size.
 * The capacity of the memory is expressed as Size [bytes] = 2(8+SZ), where SZ
 * is non-zero; a SZ = 0 indicates the memory is not present.
 */
/*@{*/
/*! @brief Read current value of the MSCM_CPxCFG_ICSZ field. */
#define MSCM_RD_CPxCFG_ICSZ(base, index) ((MSCM_CPxCFG_REG(base, index) & MSCM_CPxCFG_ICSZ_MASK) >> MSCM_CPxCFG_ICSZ_SHIFT)
#define MSCM_BRD_CPxCFG_ICSZ(base, index) (BME_UBFX32(&MSCM_CPxCFG_REG(base, index), MSCM_CPxCFG_ICSZ_SHIFT, MSCM_CPxCFG_ICSZ_WIDTH))
/*@}*/

/*******************************************************************************
 * MSCM_CP0TYPE - Processor 0 Type Register
 ******************************************************************************/

/*!
 * @brief MSCM_CP0TYPE - Processor 0 Type Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the personality of
 * the core making the access. The 32-bit response includes 3 ASCII characters
 * defining the CPU type, along with a byte defining the logical revision number.
 * The logical revision number follows ARM's rYpZ nomenclature.
 */
/*!
 * @name Constants and macros for entire MSCM_CP0TYPE register
 */
/*@{*/
#define MSCM_RD_CP0TYPE(base)    (MSCM_CP0TYPE_REG(base))
/*@}*/

