pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * Constants & macros for individual MSCM_CP0TYPE bitfields
 */

/*!
 * @name Register MSCM_CP0TYPE, field RYPZ[7:0] (RO)
 *
 * This read-only field defines the processor revision for CPx: 0x00 corresponds
 * to the r0p0 core release. 0x01 corresponds to the r0p1 core release. ...
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP0TYPE_RYPZ field. */
#define MSCM_RD_CP0TYPE_RYPZ(base) ((MSCM_CP0TYPE_REG(base) & MSCM_CP0TYPE_RYPZ_MASK) >> MSCM_CP0TYPE_RYPZ_SHIFT)
#define MSCM_BRD_CP0TYPE_RYPZ(base) (BME_UBFX32(&MSCM_CP0TYPE_REG(base), MSCM_CP0TYPE_RYPZ_SHIFT, MSCM_CP0TYPE_RYPZ_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CP0TYPE, field PERSONALITY[31:8] (RO)
 *
 * This read-only field defines the processor personality for CPx if CPx =
 * Cortex-M0, then PERSONALITY = 0x43_4D_30 ("CM0").
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP0TYPE_PERSONALITY field. */
#define MSCM_RD_CP0TYPE_PERSONALITY(base) ((MSCM_CP0TYPE_REG(base) & MSCM_CP0TYPE_PERSONALITY_MASK) >> MSCM_CP0TYPE_PERSONALITY_SHIFT)
#define MSCM_BRD_CP0TYPE_PERSONALITY(base) (MSCM_RD_CP0TYPE_PERSONALITY(base))
/*@}*/

/*******************************************************************************
 * MSCM_CP0NUM - Processor 0 Number Register
 ******************************************************************************/

/*!
 * @brief MSCM_CP0NUM - Processor 0 Number Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the logical
 * processor number of the core making the access. The boot (or primary) core is assigned
 * the number 0, while the secondary core is defined as number 1.
 */
/*!
 * @name Constants and macros for entire MSCM_CP0NUM register
 */
/*@{*/
#define MSCM_RD_CP0NUM(base)     (MSCM_CP0NUM_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CP0NUM bitfields
 */

/*!
 * @name Register MSCM_CP0NUM, field CPN[0] (RO)
 *
 * This zero-filled word defines the logical processor number for CPx If boot
 * (primary) core, then CPN = 0 For secondary core, CPN = 1
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP0NUM_CPN field. */
#define MSCM_RD_CP0NUM_CPN(base) ((MSCM_CP0NUM_REG(base) & MSCM_CP0NUM_CPN_MASK) >> MSCM_CP0NUM_CPN_SHIFT)
#define MSCM_BRD_CP0NUM_CPN(base) (BME_UBFX32(&MSCM_CP0NUM_REG(base), MSCM_CP0NUM_CPN_SHIFT, MSCM_CP0NUM_CPN_WIDTH))
/*@}*/

/*******************************************************************************
 * MSCM_CP0MASTER - Processor 0 Master Register
 ******************************************************************************/

/*!
 * @brief MSCM_CP0MASTER - Processor 0 Master Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response, that indicates the physical
 * bus master number of the core making the access. The 32-bit response defines the
 * physical master number for processor x. A privileged read from the CM0+
 * returns the appropriate processor information. Reads from any other bus master
 * return all zeroes. Attempted user mode or write accesses are terminated with an
 * error.
 */
/*!
 * @name Constants and macros for entire MSCM_CP0MASTER register
 */
/*@{*/
#define MSCM_RD_CP0MASTER(base)  (MSCM_CP0MASTER_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CP0MASTER bitfields
 */

/*!
 * @name Register MSCM_CP0MASTER, field PPN[5:0] (RO)
 *
 * This read-only field defines the physical port number for CPUx. For CPU0, PPN
 * = 0x00 For CPU1, PPN = 0x24
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP0MASTER_PPN field. */
#define MSCM_RD_CP0MASTER_PPN(base) ((MSCM_CP0MASTER_REG(base) & MSCM_CP0MASTER_PPN_MASK) >> MSCM_CP0MASTER_PPN_SHIFT)
#define MSCM_BRD_CP0MASTER_PPN(base) (BME_UBFX32(&MSCM_CP0MASTER_REG(base), MSCM_CP0MASTER_PPN_SHIFT, MSCM_CP0MASTER_PPN_WIDTH))
/*@}*/

/*******************************************************************************
 * MSCM_CP0COUNT - Processor 0 Count Register
 ******************************************************************************/

/*!
 * @brief MSCM_CP0COUNT - Processor 0 Count Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the total number of
 * processor cores in the chip configuration.
 */
/*!
 * @name Constants and macros for entire MSCM_CP0COUNT register
 */
/*@{*/
#define MSCM_RD_CP0COUNT(base)   (MSCM_CP0COUNT_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CP0COUNT bitfields
 */

/*!
 * @name Register MSCM_CP0COUNT, field PCNT[1:0] (RO)
 *
 * This read-only field defines the processor count for the chip configuration:
 * PCNT = 01
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP0COUNT_PCNT field. */
#define MSCM_RD_CP0COUNT_PCNT(base) ((MSCM_CP0COUNT_REG(base) & MSCM_CP0COUNT_PCNT_MASK) >> MSCM_CP0COUNT_PCNT_SHIFT)
#define MSCM_BRD_CP0COUNT_PCNT(base) (BME_UBFX32(&MSCM_CP0COUNT_REG(base), MSCM_CP0COUNT_PCNT_SHIFT, MSCM_CP0COUNT_PCNT_WIDTH))
/*@}*/

/*******************************************************************************
 * MSCM_CP0CFG - Processor 0 Configuration Register
 ******************************************************************************/

/*!
 * @brief MSCM_CP0CFG - Processor 0 Configuration Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides information on the Level 1 caches (if present).
 */
/*!
 * @name Constants and macros for entire MSCM_CP0CFG register
 */
/*@{*/
#define MSCM_RD_CP0CFG(base, index) (MSCM_CP0CFG_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual MSCM_CP0CFG bitfields
 */

/*!
 * @name Register MSCM_CP0CFG, field DCWY[7:0] (RO)
 *
 * This read-only field provides the number of cache ways for the Data Cache.
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP0CFG_DCWY field. */
#define MSCM_RD_CP0CFG_DCWY(base, index) ((MSCM_CP0CFG_REG(base, index) & MSCM_CP0CFG_DCWY_MASK) >> MSCM_CP0CFG_DCWY_SHIFT)
#define MSCM_BRD_CP0CFG_DCWY(base, index) (BME_UBFX32(&MSCM_CP0CFG_REG(base, index), MSCM_CP0CFG_DCWY_SHIFT, MSCM_CP0CFG_DCWY_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CP0CFG, field DCSZ[15:8] (RO)
 *
 * This read-only field provides an encoded value of the Data Cache size. The
 * capacity of the memory is expressed as Size [bytes] = 2(8+SZ) ,where SZ is
 * non-zero; a SZ = 0 indicates the memory is not present.
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP0CFG_DCSZ field. */
#define MSCM_RD_CP0CFG_DCSZ(base, index) ((MSCM_CP0CFG_REG(base, index) & MSCM_CP0CFG_DCSZ_MASK) >> MSCM_CP0CFG_DCSZ_SHIFT)
#define MSCM_BRD_CP0CFG_DCSZ(base, index) (BME_UBFX32(&MSCM_CP0CFG_REG(base, index), MSCM_CP0CFG_DCSZ_SHIFT, MSCM_CP0CFG_DCSZ_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CP0CFG, field ICWY[23:16] (RO)
 *
 * This read-only field provides the number of cache ways for the Instruction
 * Cache.
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP0CFG_ICWY field. */
#define MSCM_RD_CP0CFG_ICWY(base, index) ((MSCM_CP0CFG_REG(base, index) & MSCM_CP0CFG_ICWY_MASK) >> MSCM_CP0CFG_ICWY_SHIFT)
#define MSCM_BRD_CP0CFG_ICWY(base, index) (BME_UBFX32(&MSCM_CP0CFG_REG(base, index), MSCM_CP0CFG_ICWY_SHIFT, MSCM_CP0CFG_ICWY_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CP0CFG, field ICSZ[31:24] (RO)
 *
 * This read-only field provides an encoded value of the Instruction Cache size.
 * The capacity of the memory is expressed as Size [bytes] = 2(8+SZ), where SZ
 * is non-zero; a SZ = 0 indicates the memory is not present.
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP0CFG_ICSZ field. */
#define MSCM_RD_CP0CFG_ICSZ(base, index) ((MSCM_CP0CFG_REG(base, index) & MSCM_CP0CFG_ICSZ_MASK) >> MSCM_CP0CFG_ICSZ_SHIFT)
#define MSCM_BRD_CP0CFG_ICSZ(base, index) (BME_UBFX32(&MSCM_CP0CFG_REG(base, index), MSCM_CP0CFG_ICSZ_SHIFT, MSCM_CP0CFG_ICSZ_WIDTH))
/*@}*/

