pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * MSCM_CP1TYPE - Processor 1 Type Register
 ******************************************************************************/

/*!
 * @brief MSCM_CP1TYPE - Processor 1 Type Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the personality of
 * the core making the access. The 32-bit response includes 3 ASCII characters
 * defining the CPU type, along with a byte defining the logical revision number.
 * The logical revision number follows ARM's rYpZ nomenclature.
 */
/*!
 * @name Constants and macros for entire MSCM_CP1TYPE register
 */
/*@{*/
#define MSCM_RD_CP1TYPE(base)    (MSCM_CP1TYPE_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CP1TYPE bitfields
 */

/*!
 * @name Register MSCM_CP1TYPE, field RYPZ[7:0] (RO)
 *
 * This read-only field defines the processor revision for CPx: 0x00 corresponds
 * to the r0p0 core release. 0x01 corresponds to the r0p1 core release. ...
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP1TYPE_RYPZ field. */
#define MSCM_RD_CP1TYPE_RYPZ(base) ((MSCM_CP1TYPE_REG(base) & MSCM_CP1TYPE_RYPZ_MASK) >> MSCM_CP1TYPE_RYPZ_SHIFT)
#define MSCM_BRD_CP1TYPE_RYPZ(base) (BME_UBFX32(&MSCM_CP1TYPE_REG(base), MSCM_CP1TYPE_RYPZ_SHIFT, MSCM_CP1TYPE_RYPZ_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CP1TYPE, field PERSONALITY[31:8] (RO)
 *
 * This read-only field defines the processor personality for CPx if CPx =
 * Cortex-M0, then PERSONALITY = 0x43_4D_30 ("CM0").
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP1TYPE_PERSONALITY field. */
#define MSCM_RD_CP1TYPE_PERSONALITY(base) ((MSCM_CP1TYPE_REG(base) & MSCM_CP1TYPE_PERSONALITY_MASK) >> MSCM_CP1TYPE_PERSONALITY_SHIFT)
#define MSCM_BRD_CP1TYPE_PERSONALITY(base) (MSCM_RD_CP1TYPE_PERSONALITY(base))
/*@}*/

/*******************************************************************************
 * MSCM_CP1NUM - Processor 1 Number Register
 ******************************************************************************/

/*!
 * @brief MSCM_CP1NUM - Processor 1 Number Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the logical
 * processor number of the core making the access. The boot (or primary) core is assigned
 * the number 0, while the secondary core is defined as number 1.
 */
/*!
 * @name Constants and macros for entire MSCM_CP1NUM register
 */
/*@{*/
#define MSCM_RD_CP1NUM(base)     (MSCM_CP1NUM_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CP1NUM bitfields
 */

/*!
 * @name Register MSCM_CP1NUM, field CPN[0] (RO)
 *
 * This zero-filled word defines the logical processor number for CPx If boot
 * (primary) core, then CPN = 0 For the secondary core, CPN = 1
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP1NUM_CPN field. */
#define MSCM_RD_CP1NUM_CPN(base) ((MSCM_CP1NUM_REG(base) & MSCM_CP1NUM_CPN_MASK) >> MSCM_CP1NUM_CPN_SHIFT)
#define MSCM_BRD_CP1NUM_CPN(base) (BME_UBFX32(&MSCM_CP1NUM_REG(base), MSCM_CP1NUM_CPN_SHIFT, MSCM_CP1NUM_CPN_WIDTH))
/*@}*/

/*******************************************************************************
 * MSCM_CP1MASTER - Processor 1 Master Register
 ******************************************************************************/

/*!
 * @brief MSCM_CP1MASTER - Processor 1 Master Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response, that indicates the physical
 * bus master number of the core making the access. The 32-bit response defines the
 * physical master number for processor x. A privileged read from the CM0+
 * returns the appropriate processor information. Reads from any other bus master
 * return all zeroes. Attempted user mode or write accesses are terminated with an
 * error.
 */
/*!
 * @name Constants and macros for entire MSCM_CP1MASTER register
 */
/*@{*/
#define MSCM_RD_CP1MASTER(base)  (MSCM_CP1MASTER_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CP1MASTER bitfields
 */

/*!
 * @name Register MSCM_CP1MASTER, field PPN[5:0] (RO)
 *
 * This read-only field defines the physical port number for CPUx. For CPU0, PPN
 * = 0x00 For CPU1, PPN = 0x24
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP1MASTER_PPN field. */
#define MSCM_RD_CP1MASTER_PPN(base) ((MSCM_CP1MASTER_REG(base) & MSCM_CP1MASTER_PPN_MASK) >> MSCM_CP1MASTER_PPN_SHIFT)
#define MSCM_BRD_CP1MASTER_PPN(base) (BME_UBFX32(&MSCM_CP1MASTER_REG(base), MSCM_CP1MASTER_PPN_SHIFT, MSCM_CP1MASTER_PPN_WIDTH))
/*@}*/

/*******************************************************************************
 * MSCM_CP1COUNT - Processor 1 Count Register
 ******************************************************************************/

/*!
 * @brief MSCM_CP1COUNT - Processor 1 Count Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the total number of
 * processor cores in the chip configuration.
 */
/*!
 * @name Constants and macros for entire MSCM_CP1COUNT register
 */
/*@{*/
#define MSCM_RD_CP1COUNT(base)   (MSCM_CP1COUNT_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CP1COUNT bitfields
 */

/*!
 * @name Register MSCM_CP1COUNT, field PCNT[1:0] (RO)
 *
 * This read-only field defines the processor count for the chip configuration:
 * PCNT = 01
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP1COUNT_PCNT field. */
#define MSCM_RD_CP1COUNT_PCNT(base) ((MSCM_CP1COUNT_REG(base) & MSCM_CP1COUNT_PCNT_MASK) >> MSCM_CP1COUNT_PCNT_SHIFT)
#define MSCM_BRD_CP1COUNT_PCNT(base) (BME_UBFX32(&MSCM_CP1COUNT_REG(base), MSCM_CP1COUNT_PCNT_SHIFT, MSCM_CP1COUNT_PCNT_WIDTH))
/*@}*/

/*******************************************************************************
 * MSCM_CP1CFG - Processor 1 Configuration Register
 ******************************************************************************/

/*!
 * @brief MSCM_CP1CFG - Processor 1 Configuration Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides information on the Level 1 caches (if present).
 */
/*!
 * @name Constants and macros for entire MSCM_CP1CFG register
 */
/*@{*/
#define MSCM_RD_CP1CFG(base, index) (MSCM_CP1CFG_REG(base, index))
/*@}*/

