pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * Constants & macros for individual MSCM_CP1CFG bitfields
 */

/*!
 * @name Register MSCM_CP1CFG, field DCWY[7:0] (RO)
 *
 * This read-only field provides the number of cache ways for the Data Cache.
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP1CFG_DCWY field. */
#define MSCM_RD_CP1CFG_DCWY(base, index) ((MSCM_CP1CFG_REG(base, index) & MSCM_CP1CFG_DCWY_MASK) >> MSCM_CP1CFG_DCWY_SHIFT)
#define MSCM_BRD_CP1CFG_DCWY(base, index) (BME_UBFX32(&MSCM_CP1CFG_REG(base, index), MSCM_CP1CFG_DCWY_SHIFT, MSCM_CP1CFG_DCWY_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CP1CFG, field DCSZ[15:8] (RO)
 *
 * This read-only field provides an encoded value of the Data Cache size. The
 * capacity of the memory is expressed as Size [bytes] = 2(8+SZ) ,where SZ is
 * non-zero; a SZ = 0 indicates the memory is not present.
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP1CFG_DCSZ field. */
#define MSCM_RD_CP1CFG_DCSZ(base, index) ((MSCM_CP1CFG_REG(base, index) & MSCM_CP1CFG_DCSZ_MASK) >> MSCM_CP1CFG_DCSZ_SHIFT)
#define MSCM_BRD_CP1CFG_DCSZ(base, index) (BME_UBFX32(&MSCM_CP1CFG_REG(base, index), MSCM_CP1CFG_DCSZ_SHIFT, MSCM_CP1CFG_DCSZ_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CP1CFG, field ICWY[23:16] (RO)
 *
 * This read-only field provides the number of cache ways for the Instruction
 * Cache.
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP1CFG_ICWY field. */
#define MSCM_RD_CP1CFG_ICWY(base, index) ((MSCM_CP1CFG_REG(base, index) & MSCM_CP1CFG_ICWY_MASK) >> MSCM_CP1CFG_ICWY_SHIFT)
#define MSCM_BRD_CP1CFG_ICWY(base, index) (BME_UBFX32(&MSCM_CP1CFG_REG(base, index), MSCM_CP1CFG_ICWY_SHIFT, MSCM_CP1CFG_ICWY_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CP1CFG, field ICSZ[31:24] (RO)
 *
 * This read-only field provides an encoded value of the Instruction Cache size.
 * The capacity of the memory is expressed as Size [bytes] = 2(8+SZ), where SZ
 * is non-zero; a SZ = 0 indicates the memory is not present.
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP1CFG_ICSZ field. */
#define MSCM_RD_CP1CFG_ICSZ(base, index) ((MSCM_CP1CFG_REG(base, index) & MSCM_CP1CFG_ICSZ_MASK) >> MSCM_CP1CFG_ICSZ_SHIFT)
#define MSCM_BRD_CP1CFG_ICSZ(base, index) (BME_UBFX32(&MSCM_CP1CFG_REG(base, index), MSCM_CP1CFG_ICSZ_SHIFT, MSCM_CP1CFG_ICSZ_WIDTH))
/*@}*/

/*******************************************************************************
 * MSCM_OCMDR - On-Chip Memory Descriptor Register
 ******************************************************************************/

/*!
 * @brief MSCM_OCMDR - On-Chip Memory Descriptor Register (RO)
 *
 * Reset value: 0x40000000U
 *
 * This section of the programming model is an array of 32-bit generic on-chip
 * memory descriptor registers that provide static information about the attached
 * memories, as well as configurable controls (where appropriate). Privileged
 * 32-bit reads from a processor core or the debugger return the appropriate
 * processor information. Reads from any other bus master return all zeroes. Privileged
 * writes from a processor core or the debugger to writeable registers update the
 * appropriate fields. Privileged writes from other bus masters are ignored.
 * Attempted user mode accesses or any access with a size other than 32 bits are
 * terminated with an error.
 */
/*!
 * @name Constants and macros for entire MSCM_OCMDR register
 */
/*@{*/
#define MSCM_RD_OCMDR(base, index) (MSCM_OCMDR_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual MSCM_OCMDR bitfields
 */

/*!
 * @name Register MSCM_OCMDR, field OCMPU[12] (RO)
 *
 * OCMEM Memory Protection Unit. This read-only field identifies a memory
 * protected by an XRDC module.
 *
 * Values:
 * - 0b0 - OCMEMn is not protected by an XRDC module.
 * - 0b1 - OCMEMn is protected by an XRDC module.
 */
/*@{*/
/*! @brief Read current value of the MSCM_OCMDR_OCMPU field. */
#define MSCM_RD_OCMDR_OCMPU(base, index) ((MSCM_OCMDR_REG(base, index) & MSCM_OCMDR_OCMPU_MASK) >> MSCM_OCMDR_OCMPU_SHIFT)
#define MSCM_BRD_OCMDR_OCMPU(base, index) (BME_UBFX32(&MSCM_OCMDR_REG(base, index), MSCM_OCMDR_OCMPU_SHIFT, MSCM_OCMDR_OCMPU_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_OCMDR, field OCMT[15:13] (RO)
 *
 * OCMEM Type. This field defines the type of the on-chip memory:
 *
 * Values:
 * - 0b000 - OCMEMn is a system RAM.
 * - 0b001 - OCMEMn is a graphics RAM.
 * - 0b010 - Reserved
 * - 0b011 - OCMEMn is a ROM.
 * - 0b100 - Reserved
 * - 0b101 - Reserved
 * - 0b110 - Reserved
 * - 0b111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the MSCM_OCMDR_OCMT field. */
#define MSCM_RD_OCMDR_OCMT(base, index) ((MSCM_OCMDR_REG(base, index) & MSCM_OCMDR_OCMT_MASK) >> MSCM_OCMDR_OCMT_SHIFT)
#define MSCM_BRD_OCMDR_OCMT(base, index) (BME_UBFX32(&MSCM_OCMDR_REG(base, index), MSCM_OCMDR_OCMT_SHIFT, MSCM_OCMDR_OCMT_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_OCMDR, field RO[16] (RO)
 *
 * Read-Only. This register bit provides a mechanism to "lock" the configuration
 * state defined by OCMDRn[11:0]. Once asserted, attempted writes to the
 * OCMDRn[11:0] register are ignored until the next reset clears the flag.
 *
 * Values:
 * - 0b0 - Writes to the OCMDRn[11:0] are allowed
 * - 0b1 - Writes to the OCMDRn[11:0] are ignored
 */
/*@{*/
/*! @brief Read current value of the MSCM_OCMDR_RO field. */
#define MSCM_RD_OCMDR_RO(base, index) ((MSCM_OCMDR_REG(base, index) & MSCM_OCMDR_RO_MASK) >> MSCM_OCMDR_RO_SHIFT)
#define MSCM_BRD_OCMDR_RO(base, index) (BME_UBFX32(&MSCM_OCMDR_REG(base, index), MSCM_OCMDR_RO_SHIFT, MSCM_OCMDR_RO_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_OCMDR, field OCMW[19:17] (RO)
 *
 * OCMEM datapath Width. This read-only field defines the width of the on-chip
 * memory:
 *
 * Values:
 * - 0b010 - OCMEMn 32-bits wide
 * - 0b011 - OCMEMn 64-bits wide
 */
/*@{*/
/*! @brief Read current value of the MSCM_OCMDR_OCMW field. */
#define MSCM_RD_OCMDR_OCMW(base, index) ((MSCM_OCMDR_REG(base, index) & MSCM_OCMDR_OCMW_MASK) >> MSCM_OCMDR_OCMW_SHIFT)
#define MSCM_BRD_OCMDR_OCMW(base, index) (BME_UBFX32(&MSCM_OCMDR_REG(base, index), MSCM_OCMDR_OCMW_SHIFT, MSCM_OCMDR_OCMW_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_OCMDR, field OCMSZ[27:24] (RO)
 *
 * OCMEM Size. This read-only field provides an encoded value of the on-chip
 * memory size. The capacity of the memory is expressed as Size [bytes] = 2(8+SZ)
 * where SZ is non-zero; a SZ = 0 indicates the memory is not present.
 *
 * Values:
 * - 0b0000 - no OCMEMn
 * - 0b0100 - 4KB OCMEMn
 * - 0b0101 - 8KB OCMEMn
 * - 0b0110 - 16KB OCMEMn
 * - 0b0111 - 32KB OCMEMn
 * - 0b1111 - 8192KB OCMEMn
 */
/*@{*/
/*! @brief Read current value of the MSCM_OCMDR_OCMSZ field. */
#define MSCM_RD_OCMDR_OCMSZ(base, index) ((MSCM_OCMDR_REG(base, index) & MSCM_OCMDR_OCMSZ_MASK) >> MSCM_OCMDR_OCMSZ_SHIFT)
#define MSCM_BRD_OCMDR_OCMSZ(base, index) (BME_UBFX32(&MSCM_OCMDR_REG(base, index), MSCM_OCMDR_OCMSZ_SHIFT, MSCM_OCMDR_OCMSZ_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_OCMDR, field OCMSZH[28] (RO)
 *
 * OCMEM Size "Hole". For on-chip memories that are not fully populated, that
 * is, include a memory "hole" in the upper 25% of the address range, this bit is
 * used.
 *
 * Values:
 * - 0b0 - OCMEMn is a power-of-2 capacity.
 * - 0b1 - OCMEMn is not a power-of-2, with a capacity is 0.75 * OCMSZ.
 */
/*@{*/
/*! @brief Read current value of the MSCM_OCMDR_OCMSZH field. */
#define MSCM_RD_OCMDR_OCMSZH(base, index) ((MSCM_OCMDR_REG(base, index) & MSCM_OCMDR_OCMSZH_MASK) >> MSCM_OCMDR_OCMSZH_SHIFT)
#define MSCM_BRD_OCMDR_OCMSZH(base, index) (BME_UBFX32(&MSCM_OCMDR_REG(base, index), MSCM_OCMDR_OCMSZH_SHIFT, MSCM_OCMDR_OCMSZH_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_OCMDR, field V[31] (RO)
 *
 * OCMEM Valid bit. This read-only field defines the validity (presence) of the
 * on-chip memory
 *
 * Values:
 * - 0b0 - OCMEMn is not present.
 * - 0b1 - OCMEMn is present.
 */
/*@{*/
/*! @brief Read current value of the MSCM_OCMDR_V field. */
#define MSCM_RD_OCMDR_V(base, index) ((MSCM_OCMDR_REG(base, index) & MSCM_OCMDR_V_MASK) >> MSCM_OCMDR_V_SHIFT)
#define MSCM_BRD_OCMDR_V(base, index) (BME_UBFX32(&MSCM_OCMDR_REG(base, index), MSCM_OCMDR_V_SHIFT, MSCM_OCMDR_V_WIDTH))
/*@}*/

