pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * MTB_PERIPHID - Peripheral ID Register
 ******************************************************************************/

/*!
 * @brief MTB_PERIPHID - Peripheral ID Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * These registers indicate the peripheral IDs. They are hardwired to specific
 * values used during the auto-discovery process by an external debug agent.
 */
/*!
 * @name Constants and macros for entire MTB_PERIPHID register
 */
/*@{*/
#define MTB_RD_PERIPHID(base, index) (MTB_PERIPHID_REG(base, index))
/*@}*/

/*******************************************************************************
 * MTB_COMPID - Component ID Register
 ******************************************************************************/

/*!
 * @brief MTB_COMPID - Component ID Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * These registers indicate the component IDs. They are hardwired to specific
 * values used during the auto-discovery process by an external debug agent.
 */
/*!
 * @name Constants and macros for entire MTB_COMPID register
 */
/*@{*/
#define MTB_RD_COMPID(base, index) (MTB_COMPID_REG(base, index))
/*@}*/

/*
 * MKL28Z7 MU
 *
 * MU
 *
 * Registers defined in this header file:
 * - MU_VER - Version ID Register
 * - MU_PAR - Parameter Register
 * - MU_TR - Transmit Register n
 * - MU_RR - Receive Register n
 * - MU_SR - Status Register
 * - MU_CR - Control Register
 */

#define MU_INSTANCE_COUNT (1U) /*!< Number of instances of the MU module. */
#define MU0_A_IDX (0U) /*!< Instance number for MU0_A. */

/*******************************************************************************
 * MU_VER - Version ID Register
 ******************************************************************************/

/*!
 * @brief MU_VER - Version ID Register (RO)
 *
 * Reset value: 0x01000000U
 *
 * Use Version ID register to determine the version ID and feature set number of
 * Processor B/A.
 */
/*!
 * @name Constants and macros for entire MU_VER register
 */
/*@{*/
#define MU_RD_VER(base)          (MU_VER_REG(base))
/*@}*/

/*
 * Constants & macros for individual MU_VER bitfields
 */

/*!
 * @name Register MU_VER, field FEATURE[15:0] (RO)
 *
 * This read only field returns the feature set number for Processor B/A.
 *
 * Values:
 * - 0b0000000000000000 - TBD
 */
/*@{*/
/*! @brief Read current value of the MU_VER_FEATURE field. */
#define MU_RD_VER_FEATURE(base) ((MU_VER_REG(base) & MU_VER_FEATURE_MASK) >> MU_VER_FEATURE_SHIFT)
#define MU_BRD_VER_FEATURE(base) (MU_RD_VER_FEATURE(base))
/*@}*/

/*!
 * @name Register MU_VER, field MINOR[23:16] (RO)
 *
 * This read only field returns the minor version number for Processor B/A.
 */
/*@{*/
/*! @brief Read current value of the MU_VER_MINOR field. */
#define MU_RD_VER_MINOR(base) ((MU_VER_REG(base) & MU_VER_MINOR_MASK) >> MU_VER_MINOR_SHIFT)
#define MU_BRD_VER_MINOR(base) (BME_UBFX32(&MU_VER_REG(base), MU_VER_MINOR_SHIFT, MU_VER_MINOR_WIDTH))
/*@}*/

/*!
 * @name Register MU_VER, field MAJOR[31:24] (RO)
 *
 * This read only field returns the major version number for Processor B/A.
 */
/*@{*/
/*! @brief Read current value of the MU_VER_MAJOR field. */
#define MU_RD_VER_MAJOR(base) ((MU_VER_REG(base) & MU_VER_MAJOR_MASK) >> MU_VER_MAJOR_SHIFT)
#define MU_BRD_VER_MAJOR(base) (BME_UBFX32(&MU_VER_REG(base), MU_VER_MAJOR_SHIFT, MU_VER_MAJOR_WIDTH))
/*@}*/

/*******************************************************************************
 * MU_PAR - Parameter Register
 ******************************************************************************/

/*!
 * @brief MU_PAR - Parameter Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * Use Parameter register to determine the parameter settings of Processor B/A.
 */
/*!
 * @name Constants and macros for entire MU_PAR register
 */
/*@{*/
#define MU_RD_PAR(base)          (MU_PAR_REG(base))
/*@}*/

/*******************************************************************************
 * MU_TR - Transmit Register n
 ******************************************************************************/

/*!
 * @brief MU_TR - Transmit Register n (RW)
 *
 * Reset value: 0x00000000U
 *
 * Use Processor A/B Transmit Register n (TRn, 32-bit, write-only) to transmit a
 * message or data to the Processor B/A. You can only write to the TRn register
 * when the TEn bit in SR register is set to "1". Reading the TRn register
 * returns all zeros.
 */
/*!
 * @name Constants and macros for entire MU_TR register
 */
/*@{*/
#define MU_RD_TR(base, index)    (MU_TR_REG(base, index))
#define MU_WR_TR(base, index, value) (MU_TR_REG(base, index) = (value))
#define MU_RMW_TR(base, index, mask, value) (MU_WR_TR(base, index, (MU_RD_TR(base, index) & ~(mask)) | (value)))
#define MU_SET_TR(base, index, value) (BME_OR32(&MU_TR_REG(base, index), (uint32_t)(value)))
#define MU_CLR_TR(base, index, value) (BME_AND32(&MU_TR_REG(base, index), (uint32_t)(~(value))))
#define MU_TOG_TR(base, index, value) (BME_XOR32(&MU_TR_REG(base, index), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * MU_RR - Receive Register n
 ******************************************************************************/

/*!
 * @brief MU_RR - Receive Register n (RO)
 *
 * Reset value: 0x00000000U
 *
 * Use Processor A/B Receive Register n (RRn, 32-bit, read-only) to receive a
 * message or data from the Processor B/A. Data written to the Processor B/A TRn
 * register is immediately reflected in the Processor A/B RRn register. You can
 * only read the RRn register when the RFn bit in the SR register is set to "1".
 * Writing to the RRn register generates an error response to the Processor A/B.
 */
/*!
 * @name Constants and macros for entire MU_RR register
 */
/*@{*/
#define MU_RD_RR(base, index)    (MU_RR_REG(base, index))
/*@}*/

/*******************************************************************************
 * MU_SR - Status Register
 ******************************************************************************/

/*!
 * @brief MU_SR - Status Register (RW)
 *
 * Reset value: 0x00F00080U
 *
 * Use the Processor A/B Status Register (SR, 32-bit, read-write) to show
 * interrupt status from the Processor B/A, general purpose flags , and to set dual
 * function control-status bits. Some dual-purpose bits are set by the MU logic, and
 * cleared by the Processor A/B-side programmer Other dual-purpose bits are set
 * by the Processor A/B-side programmer, and cleared by the MU logic.
 */
/*!
 * @name Constants and macros for entire MU_SR register
 */
/*@{*/
#define MU_RD_SR(base)           (MU_SR_REG(base))
#define MU_WR_SR(base, value)    (MU_SR_REG(base) = (value))
#define MU_RMW_SR(base, mask, value) (MU_WR_SR(base, (MU_RD_SR(base) & ~(mask)) | (value)))
#define MU_SET_SR(base, value)   (BME_OR32(&MU_SR_REG(base), (uint32_t)(value)))
#define MU_CLR_SR(base, value)   (BME_AND32(&MU_SR_REG(base), (uint32_t)(~(value))))
#define MU_TOG_SR(base, value)   (BME_XOR32(&MU_SR_REG(base), (uint32_t)(value)))
/*@}*/

