pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * Constants & macros for individual MU_SR bitfields
 */

/*!
 * @name Register MU_SR, field Fn[2:0] (RW)
 *
 * For n = {0, 1, 2} Processor A/B Side Flag n. (Read-only) Fn bit is the
 * Processor A/B side flag that reflects the values written to the Fn bit in the
 * Processor B/A control register. Every time that the Processor B/A Fn bit in the CR
 * register is written, the Processor B/A Fn bit in the CR register write event
 * updates the Fn bit after the event update latency, which is measured in terms of
 * the number of clocks of the Processor B/A and the Processor A/B.
 *
 * Values:
 * - 0b000 - Processor B/A Fn bit in the CR register is written 0 (default).
 * - 0b001 - Processor B/A Fn bit in the CR register is written 1.
 */
/*@{*/
/*! @brief Read current value of the MU_SR_Fn field. */
#define MU_RD_SR_Fn(base)    ((MU_SR_REG(base) & MU_SR_Fn_MASK) >> MU_SR_Fn_SHIFT)
#define MU_BRD_SR_Fn(base)   (BME_UBFX32(&MU_SR_REG(base), MU_SR_Fn_SHIFT, MU_SR_Fn_WIDTH))

/*! @brief Set the Fn field to a new value. */
#define MU_WR_SR_Fn(base, value) (MU_RMW_SR(base, (MU_SR_Fn_MASK | MU_SR_NMIC_MASK), MU_SR_Fn(value)))
#define MU_BWR_SR_Fn(base, value) (BME_BFI32(&MU_SR_REG(base), ((uint32_t)(value) << MU_SR_Fn_SHIFT), MU_SR_Fn_SHIFT, MU_SR_Fn_WIDTH))
/*@}*/

/*!
 * @name Register MU_SR, field NMIC[3] (W1C)
 *
 * Processor A/B Non-Maskable-Interrupt Clear. (Write-only) NMIC bit is used by
 * the Processor A/B-side MU Non-Maskable Interrupt service routine to clear the
 * non-maskable interrupt. Writing NMIC bit as "1" signals the MU to clear the
 * NMI bit in the BCR register, thus de-asserting the interrupts and enabling the
 * NMI bit to receive another interrupt. The NMIC bit is always read as "0";
 * therefore it (NMIC bit) cannot be polled. The NMIC bit can only be used as part of
 * the interrupt service routine, in which the NMIC bit should only be written as
 * "1" once. The NMIC bit is cleared when the MU resets.
 *
 * Values:
 * - 0b0 - Default
 * - 0b1 - Writing "1" clears the NMI bit in the BCR register.
 */
/*@{*/
/*! @brief Read current value of the MU_SR_NMIC field. */
#define MU_RD_SR_NMIC(base)  ((MU_SR_REG(base) & MU_SR_NMIC_MASK) >> MU_SR_NMIC_SHIFT)
#define MU_BRD_SR_NMIC(base) (BME_UBFX32(&MU_SR_REG(base), MU_SR_NMIC_SHIFT, MU_SR_NMIC_WIDTH))

/*! @brief Set the NMIC field to a new value. */
#define MU_WR_SR_NMIC(base, value) (MU_RMW_SR(base, MU_SR_NMIC_MASK, MU_SR_NMIC(value)))
#define MU_BWR_SR_NMIC(base, value) (BME_BFI32(&MU_SR_REG(base), ((uint32_t)(value) << MU_SR_NMIC_SHIFT), MU_SR_NMIC_SHIFT, MU_SR_NMIC_WIDTH))
/*@}*/

/*!
 * @name Register MU_SR, field EP[4] (RW)
 *
 * Processor A/B Side Event Pending. (Read-only) EP bit is set to "1" when the
 * Processor A/B side mechanism sends an event update request to the Processor B/A
 * side. EP bit is cleared when the event update acknowledge is received. An
 * "event" is any hardware message that is reflected in the Processor B/A SR
 * register on the Processor B/A side (for example, "transmit register 0 written").
 * During normal operations, you do not have to deal with the state of the EP bit
 * because the event update mechanism works automatically. To ensure events have
 * been posted to Processor B/A before entering STOP mode, you should verify that
 * the EP bit is cleared. If EP bit is set to "1", you should wait and continue to
 * poll it (EP bit) before entering STOP mode. Reading the Processor A/B SR
 * register (to check the EP bit) should be the last access to the MU that should be
 * performed before entering STOPor WAIT modes; otherwise, the EP bit may be set
 * by subsequent additional actions. The EP bit is cleared when the MU resets.
 *
 * Values:
 * - 0b0 - The Processor A-side event is not pending (default).
 * - 0b1 - The Processor A-side event is pending.
 */
/*@{*/
/*! @brief Read current value of the MU_SR_EP field. */
#define MU_RD_SR_EP(base)    ((MU_SR_REG(base) & MU_SR_EP_MASK) >> MU_SR_EP_SHIFT)
#define MU_BRD_SR_EP(base)   (BME_UBFX32(&MU_SR_REG(base), MU_SR_EP_SHIFT, MU_SR_EP_WIDTH))

/*! @brief Set the EP field to a new value. */
#define MU_WR_SR_EP(base, value) (MU_RMW_SR(base, (MU_SR_EP_MASK | MU_SR_NMIC_MASK), MU_SR_EP(value)))
#define MU_BWR_SR_EP(base, value) (BME_BFI32(&MU_SR_REG(base), ((uint32_t)(value) << MU_SR_EP_SHIFT), MU_SR_EP_SHIFT, MU_SR_EP_WIDTH))
/*@}*/

/*!
 * @name Register MU_SR, field PM[6:5] (RW)
 *
 * Processor B/A Power Mode. (Read-only) PM[1:0] bits indicate the Processor B/A
 * power mode. The Processor B/A Power Mode is platform-specific.
 *
 * Values:
 * - 0b00 - The Processor B/A is in Run Mode.
 * - 0b01 - The Processor B/A is in WAIT Mode.
 * - 0b10 - The Processor B/A is in STOP/VLPS Mode.
 * - 0b11 - The Processor B/A is in LLS/VLLS Mode.
 */
/*@{*/
#define MU_SR_PM_RUN                   (0U)          /*!< Bit field value for MU_SR_PM: The Processor B/A is in Run Mode. */
#define MU_SR_PM_WAIT                  (0x1U)        /*!< Bit field value for MU_SR_PM: The Processor B/A is in WAIT Mode. */
#define MU_SR_PM_STOP                  (0x2U)        /*!< Bit field value for MU_SR_PM: The Processor B/A is in STOP/VLPS Mode. */
#define MU_SR_PM_DSM                   (0x3U)        /*!< Bit field value for MU_SR_PM: The Processor B/A is in LLS/VLLS Mode. */
/*! @brief Read current value of the MU_SR_PM field. */
#define MU_RD_SR_PM(base)    ((MU_SR_REG(base) & MU_SR_PM_MASK) >> MU_SR_PM_SHIFT)
#define MU_BRD_SR_PM(base)   (BME_UBFX32(&MU_SR_REG(base), MU_SR_PM_SHIFT, MU_SR_PM_WIDTH))

/*! @brief Set the PM field to a new value. */
#define MU_WR_SR_PM(base, value) (MU_RMW_SR(base, (MU_SR_PM_MASK | MU_SR_NMIC_MASK), MU_SR_PM(value)))
#define MU_BWR_SR_PM(base, value) (BME_BFI32(&MU_SR_REG(base), ((uint32_t)(value) << MU_SR_PM_SHIFT), MU_SR_PM_SHIFT, MU_SR_PM_WIDTH))
/*@}*/

/*!
 * @name Register MU_SR, field FUP[8] (RW)
 *
 * Processor A/B Flags Update Pending. (Read-only) FUP bit is set to "1" when
 * the Processor A/B side sends a Flags Update request to the Processor B/A side. A
 * Flags Update request is generated when there is a change to the Fn[2:0] bits
 * of the Processor A/B CR register. No flag update changes are allowed while the
 * FUP bit is set to "1". Any write to the Fn[2:0] bits of the Processor A/B CR
 * register, while the FUP bit is set to "1", will not generate a Flags Update
 * event, and the Fn[2:0] bits will stay unchanged. FUP bit is cleared when this
 * Flags Update request is internally acknowledged (that the flag is updated) from
 * the MU Processor B/A side, and during MU reset.
 *
 * Values:
 * - 0b0 - No flags updated, initiated by the Processor A, in progress (default)
 * - 0b1 - Processor A/B initiated flags update, processing
 */
/*@{*/
/*! @brief Read current value of the MU_SR_FUP field. */
#define MU_RD_SR_FUP(base)   ((MU_SR_REG(base) & MU_SR_FUP_MASK) >> MU_SR_FUP_SHIFT)
#define MU_BRD_SR_FUP(base)  (BME_UBFX32(&MU_SR_REG(base), MU_SR_FUP_SHIFT, MU_SR_FUP_WIDTH))

/*! @brief Set the FUP field to a new value. */
#define MU_WR_SR_FUP(base, value) (MU_RMW_SR(base, (MU_SR_FUP_MASK | MU_SR_NMIC_MASK), MU_SR_FUP(value)))
#define MU_BWR_SR_FUP(base, value) (BME_BFI32(&MU_SR_REG(base), ((uint32_t)(value) << MU_SR_FUP_SHIFT), MU_SR_FUP_SHIFT, MU_SR_FUP_WIDTH))
/*@}*/

/*!
 * @name Register MU_SR, field TEn[23:20] (RW)
 *
 * For n = {0, 1, 2, 3} Processor A/B Transmit Register n Empty. (Read-only) The
 * TEn bit is set to "1" after the Processor B/A RRn register is read on the
 * Processor B/A side. After the TEn bit is set to "1", the TEn bit signals the
 * Processor A/B side that the Processor A/B TRn register is ready to be written on
 * the Processor A/B side, and a Transmit n interrupt is issued on the Processor
 * A/B side (if the TEn bit in the Processor A/B CR register is set to "1"). TEn
 * bit is cleared after the Processor A/B TRn register is written on the Processor
 * A/B side. TEn bit is set to "1" when the MU is reset.
 *
 * Values:
 * - 0b0000 - Processor A/B TRn register is not empty.
 * - 0b0001 - Processor A/B TRn register is empty (default).
 */
/*@{*/
/*! @brief Read current value of the MU_SR_TEn field. */
#define MU_RD_SR_TEn(base)   ((MU_SR_REG(base) & MU_SR_TEn_MASK) >> MU_SR_TEn_SHIFT)
#define MU_BRD_SR_TEn(base)  (BME_UBFX32(&MU_SR_REG(base), MU_SR_TEn_SHIFT, MU_SR_TEn_WIDTH))

/*! @brief Set the TEn field to a new value. */
#define MU_WR_SR_TEn(base, value) (MU_RMW_SR(base, (MU_SR_TEn_MASK | MU_SR_NMIC_MASK), MU_SR_TEn(value)))
#define MU_BWR_SR_TEn(base, value) (BME_BFI32(&MU_SR_REG(base), ((uint32_t)(value) << MU_SR_TEn_SHIFT), MU_SR_TEn_SHIFT, MU_SR_TEn_WIDTH))
/*@}*/

/*!
 * @name Register MU_SR, field RFn[27:24] (RW)
 *
 * For n = {0, 1, 2, 3} Processor A/B Receive Register n Full. (Read-only) The
 * RFn bit is set to "1" when the Processor B/A TRn register is written on the
 * Processor B/A side. After the RFn bit is set to "1", the RFn bit signals the
 * Processor A/B side that new data is ready to be read by the Processor A/B in the
 * Processor A/B RRn register, and a Receive n interrupt is issued on the
 * Processor A/B side (if the RIEn bit in the Processor A/B CR register has been set to
 * "1"). RFn bit is cleared when the Processor A/B RRn register is read, and when
 * the MU is reset.
 *
 * Values:
 * - 0b0000 - Processor A/B RRn register is not full (default).
 * - 0b0001 - Processor A/B RRn register has received data from Processor B/A
 *     TRn register and is ready to be read by the Processor A/B.
 */
/*@{*/
/*! @brief Read current value of the MU_SR_RFn field. */
#define MU_RD_SR_RFn(base)   ((MU_SR_REG(base) & MU_SR_RFn_MASK) >> MU_SR_RFn_SHIFT)
#define MU_BRD_SR_RFn(base)  (BME_UBFX32(&MU_SR_REG(base), MU_SR_RFn_SHIFT, MU_SR_RFn_WIDTH))

