pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the RFn field to a new value. */
#define MU_WR_SR_RFn(base, value) (MU_RMW_SR(base, (MU_SR_RFn_MASK | MU_SR_NMIC_MASK), MU_SR_RFn(value)))
#define MU_BWR_SR_RFn(base, value) (BME_BFI32(&MU_SR_REG(base), ((uint32_t)(value) << MU_SR_RFn_SHIFT), MU_SR_RFn_SHIFT, MU_SR_RFn_WIDTH))
/*@}*/

/*!
 * @name Register MU_SR, field GIPn[31:28] (RW)
 *
 * For n = {0, 1, 2, 3} Processor A/B General Interrupt Request n Pending.
 * (Read-Write) GIPn bit signals the Processor A/B that the GIRn bit in the BCR
 * register on the Processor B-side was set from "0" to "1". If the GIEn bit in the ACR
 * register is set to "1", a General Interrupt n request is issued. The GIPn bit
 * is cleared by writing it back as "1". Writing "0", or writing "1" when the
 * GIPn bit is cleared is ignored. Use this feature in the interrupt routine, where
 * the GIPn bit is cleared in order to de-assert the interrupt request source at
 * the interrupt controller. An example of a proper bit clearing sequence is:
 * clear Processor A register, set the desired bit in it (Processor A register),
 * and write it to the ASR register, thus clearing the GIPn bit. GIPn bit is
 * cleared when the MU is reset.
 *
 * Values:
 * - 0b0000 - Processor A/B general purpose interrupt n is not pending. (default)
 * - 0b0001 - Processor A/B general purpose interrupt n is pending.
 */
/*@{*/
/*! @brief Read current value of the MU_SR_GIPn field. */
#define MU_RD_SR_GIPn(base)  ((MU_SR_REG(base) & MU_SR_GIPn_MASK) >> MU_SR_GIPn_SHIFT)
#define MU_BRD_SR_GIPn(base) (BME_UBFX32(&MU_SR_REG(base), MU_SR_GIPn_SHIFT, MU_SR_GIPn_WIDTH))

/*! @brief Set the GIPn field to a new value. */
#define MU_WR_SR_GIPn(base, value) (MU_RMW_SR(base, (MU_SR_GIPn_MASK | MU_SR_NMIC_MASK), MU_SR_GIPn(value)))
#define MU_BWR_SR_GIPn(base, value) (BME_BFI32(&MU_SR_REG(base), ((uint32_t)(value) << MU_SR_GIPn_SHIFT), MU_SR_GIPn_SHIFT, MU_SR_GIPn_WIDTH))
/*@}*/

/*******************************************************************************
 * MU_CR - Control Register
 ******************************************************************************/

/*!
 * @brief MU_CR - Control Register (RW)
 *
 * Reset value: 0x00000100U
 *
 * Use the Control Register (CR, 32-bit, read-write) to enable the MU interrupts
 * on the Processor A/B-side, and trigger events and interrupts on the Processor
 * B/A-side (general purpose interrupt, flag update).
 */
/*!
 * @name Constants and macros for entire MU_CR register
 */
/*@{*/
#define MU_RD_CR(base)           (MU_CR_REG(base))
#define MU_WR_CR(base, value)    (MU_CR_REG(base) = (value))
#define MU_RMW_CR(base, mask, value) (MU_WR_CR(base, (MU_RD_CR(base) & ~(mask)) | (value)))
#define MU_SET_CR(base, value)   (BME_OR32(&MU_CR_REG(base), (uint32_t)(value)))
#define MU_CLR_CR(base, value)   (BME_AND32(&MU_CR_REG(base), (uint32_t)(~(value))))
#define MU_TOG_CR(base, value)   (BME_XOR32(&MU_CR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual MU_CR bitfields
 */

/*!
 * @name Register MU_CR, field Fn[2:0] (RW)
 *
 * For n = {0, 1, 2} Processor A/B to Processor B/A Flag n. (Read-Write) Fn bit
 * is a read-write flag that is reflected in Fn bit in the Processor B/A SR
 * register on the Processor B/A side. Fn bit is cleared when the MU resets.
 *
 * Values:
 * - 0b000 - Clears the Fn bit in the SR register.
 * - 0b001 - Sets the Fn bit in the SR register.
 */
/*@{*/
/*! @brief Read current value of the MU_CR_Fn field. */
#define MU_RD_CR_Fn(base)    ((MU_CR_REG(base) & MU_CR_Fn_MASK) >> MU_CR_Fn_SHIFT)
#define MU_BRD_CR_Fn(base)   (BME_UBFX32(&MU_CR_REG(base), MU_CR_Fn_SHIFT, MU_CR_Fn_WIDTH))

/*! @brief Set the Fn field to a new value. */
#define MU_WR_CR_Fn(base, value) (MU_RMW_CR(base, MU_CR_Fn_MASK, MU_CR_Fn(value)))
#define MU_BWR_CR_Fn(base, value) (BME_BFI32(&MU_CR_REG(base), ((uint32_t)(value) << MU_CR_Fn_SHIFT), MU_CR_Fn_SHIFT, MU_CR_Fn_WIDTH))
/*@}*/

/*!
 * @name Register MU_CR, field NMI[3] (RW)
 *
 * Processor B/A Non-maskable Interrupt. (Read-Write) When NMI bit is set to
 * "1", it initiates a Non-Maskable Interrupt to the Processor B/A. NMI bit is
 * cleared by the MU after the Processor B/A asserts the NMIC bit in the Processor B/A
 * SR register. After the NMI bit is cleared, the Processor A/B can initiate
 * another non-maskable interrupt to the Processor B/A. The NMI bit is cleared when
 * the MU resets.
 *
 * Values:
 * - 0b0 - Non-maskable interrupt is not issued to the Processor B/A by the
 *     Processor A/B (default).
 * - 0b1 - Non-maskable interrupt is issued to the Processor B/A by the
 *     Processor A/B.
 */
/*@{*/
/*! @brief Read current value of the MU_CR_NMI field. */
#define MU_RD_CR_NMI(base)   ((MU_CR_REG(base) & MU_CR_NMI_MASK) >> MU_CR_NMI_SHIFT)
#define MU_BRD_CR_NMI(base)  (BME_UBFX32(&MU_CR_REG(base), MU_CR_NMI_SHIFT, MU_CR_NMI_WIDTH))

/*! @brief Set the NMI field to a new value. */
#define MU_WR_CR_NMI(base, value) (MU_RMW_CR(base, MU_CR_NMI_MASK, MU_CR_NMI(value)))
#define MU_BWR_CR_NMI(base, value) (BME_BFI32(&MU_CR_REG(base), ((uint32_t)(value) << MU_CR_NMI_SHIFT), MU_CR_NMI_SHIFT, MU_CR_NMI_WIDTH))
/*@}*/

/*!
 * @name Register MU_CR, field MUR[5] (RW)
 *
 * Processor A MU Reset. Setting MUR bit to "1" resets both the Processor B and
 * the Processor A sides of the MU module, forcing all control and status
 * registers to return to their default values and all internal states to be cleared.
 * Before setting the MUR bit to "1", it is advisable to interrupt the Processor B
 * , because setting the MUR bit may affect the ongoing Processor B program. MUR
 * bit can only be written as "1". MUR bit is always read as "0". MUR bit is
 * cleared during the MU reset sequence. This bit is only available on the Processor
 * A side.
 *
 * Values:
 * - 0b0 - N/A. Self clearing bit (default).
 * - 0b1 - Asserts the Processor A MU reset.
 */
/*@{*/
/*! @brief Read current value of the MU_CR_MUR field. */
#define MU_RD_CR_MUR(base)   ((MU_CR_REG(base) & MU_CR_MUR_MASK) >> MU_CR_MUR_SHIFT)
#define MU_BRD_CR_MUR(base)  (BME_UBFX32(&MU_CR_REG(base), MU_CR_MUR_SHIFT, MU_CR_MUR_WIDTH))

/*! @brief Set the MUR field to a new value. */
#define MU_WR_CR_MUR(base, value) (MU_RMW_CR(base, MU_CR_MUR_MASK, MU_CR_MUR(value)))
#define MU_BWR_CR_MUR(base, value) (BME_BFI32(&MU_CR_REG(base), ((uint32_t)(value) << MU_CR_MUR_SHIFT), MU_CR_MUR_SHIFT, MU_CR_MUR_WIDTH))
/*@}*/

/*!
 * @name Register MU_CR, field BRSTH[7] (RW)
 *
 * When set, will cause Processor B to be held in reset following any reset
 * event. When cleared, allows Processor B to be released from reset. Setting this
 * bit will not force Processor B into reset. It will only hold Processor B if it
 * resets itself. This bit is only available on the Processor A side.
 *
 * Values:
 * - 0b0 - Release Processor B from reset
 * - 0b1 - Hold Processor B in reset
 */
/*@{*/
/*! @brief Read current value of the MU_CR_BRSTH field. */
#define MU_RD_CR_BRSTH(base) ((MU_CR_REG(base) & MU_CR_BRSTH_MASK) >> MU_CR_BRSTH_SHIFT)
#define MU_BRD_CR_BRSTH(base) (BME_UBFX32(&MU_CR_REG(base), MU_CR_BRSTH_SHIFT, MU_CR_BRSTH_WIDTH))

/*! @brief Set the BRSTH field to a new value. */
#define MU_WR_CR_BRSTH(base, value) (MU_RMW_CR(base, MU_CR_BRSTH_MASK, MU_CR_BRSTH(value)))
#define MU_BWR_CR_BRSTH(base, value) (BME_BFI32(&MU_CR_REG(base), ((uint32_t)(value) << MU_CR_BRSTH_SHIFT), MU_CR_BRSTH_SHIFT, MU_CR_BRSTH_WIDTH))
/*@}*/

/*!
 * @name Register MU_CR, field CLKE[8] (RW)
 *
 * When set, forces Processor B/A platform clock to remain enabled even after
 * Processor B/A has entered a stop mode. When clear, allows Processor B/A to gate
 * its platform clock whenever desired after entering a stop mode. Note that if
 * Processor A/B also enters a stop mode, then this bit is overidden to allow
 * Processor B/A to gate its platform clock.
 *
 * Values:
 * - 0b0 - Processor B/A platform clock gated when Processor B/A enters a stop
 *     mode.
 * - 0b1 - Processor B/A platform clock kept running after Processor B/A enters
 *     a stop mode, until Processor A/B also enters a stop mode.
 */
/*@{*/
/*! @brief Read current value of the MU_CR_CLKE field. */
#define MU_RD_CR_CLKE(base)  ((MU_CR_REG(base) & MU_CR_CLKE_MASK) >> MU_CR_CLKE_SHIFT)
#define MU_BRD_CR_CLKE(base) (BME_UBFX32(&MU_CR_REG(base), MU_CR_CLKE_SHIFT, MU_CR_CLKE_WIDTH))

/*! @brief Set the CLKE field to a new value. */
#define MU_WR_CR_CLKE(base, value) (MU_RMW_CR(base, MU_CR_CLKE_MASK, MU_CR_CLKE(value)))
#define MU_BWR_CR_CLKE(base, value) (BME_BFI32(&MU_CR_REG(base), ((uint32_t)(value) << MU_CR_CLKE_SHIFT), MU_CR_CLKE_SHIFT, MU_CR_CLKE_WIDTH))
/*@}*/

/*!
 * @name Register MU_CR, field BBOOT[10:9] (RW)
 *
 * Configures the boot source for Processor B. This bit is only available on the
 * Processor A side.
 *
 * Values:
 * - 0b00 - Boot from 0x0
 * - 0b01 - Boot from DMEM Base
 * - 0b10 - Boot from IMEM Base
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the MU_CR_BBOOT field. */
#define MU_RD_CR_BBOOT(base) ((MU_CR_REG(base) & MU_CR_BBOOT_MASK) >> MU_CR_BBOOT_SHIFT)
#define MU_BRD_CR_BBOOT(base) (BME_UBFX32(&MU_CR_REG(base), MU_CR_BBOOT_SHIFT, MU_CR_BBOOT_WIDTH))

/*! @brief Set the BBOOT field to a new value. */
#define MU_WR_CR_BBOOT(base, value) (MU_RMW_CR(base, MU_CR_BBOOT_MASK, MU_CR_BBOOT(value)))
#define MU_BWR_CR_BBOOT(base, value) (BME_BFI32(&MU_CR_REG(base), ((uint32_t)(value) << MU_CR_BBOOT_SHIFT), MU_CR_BBOOT_SHIFT, MU_CR_BBOOT_WIDTH))
/*@}*/

/*!
 * @name Register MU_CR, field GIRn[19:16] (RW)
 *
 * For n = {0, 1, 2, 3} Processor A/B General Purpose Interrupt Request n.
 * (Read-Write) Writing "1" to the GIRn bit sets the GIPn bit in the Processor B/A SR
 * register on the Processor B-side. If the GIEn bit in the Processor B/A CR
 * register is set to "1" on the Processor B/A side, a General Purpose Interrupt n
 * request is triggered. The GIRn bit is cleared if the GIPn bit (in the Processor
 * B/A SR register on the Processor B/A side) is cleared by writing it (GIPn bit)
 * as "1", thereby signalling the Processor A/B that the interrupt was accepted
 * (cleared by the software). The GIPn bit cannot be written as "0" on the
 * Processor A/B side. To ensure proper operations, you must verify that the GIRn bit
 * is cleared (meaning that there is no pending interrupt) before setting it (GIRn
 * bit). GIRn bit is cleared when the MU resets.
 *
 * Values:
 * - 0b0000 - Processor A/B General Interrupt n is not requested to the
 *     Processor B/A (default).
 * - 0b0001 - Processor A/B General Interrupt n is requested to the Processor
 *     B/A.
 */
/*@{*/
/*! @brief Read current value of the MU_CR_GIRn field. */
#define MU_RD_CR_GIRn(base)  ((MU_CR_REG(base) & MU_CR_GIRn_MASK) >> MU_CR_GIRn_SHIFT)
#define MU_BRD_CR_GIRn(base) (BME_UBFX32(&MU_CR_REG(base), MU_CR_GIRn_SHIFT, MU_CR_GIRn_WIDTH))

