pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the GIRn field to a new value. */
#define MU_WR_CR_GIRn(base, value) (MU_RMW_CR(base, MU_CR_GIRn_MASK, MU_CR_GIRn(value)))
#define MU_BWR_CR_GIRn(base, value) (BME_BFI32(&MU_CR_REG(base), ((uint32_t)(value) << MU_CR_GIRn_SHIFT), MU_CR_GIRn_SHIFT, MU_CR_GIRn_WIDTH))
/*@}*/

/*!
 * @name Register MU_CR, field TIEn[23:20] (RW)
 *
 * For n = {0, 1, 2, 3} Processor A/B Transmit Interrupt Enable n. (Read-Write)
 * TIEn bit enables Processor A/B Transmit Interrupt n. If TIEn bit is set to "1"
 * (enabled), then an Processor A/B Transmit Interrupt n request is issued when
 * the TEn bit in the Processor A/B SR register is set to "1". If TIEn bit is
 * cleared (disabled), then the value of the TEn bit is ignored and no Processor A/B
 * Transmit Interrupt n request will be issued. TIEn bit is cleared when the MU
 * resets.
 *
 * Values:
 * - 0b0000 - Disables Processor A/B Transmit Interrupt n. (default)
 * - 0b0001 - Enables Processor A/B Transmit Interrupt n.
 */
/*@{*/
/*! @brief Read current value of the MU_CR_TIEn field. */
#define MU_RD_CR_TIEn(base)  ((MU_CR_REG(base) & MU_CR_TIEn_MASK) >> MU_CR_TIEn_SHIFT)
#define MU_BRD_CR_TIEn(base) (BME_UBFX32(&MU_CR_REG(base), MU_CR_TIEn_SHIFT, MU_CR_TIEn_WIDTH))

/*! @brief Set the TIEn field to a new value. */
#define MU_WR_CR_TIEn(base, value) (MU_RMW_CR(base, MU_CR_TIEn_MASK, MU_CR_TIEn(value)))
#define MU_BWR_CR_TIEn(base, value) (BME_BFI32(&MU_CR_REG(base), ((uint32_t)(value) << MU_CR_TIEn_SHIFT), MU_CR_TIEn_SHIFT, MU_CR_TIEn_WIDTH))
/*@}*/

/*!
 * @name Register MU_CR, field RIEn[27:24] (RW)
 *
 * For n = {0, 1, 2, 3} Processor A/B Receive Interrupt Enable n. (Read-Write)
 * RIEn bit enables Processor A/B Receive Interrupt n. If RIEn bit is set to "1"
 * (enabled), then an Processor A/B Receive Interrupt n request is issued when the
 * RFn bit in the Processor A/B SR register is set to "1". If RIEn bit is
 * cleared (disabled), then the value of the RFn bit is ignored and no Processor A/B
 * Receive Interrupt n request will be issued. RIEn bit is cleared when the MU
 * resets.
 *
 * Values:
 * - 0b0000 - Disables Processor A/B Receive Interrupt n. (default)
 * - 0b0001 - Enables Processor A/B Receive Interrupt n.
 */
/*@{*/
/*! @brief Read current value of the MU_CR_RIEn field. */
#define MU_RD_CR_RIEn(base)  ((MU_CR_REG(base) & MU_CR_RIEn_MASK) >> MU_CR_RIEn_SHIFT)
#define MU_BRD_CR_RIEn(base) (BME_UBFX32(&MU_CR_REG(base), MU_CR_RIEn_SHIFT, MU_CR_RIEn_WIDTH))

/*! @brief Set the RIEn field to a new value. */
#define MU_WR_CR_RIEn(base, value) (MU_RMW_CR(base, MU_CR_RIEn_MASK, MU_CR_RIEn(value)))
#define MU_BWR_CR_RIEn(base, value) (BME_BFI32(&MU_CR_REG(base), ((uint32_t)(value) << MU_CR_RIEn_SHIFT), MU_CR_RIEn_SHIFT, MU_CR_RIEn_WIDTH))
/*@}*/

/*!
 * @name Register MU_CR, field GIEn[31:28] (RW)
 *
 * For n = {0, 1, 2, 3} Processor A/B General Purpose Interrupt Enable n.
 * (Read-Write) GIEn bit enables Processor A/B General Interrupt n. If GIEn bit is set
 * to "1" (enabled), then a General Interrupt n request is issued when the GIPn
 * bit in the Processor A/B SR register is set to "1". If GIEn is cleared
 * (disabled), then the value of the GIPn bit is ignored and no General Interrupt n
 * request will be issued. GIEn bit is cleared when the MU resets.
 *
 * Values:
 * - 0b0000 - Disables Processor A/B General Interrupt n. (default)
 * - 0b0001 - Enables Processor A/B General Interrupt n.
 */
/*@{*/
/*! @brief Read current value of the MU_CR_GIEn field. */
#define MU_RD_CR_GIEn(base)  ((MU_CR_REG(base) & MU_CR_GIEn_MASK) >> MU_CR_GIEn_SHIFT)
#define MU_BRD_CR_GIEn(base) (BME_UBFX32(&MU_CR_REG(base), MU_CR_GIEn_SHIFT, MU_CR_GIEn_WIDTH))

/*! @brief Set the GIEn field to a new value. */
#define MU_WR_CR_GIEn(base, value) (MU_RMW_CR(base, MU_CR_GIEn_MASK, MU_CR_GIEn(value)))
#define MU_BWR_CR_GIEn(base, value) (BME_BFI32(&MU_CR_REG(base), ((uint32_t)(value) << MU_CR_GIEn_SHIFT), MU_CR_GIEn_SHIFT, MU_CR_GIEn_WIDTH))
/*@}*/

/*
 * MKL28Z7 NV
 *
 * Flash configuration field
 *
 * Registers defined in this header file:
 * - NV_BACKKEY3 - Backdoor Comparison Key 3.
 * - NV_BACKKEY2 - Backdoor Comparison Key 2.
 * - NV_BACKKEY1 - Backdoor Comparison Key 1.
 * - NV_BACKKEY0 - Backdoor Comparison Key 0.
 * - NV_BACKKEY7 - Backdoor Comparison Key 7.
 * - NV_BACKKEY6 - Backdoor Comparison Key 6.
 * - NV_BACKKEY5 - Backdoor Comparison Key 5.
 * - NV_BACKKEY4 - Backdoor Comparison Key 4.
 * - NV_FPROT3 - Non-volatile P-Flash Protection 1 - Low Register
 * - NV_FPROT2 - Non-volatile P-Flash Protection 1 - High Register
 * - NV_FPROT1 - Non-volatile P-Flash Protection 0 - Low Register
 * - NV_FPROT0 - Non-volatile P-Flash Protection 0 - High Register
 * - NV_FSEC - Non-volatile Flash Security Register
 * - NV_FOPT - Non-volatile Flash Option Register
 */

#define NV_INSTANCE_COUNT (1U) /*!< Number of instances of the NV module. */
#define FTFA_FlashConfig_IDX (0U) /*!< Instance number for FTFA_FlashConfig. */

/*******************************************************************************
 * NV_BACKKEY3 - Backdoor Comparison Key 3.
 ******************************************************************************/

/*!
 * @brief NV_BACKKEY3 - Backdoor Comparison Key 3. (RO)
 *
 * Reset value: 0xFFU
 */
/*!
 * @name Constants and macros for entire NV_BACKKEY3 register
 */
/*@{*/
#define NV_RD_BACKKEY3(base)     (NV_BACKKEY3_REG(base))
/*@}*/

/*******************************************************************************
 * NV_BACKKEY2 - Backdoor Comparison Key 2.
 ******************************************************************************/

/*!
 * @brief NV_BACKKEY2 - Backdoor Comparison Key 2. (RO)
 *
 * Reset value: 0xFFU
 */
/*!
 * @name Constants and macros for entire NV_BACKKEY2 register
 */
/*@{*/
#define NV_RD_BACKKEY2(base)     (NV_BACKKEY2_REG(base))
/*@}*/

/*******************************************************************************
 * NV_BACKKEY1 - Backdoor Comparison Key 1.
 ******************************************************************************/

/*!
 * @brief NV_BACKKEY1 - Backdoor Comparison Key 1. (RO)
 *
 * Reset value: 0xFFU
 */
/*!
 * @name Constants and macros for entire NV_BACKKEY1 register
 */
/*@{*/
#define NV_RD_BACKKEY1(base)     (NV_BACKKEY1_REG(base))
/*@}*/

