pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * OSC_DIV - OSC_DIV
 ******************************************************************************/

/*!
 * @brief OSC_DIV - OSC_DIV (RW)
 *
 * Reset value: 0x00U
 *
 * OSC CLock divider register.
 */
/*!
 * @name Constants and macros for entire OSC_DIV register
 */
/*@{*/
#define OSC_RD_DIV(base)         (OSC_DIV_REG(base))
#define OSC_WR_DIV(base, value)  (OSC_DIV_REG(base) = (value))
#define OSC_RMW_DIV(base, mask, value) (OSC_WR_DIV(base, (OSC_RD_DIV(base) & ~(mask)) | (value)))
#define OSC_SET_DIV(base, value) (BME_OR8(&OSC_DIV_REG(base), (uint8_t)(value)))
#define OSC_CLR_DIV(base, value) (BME_AND8(&OSC_DIV_REG(base), (uint8_t)(~(value))))
#define OSC_TOG_DIV(base, value) (BME_XOR8(&OSC_DIV_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual OSC_DIV bitfields
 */

/*!
 * @name Register OSC_DIV, field ERPS[7:6] (RW)
 *
 * ERCLK prescaler. These two bits are used to divide the ERCLK output. The
 * un-divided ERCLK output is not affected by these two bits.
 *
 * Values:
 * - 0b00 - The divisor ratio is 1.
 * - 0b01 - The divisor ratio is 2.
 * - 0b10 - The divisor ratio is 4.
 * - 0b11 - The divisor ratio is 8.
 */
/*@{*/
/*! @brief Read current value of the OSC_DIV_ERPS field. */
#define OSC_RD_DIV_ERPS(base) ((OSC_DIV_REG(base) & OSC_DIV_ERPS_MASK) >> OSC_DIV_ERPS_SHIFT)
#define OSC_BRD_DIV_ERPS(base) (BME_UBFX8(&OSC_DIV_REG(base), OSC_DIV_ERPS_SHIFT, OSC_DIV_ERPS_WIDTH))

/*! @brief Set the ERPS field to a new value. */
#define OSC_WR_DIV_ERPS(base, value) (OSC_RMW_DIV(base, OSC_DIV_ERPS_MASK, OSC_DIV_ERPS(value)))
#define OSC_BWR_DIV_ERPS(base, value) (BME_BFI8(&OSC_DIV_REG(base), ((uint8_t)(value) << OSC_DIV_ERPS_SHIFT), OSC_DIV_ERPS_SHIFT, OSC_DIV_ERPS_WIDTH))
/*@}*/

/*
 * MKL28Z7 PCC
 *
 *
 *
 * Registers defined in this header file:
 * - PCC_CLKCFG - PCC CLKCFG Register
 */

#define PCC_INSTANCE_COUNT (2U) /*!< Number of instances of the PCC module. */
#define PCC0_IDX (0U) /*!< Instance number for PCC0. */
#define PCC1_IDX (1U) /*!< Instance number for PCC1. */

/*******************************************************************************
 * PCC_CLKCFG - PCC CLKCFG Register
 ******************************************************************************/

/*!
 * @brief PCC_CLKCFG - PCC CLKCFG Register (RW)
 *
 * Reset value: 0x80000000U
 */
/*!
 * @name Constants and macros for entire PCC_CLKCFG register
 */
/*@{*/
#define PCC_RD_CLKCFG(base, index) (PCC_CLKCFG_REG(base, index))
#define PCC_WR_CLKCFG(base, index, value) (PCC_CLKCFG_REG(base, index) = (value))
#define PCC_RMW_CLKCFG(base, index, mask, value) (PCC_WR_CLKCFG(base, index, (PCC_RD_CLKCFG(base, index) & ~(mask)) | (value)))
#define PCC_SET_CLKCFG(base, index, value) (BME_OR32(&PCC_CLKCFG_REG(base, index), (uint32_t)(value)))
#define PCC_CLR_CLKCFG(base, index, value) (BME_AND32(&PCC_CLKCFG_REG(base, index), (uint32_t)(~(value))))
#define PCC_TOG_CLKCFG(base, index, value) (BME_XOR32(&PCC_CLKCFG_REG(base, index), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PCC_CLKCFG bitfields
 */

/*!
 * @name Register PCC_CLKCFG, field PCD[2:0] (RW)
 *
 * This read/write bit field is used for peripherals that require a clock
 * divider. At SOC integration, each peripheral is assigned either a divider or not.
 *
 * Values:
 * - 0b000 - Divide by 1 (pass-through, no clock divide).
 * - 0b001 - Divide by 2.
 * - 0b010 - Divide by 3.
 * - 0b011 - Divide by 4.
 * - 0b100 - Divide by 5.
 * - 0b101 - Divide by 6.
 * - 0b110 - Divide by 7.
 * - 0b111 - Divide by 8.
 */
/*@{*/
/*! @brief Read current value of the PCC_CLKCFG_PCD field. */
#define PCC_RD_CLKCFG_PCD(base, index) ((PCC_CLKCFG_REG(base, index) & PCC_CLKCFG_PCD_MASK) >> PCC_CLKCFG_PCD_SHIFT)
#define PCC_BRD_CLKCFG_PCD(base, index) (BME_UBFX32(&PCC_CLKCFG_REG(base, index), PCC_CLKCFG_PCD_SHIFT, PCC_CLKCFG_PCD_WIDTH))

/*! @brief Set the PCD field to a new value. */
#define PCC_WR_CLKCFG_PCD(base, index, value) (PCC_RMW_CLKCFG(base, index, PCC_CLKCFG_PCD_MASK, PCC_CLKCFG_PCD(value)))
#define PCC_BWR_CLKCFG_PCD(base, index, value) (BME_BFI32(&PCC_CLKCFG_REG(base, index), ((uint32_t)(value) << PCC_CLKCFG_PCD_SHIFT), PCC_CLKCFG_PCD_SHIFT, PCC_CLKCFG_PCD_WIDTH))
/*@}*/

/*!
 * @name Register PCC_CLKCFG, field FRAC[3] (RW)
 *
 * This read/write bit field sets the fraction multiply value for the fractional
 * clock divider used as a clock source. Divider output clock = Divider input
 * clock x [(FRAC+1)/(DIV+1)].
 *
 * Values:
 * - 0b0 - Fractional value is 0.
 * - 0b1 - Fractional value is 1.
 */
/*@{*/
/*! @brief Read current value of the PCC_CLKCFG_FRAC field. */
#define PCC_RD_CLKCFG_FRAC(base, index) ((PCC_CLKCFG_REG(base, index) & PCC_CLKCFG_FRAC_MASK) >> PCC_CLKCFG_FRAC_SHIFT)
#define PCC_BRD_CLKCFG_FRAC(base, index) (BME_UBFX32(&PCC_CLKCFG_REG(base, index), PCC_CLKCFG_FRAC_SHIFT, PCC_CLKCFG_FRAC_WIDTH))

/*! @brief Set the FRAC field to a new value. */
#define PCC_WR_CLKCFG_FRAC(base, index, value) (PCC_RMW_CLKCFG(base, index, PCC_CLKCFG_FRAC_MASK, PCC_CLKCFG_FRAC(value)))
#define PCC_BWR_CLKCFG_FRAC(base, index, value) (BME_BFI32(&PCC_CLKCFG_REG(base, index), ((uint32_t)(value) << PCC_CLKCFG_FRAC_SHIFT), PCC_CLKCFG_FRAC_SHIFT, PCC_CLKCFG_FRAC_WIDTH))
/*@}*/

/*!
 * @name Register PCC_CLKCFG, field PCS[26:24] (RW)
 *
 * This read/write bit field is used for peripherals that support various clock
 * selections.
 *
 * Values:
 * - 0b000 - Clock is off (or test clock is enabled).
 * - 0b001 - OSCCLK - System Oscillator Bus Clock(scg_sosc_slow_clk).
 * - 0b010 - SCGIRCLK - Slow IRC Clock(scg_sirc_slow_clk), (maximum is 8MHz).
 * - 0b011 - SCGFIRCLK - Fast IRC Clock(scg_firc_slow_clk), (maximum is 48MHz).
 * - 0b100 - Reserved.
 * - 0b101 - Reserved.
 * - 0b110 - SCGPCLK System PLL clock (scg_spll_slow_clk).
 * - 0b111 - Reserved.
 */
/*@{*/
/*! @brief Read current value of the PCC_CLKCFG_PCS field. */
#define PCC_RD_CLKCFG_PCS(base, index) ((PCC_CLKCFG_REG(base, index) & PCC_CLKCFG_PCS_MASK) >> PCC_CLKCFG_PCS_SHIFT)
#define PCC_BRD_CLKCFG_PCS(base, index) (BME_UBFX32(&PCC_CLKCFG_REG(base, index), PCC_CLKCFG_PCS_SHIFT, PCC_CLKCFG_PCS_WIDTH))

/*! @brief Set the PCS field to a new value. */
#define PCC_WR_CLKCFG_PCS(base, index, value) (PCC_RMW_CLKCFG(base, index, PCC_CLKCFG_PCS_MASK, PCC_CLKCFG_PCS(value)))
#define PCC_BWR_CLKCFG_PCS(base, index, value) (BME_BFI32(&PCC_CLKCFG_REG(base, index), ((uint32_t)(value) << PCC_CLKCFG_PCS_SHIFT), PCC_CLKCFG_PCS_SHIFT, PCC_CLKCFG_PCS_WIDTH))
/*@}*/

/*!
 * @name Register PCC_CLKCFG, field INUSE[29] (RO)
 *
 * This read-only bit shows that this peripheral is already in use by another
 * core. That is, software on another core has already configured the clocking
 * options of this peripheral. For example, if CPU0 software has set this
 * peripheral's CGC bit first, it sees the INUSE bit as cleared. However, if software on
 * another core has set this peripheral's CGC bit first, CPU0 software sees the
 * INUSE bit as set.
 *
 * Values:
 * - 0b0 - Another core is not using this peripheral.
 * - 0b1 - Another core is using this peripheral. Software cannot modify the
 *     existing clocking configuration.
 */
/*@{*/
/*! @brief Read current value of the PCC_CLKCFG_INUSE field. */
#define PCC_RD_CLKCFG_INUSE(base, index) ((PCC_CLKCFG_REG(base, index) & PCC_CLKCFG_INUSE_MASK) >> PCC_CLKCFG_INUSE_SHIFT)
#define PCC_BRD_CLKCFG_INUSE(base, index) (BME_UBFX32(&PCC_CLKCFG_REG(base, index), PCC_CLKCFG_INUSE_SHIFT, PCC_CLKCFG_INUSE_WIDTH))
/*@}*/

/*!
 * @name Register PCC_CLKCFG, field CGC[30] (RW)
 *
 * This read/write bit enables the clock for the peripheral.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the PCC_CLKCFG_CGC field. */
#define PCC_RD_CLKCFG_CGC(base, index) ((PCC_CLKCFG_REG(base, index) & PCC_CLKCFG_CGC_MASK) >> PCC_CLKCFG_CGC_SHIFT)
#define PCC_BRD_CLKCFG_CGC(base, index) (BME_UBFX32(&PCC_CLKCFG_REG(base, index), PCC_CLKCFG_CGC_SHIFT, PCC_CLKCFG_CGC_WIDTH))

