pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the CGC field to a new value. */
#define PCC_WR_CLKCFG_CGC(base, index, value) (PCC_RMW_CLKCFG(base, index, PCC_CLKCFG_CGC_MASK, PCC_CLKCFG_CGC(value)))
#define PCC_BWR_CLKCFG_CGC(base, index, value) (BME_BFI32(&PCC_CLKCFG_REG(base, index), ((uint32_t)(value) << PCC_CLKCFG_CGC_SHIFT), PCC_CLKCFG_CGC_SHIFT, PCC_CLKCFG_CGC_WIDTH))
/*@}*/

/*!
 * @name Register PCC_CLKCFG, field PR[31] (RO)
 *
 * This bit shows whether the peripheral is present on this device.
 *
 * Values:
 * - 0b0 - Peripheral is not present.
 * - 0b1 - Peripheral is present.
 */
/*@{*/
/*! @brief Read current value of the PCC_CLKCFG_PR field. */
#define PCC_RD_CLKCFG_PR(base, index) ((PCC_CLKCFG_REG(base, index) & PCC_CLKCFG_PR_MASK) >> PCC_CLKCFG_PR_SHIFT)
#define PCC_BRD_CLKCFG_PR(base, index) (BME_UBFX32(&PCC_CLKCFG_REG(base, index), PCC_CLKCFG_PR_SHIFT, PCC_CLKCFG_PR_WIDTH))
/*@}*/

/*
 * MKL28Z7 PMC
 *
 * Power Management Controller
 *
 * Registers defined in this header file:
 * - PMC_VERID - Version ID register
 * - PMC_PARAM - Parameter register
 * - PMC_LVDSC1 - Low Voltage Detect Status And Control 1 register
 * - PMC_LVDSC2 - Low Voltage Detect Status And Control 2 register
 * - PMC_REGSC - Regulator Status And Control register
 * - PMC_HVDSC1 - High Voltage Detect Status And Control 1 register
 */

#define PMC_INSTANCE_COUNT (1U) /*!< Number of instances of the PMC module. */
#define PMC_IDX (0U) /*!< Instance number for PMC. */

/*******************************************************************************
 * PMC_VERID - Version ID register
 ******************************************************************************/

/*!
 * @brief PMC_VERID - Version ID register (RO)
 *
 * Reset value: 0x04000000U
 */
/*!
 * @name Constants and macros for entire PMC_VERID register
 */
/*@{*/
#define PMC_RD_VERID(base)       (PMC_VERID_REG(base))
/*@}*/

/*
 * Constants & macros for individual PMC_VERID bitfields
 */

/*!
 * @name Register PMC_VERID, field FEATURE[15:0] (RO)
 *
 * This read only field returns the feature set number.
 *
 * Values:
 * - 0b0000000000000000 - Standard features implemented
 */
/*@{*/
/*! @brief Read current value of the PMC_VERID_FEATURE field. */
#define PMC_RD_VERID_FEATURE(base) ((PMC_VERID_REG(base) & PMC_VERID_FEATURE_MASK) >> PMC_VERID_FEATURE_SHIFT)
#define PMC_BRD_VERID_FEATURE(base) (PMC_RD_VERID_FEATURE(base))
/*@}*/

/*!
 * @name Register PMC_VERID, field MINOR[23:16] (RO)
 *
 * This read only field returns the minor version number for the module
 * specification.
 */
/*@{*/
/*! @brief Read current value of the PMC_VERID_MINOR field. */
#define PMC_RD_VERID_MINOR(base) ((PMC_VERID_REG(base) & PMC_VERID_MINOR_MASK) >> PMC_VERID_MINOR_SHIFT)
#define PMC_BRD_VERID_MINOR(base) (BME_UBFX32(&PMC_VERID_REG(base), PMC_VERID_MINOR_SHIFT, PMC_VERID_MINOR_WIDTH))
/*@}*/

/*!
 * @name Register PMC_VERID, field MAJOR[31:24] (RO)
 *
 * This read only field returns the major version number for the module
 * specification.
 */
/*@{*/
/*! @brief Read current value of the PMC_VERID_MAJOR field. */
#define PMC_RD_VERID_MAJOR(base) ((PMC_VERID_REG(base) & PMC_VERID_MAJOR_MASK) >> PMC_VERID_MAJOR_SHIFT)
#define PMC_BRD_VERID_MAJOR(base) (BME_UBFX32(&PMC_VERID_REG(base), PMC_VERID_MAJOR_SHIFT, PMC_VERID_MAJOR_WIDTH))
/*@}*/

/*******************************************************************************
 * PMC_PARAM - Parameter register
 ******************************************************************************/

/*!
 * @brief PMC_PARAM - Parameter register (RO)
 *
 * Reset value: 0x00000003U
 */
/*!
 * @name Constants and macros for entire PMC_PARAM register
 */
/*@{*/
#define PMC_RD_PARAM(base)       (PMC_PARAM_REG(base))
/*@}*/

/*
 * Constants & macros for individual PMC_PARAM bitfields
 */

/*!
 * @name Register PMC_PARAM, field VLPOE[0] (RO)
 *
 * If set, indicates support for VLPO bit is enabled in the PMC_REGSC register.
 */
/*@{*/
/*! @brief Read current value of the PMC_PARAM_VLPOE field. */
#define PMC_RD_PARAM_VLPOE(base) ((PMC_PARAM_REG(base) & PMC_PARAM_VLPOE_MASK) >> PMC_PARAM_VLPOE_SHIFT)
#define PMC_BRD_PARAM_VLPOE(base) (BME_UBFX32(&PMC_PARAM_REG(base), PMC_PARAM_VLPOE_SHIFT, PMC_PARAM_VLPOE_WIDTH))
/*@}*/

/*!
 * @name Register PMC_PARAM, field HVDE[1] (RO)
 *
 * If set, indicates support for High Voltage Detect is enabled.
 */
/*@{*/
/*! @brief Read current value of the PMC_PARAM_HVDE field. */
#define PMC_RD_PARAM_HVDE(base) ((PMC_PARAM_REG(base) & PMC_PARAM_HVDE_MASK) >> PMC_PARAM_HVDE_SHIFT)
#define PMC_BRD_PARAM_HVDE(base) (BME_UBFX32(&PMC_PARAM_REG(base), PMC_PARAM_HVDE_SHIFT, PMC_PARAM_HVDE_WIDTH))
/*@}*/

/*******************************************************************************
 * PMC_LVDSC1 - Low Voltage Detect Status And Control 1 register
 ******************************************************************************/

/*!
 * @brief PMC_LVDSC1 - Low Voltage Detect Status And Control 1 register (RW)
 *
 * Reset value: 0x00000010U
 *
 * This register contains status and control bits to support the low voltage
 * detect function. This register should be written during the reset initialization
 * program to set the desired controls even if the desired settings are the same
 * as the reset settings. While the device is in the very low power or low
 * leakage modes, the LVD system is disabled regardless of LVDSC1 settings. To protect
 * systems that must have LVD always on, configure the Power Mode Protection
 * (PMPROT) register of the SMC module (SMC_PMPROT) to disallow any very low power or
 * low leakage modes from being enabled. See the device's data sheet for the
 * exact LVD trip voltages. The LVDV bits are reset solely on a POR Only event. The
 * register's other bits are reset on Chip Reset Not VLLS. For more information
 * about these reset types, refer to the Reset section details.
 */
/*!
 * @name Constants and macros for entire PMC_LVDSC1 register
 */
/*@{*/
#define PMC_RD_LVDSC1(base)      (PMC_LVDSC1_REG(base))
#define PMC_WR_LVDSC1(base, value) (PMC_LVDSC1_REG(base) = (value))
#define PMC_RMW_LVDSC1(base, mask, value) (PMC_WR_LVDSC1(base, (PMC_RD_LVDSC1(base) & ~(mask)) | (value)))
#define PMC_SET_LVDSC1(base, value) (BME_OR32(&PMC_LVDSC1_REG(base), (uint32_t)(value)))
#define PMC_CLR_LVDSC1(base, value) (BME_AND32(&PMC_LVDSC1_REG(base), (uint32_t)(~(value))))
#define PMC_TOG_LVDSC1(base, value) (BME_XOR32(&PMC_LVDSC1_REG(base), (uint32_t)(value)))
/*@}*/

