pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * Constants & macros for individual PORT_GICHR bitfields
 */

/*!
 * @name Register PORT_GICHR, field GIWE[15:0] (WORZ)
 *
 * Selects which Pin Control Registers (31 through 16) bits [31:16] update with
 * the value in GIWD.
 *
 * Values:
 * - 0b0000000000000000 - Corresponding Pin Control Register is not updated with
 *     the value in GPWD.
 * - 0b0000000000000001 - Corresponding Pin Control Register is updated with the
 *     value in GPWD.
 */
/*@{*/
/*! @brief Set the GIWE field to a new value. */
#define PORT_WR_GICHR_GIWE(base, value) (PORT_RMW_GICHR(base, PORT_GICHR_GIWE_MASK, PORT_GICHR_GIWE(value)))
#define PORT_BWR_GICHR_GIWE(base, value) (PORT_WR_GICHR_GIWE(base, value))
/*@}*/

/*!
 * @name Register PORT_GICHR, field GIWD[31:16] (WORZ)
 *
 * Write value that is written to all Pin Control Registers bits [31:16] that
 * are selected by GIWE.
 */
/*@{*/
/*! @brief Set the GIWD field to a new value. */
#define PORT_WR_GICHR_GIWD(base, value) (PORT_RMW_GICHR(base, PORT_GICHR_GIWD_MASK, PORT_GICHR_GIWD(value)))
#define PORT_BWR_GICHR_GIWD(base, value) (PORT_WR_GICHR_GIWD(base, value))
/*@}*/

/*******************************************************************************
 * PORT_ISFR - Interrupt Status Flag Register
 ******************************************************************************/

/*!
 * @brief PORT_ISFR - Interrupt Status Flag Register (W1C)
 *
 * Reset value: 0x00000000U
 *
 * The pin interrupt configuration is valid in all digital pin muxing modes. The
 * Interrupt Status Flag for each pin is also visible in the corresponding Pin
 * Control Register, and each flag can be cleared in either location.
 */
/*!
 * @name Constants and macros for entire PORT_ISFR register
 */
/*@{*/
#define PORT_RD_ISFR(base)       (PORT_ISFR_REG(base))
#define PORT_WR_ISFR(base, value) (PORT_ISFR_REG(base) = (value))
#define PORT_RMW_ISFR(base, mask, value) (PORT_WR_ISFR(base, (PORT_RD_ISFR(base) & ~(mask)) | (value)))
#define PORT_SET_ISFR(base, value) (BME_OR32(&PORT_ISFR_REG(base), (uint32_t)(value)))
#define PORT_CLR_ISFR(base, value) (BME_AND32(&PORT_ISFR_REG(base), (uint32_t)(~(value))))
#define PORT_TOG_ISFR(base, value) (BME_XOR32(&PORT_ISFR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * MKL28Z7 RCM
 *
 * Reset Control Module
 *
 * Registers defined in this header file:
 * - RCM_VERID - Version ID Register
 * - RCM_PARAM - Parameter Register
 * - RCM_SRS - System Reset Status Register
 * - RCM_RPC - Reset Pin Control register
 * - RCM_MR - Mode Register
 * - RCM_FM - Force Mode Register
 * - RCM_SSRS - Sticky System Reset Status Register
 * - RCM_SRIE - System Reset Interrupt Enable Register
 */

#define RCM_INSTANCE_COUNT (1U) /*!< Number of instances of the RCM module. */
#define RCM_IDX (0U) /*!< Instance number for RCM. */

/*******************************************************************************
 * RCM_VERID - Version ID Register
 ******************************************************************************/

/*!
 * @brief RCM_VERID - Version ID Register (RO)
 *
 * Reset value: 0x03000003U
 */
/*!
 * @name Constants and macros for entire RCM_VERID register
 */
/*@{*/
#define RCM_RD_VERID(base)       (RCM_VERID_REG(base))
/*@}*/

/*
 * Constants & macros for individual RCM_VERID bitfields
 */

/*!
 * @name Register RCM_VERID, field FEATURE[15:0] (RO)
 *
 * This read only field returns the feature set number.
 *
 * Values:
 * - 0b0000000000000011 - Standard feature set.
 */
/*@{*/
/*! @brief Read current value of the RCM_VERID_FEATURE field. */
#define RCM_RD_VERID_FEATURE(base) ((RCM_VERID_REG(base) & RCM_VERID_FEATURE_MASK) >> RCM_VERID_FEATURE_SHIFT)
#define RCM_BRD_VERID_FEATURE(base) (RCM_RD_VERID_FEATURE(base))
/*@}*/

/*!
 * @name Register RCM_VERID, field MINOR[23:16] (RO)
 *
 * This read only field returns the minor version number for the specification.
 */
/*@{*/
/*! @brief Read current value of the RCM_VERID_MINOR field. */
#define RCM_RD_VERID_MINOR(base) ((RCM_VERID_REG(base) & RCM_VERID_MINOR_MASK) >> RCM_VERID_MINOR_SHIFT)
#define RCM_BRD_VERID_MINOR(base) (BME_UBFX32(&RCM_VERID_REG(base), RCM_VERID_MINOR_SHIFT, RCM_VERID_MINOR_WIDTH))
/*@}*/

/*!
 * @name Register RCM_VERID, field MAJOR[31:24] (RO)
 *
 * This read only field returns the major version number for the specification.
 */
/*@{*/
/*! @brief Read current value of the RCM_VERID_MAJOR field. */
#define RCM_RD_VERID_MAJOR(base) ((RCM_VERID_REG(base) & RCM_VERID_MAJOR_MASK) >> RCM_VERID_MAJOR_SHIFT)
#define RCM_BRD_VERID_MAJOR(base) (BME_UBFX32(&RCM_VERID_REG(base), RCM_VERID_MAJOR_SHIFT, RCM_VERID_MAJOR_WIDTH))
/*@}*/

/*******************************************************************************
 * RCM_PARAM - Parameter Register
 ******************************************************************************/

/*!
 * @brief RCM_PARAM - Parameter Register (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire RCM_PARAM register
 */
/*@{*/
#define RCM_RD_PARAM(base)       (RCM_PARAM_REG(base))
/*@}*/

/*******************************************************************************
 * RCM_SRS - System Reset Status Register
 ******************************************************************************/

/*!
 * @brief RCM_SRS - System Reset Status Register (RO)
 *
 * Reset value: 0x00000082U
 *
 * This register includes read-only status flags to indicate the source of the
 * most recent reset. The reset state of these bits depends on what caused the MCU
 * to reset. The reset value of this register depends on the reset source: POR
 * (including LVD) - 0x82 LVD (without POR) - 0x02 VLLS mode wakeup due to RESET
 * pin assertion - 0x41 VLLS mode wakeup due to other wakeup sources - 0x01 Other
 * reset - a bit is set if its corresponding reset source caused the reset
 */
/*!
 * @name Constants and macros for entire RCM_SRS register
 */
/*@{*/
#define RCM_RD_SRS(base)         (RCM_SRS_REG(base))
/*@}*/

/*
 * Constants & macros for individual RCM_SRS bitfields
 */

/*!
 * @name Register RCM_SRS, field WAKEUP[0] (RO)
 *
 * Indicates a reset has been caused by a wakeup from VLLS mode.
 *
 * Values:
 * - 0b0 - Reset not caused by wakeup from VLLS mode.
 * - 0b1 - Reset caused by wakeup from VLLS mode.
 */
/*@{*/
/*! @brief Read current value of the RCM_SRS_WAKEUP field. */
#define RCM_RD_SRS_WAKEUP(base) ((RCM_SRS_REG(base) & RCM_SRS_WAKEUP_MASK) >> RCM_SRS_WAKEUP_SHIFT)
#define RCM_BRD_SRS_WAKEUP(base) (BME_UBFX32(&RCM_SRS_REG(base), RCM_SRS_WAKEUP_SHIFT, RCM_SRS_WAKEUP_WIDTH))
/*@}*/

/*!
 * @name Register RCM_SRS, field LVD[1] (RO)
 *
 * If PMC_LVDSC1[LVDRE] is set and the supply drops below the LVD trip voltage,
 * an LVD reset occurs. If PMC_HVDSC1[HVDRE] is set and the supply rises above
 * the HVD trip voltage, an HVD reset occurs. This field is also set by POR.
 *
 * Values:
 * - 0b0 - Reset not caused by LVD trip, HVD trip or POR
 * - 0b1 - Reset caused by LVD trip, HVD trip or POR
 */
/*@{*/
/*! @brief Read current value of the RCM_SRS_LVD field. */
#define RCM_RD_SRS_LVD(base) ((RCM_SRS_REG(base) & RCM_SRS_LVD_MASK) >> RCM_SRS_LVD_SHIFT)
#define RCM_BRD_SRS_LVD(base) (BME_UBFX32(&RCM_SRS_REG(base), RCM_SRS_LVD_SHIFT, RCM_SRS_LVD_WIDTH))
/*@}*/

/*!
 * @name Register RCM_SRS, field LOC[2] (RO)
 *
 * Indicates a reset has been caused by a loss of external clock. The SCG clock
 * monitor must be enabled for a loss of clock to be detected. Refer to the
 * detailed SCG description for information on enabling the clock monitor.
 *
 * Values:
 * - 0b0 - Reset not caused by a loss of external clock.
 * - 0b1 - Reset caused by a loss of external clock.
 */
/*@{*/
/*! @brief Read current value of the RCM_SRS_LOC field. */
#define RCM_RD_SRS_LOC(base) ((RCM_SRS_REG(base) & RCM_SRS_LOC_MASK) >> RCM_SRS_LOC_SHIFT)
#define RCM_BRD_SRS_LOC(base) (BME_UBFX32(&RCM_SRS_REG(base), RCM_SRS_LOC_SHIFT, RCM_SRS_LOC_WIDTH))
/*@}*/

/*!
 * @name Register RCM_SRS, field LOL[3] (RO)
 *
 * Indicates a reset has been caused by a loss of lock/clock in the SCG PLL.
 *
 * Values:
 * - 0b0 - Reset not caused by a loss of lock in the PLL
 * - 0b1 - Reset caused by a loss of lock in the PLL
 */
/*@{*/
/*! @brief Read current value of the RCM_SRS_LOL field. */
#define RCM_RD_SRS_LOL(base) ((RCM_SRS_REG(base) & RCM_SRS_LOL_MASK) >> RCM_SRS_LOL_SHIFT)
#define RCM_BRD_SRS_LOL(base) (BME_UBFX32(&RCM_SRS_REG(base), RCM_SRS_LOL_SHIFT, RCM_SRS_LOL_WIDTH))
/*@}*/

/*!
 * @name Register RCM_SRS, field WDOG[5] (RO)
 *
 * Indicates a reset has been caused by the watchdog timer timing out. This
 * reset source can be blocked by disabling the watchdog.
 *
 * Values:
 * - 0b0 - Reset not caused by watchdog timeout
 * - 0b1 - Reset caused by watchdog timeout
 */
/*@{*/
/*! @brief Read current value of the RCM_SRS_WDOG field. */
#define RCM_RD_SRS_WDOG(base) ((RCM_SRS_REG(base) & RCM_SRS_WDOG_MASK) >> RCM_SRS_WDOG_SHIFT)
#define RCM_BRD_SRS_WDOG(base) (BME_UBFX32(&RCM_SRS_REG(base), RCM_SRS_WDOG_SHIFT, RCM_SRS_WDOG_WIDTH))
/*@}*/

/*!
 * @name Register RCM_SRS, field PIN[6] (RO)
 *
 * Indicates a reset has been caused by an active-low level on the external
 * RESET (RESET_b) pin.
 *
 * Values:
 * - 0b0 - Reset not caused by external reset pin
 * - 0b1 - Reset caused by external reset pin
 */
/*@{*/
/*! @brief Read current value of the RCM_SRS_PIN field. */
#define RCM_RD_SRS_PIN(base) ((RCM_SRS_REG(base) & RCM_SRS_PIN_MASK) >> RCM_SRS_PIN_SHIFT)
#define RCM_BRD_SRS_PIN(base) (BME_UBFX32(&RCM_SRS_REG(base), RCM_SRS_PIN_SHIFT, RCM_SRS_PIN_WIDTH))
/*@}*/

/*!
 * @name Register RCM_SRS, field POR[7] (RO)
 *
 * Indicates a reset has been caused by the power-on detection logic. Because
 * the internal supply voltage was ramping up at the time, the low-voltage reset
 * (LVD) status bit is also set to indicate that the reset occurred while the
 * internal supply was below the LVD threshold.
 *
 * Values:
 * - 0b0 - Reset not caused by POR
 * - 0b1 - Reset caused by POR
 */
/*@{*/
/*! @brief Read current value of the RCM_SRS_POR field. */
#define RCM_RD_SRS_POR(base) ((RCM_SRS_REG(base) & RCM_SRS_POR_MASK) >> RCM_SRS_POR_SHIFT)
#define RCM_BRD_SRS_POR(base) (BME_UBFX32(&RCM_SRS_REG(base), RCM_SRS_POR_SHIFT, RCM_SRS_POR_WIDTH))
/*@}*/

/*!
 * @name Register RCM_SRS, field LOCKUP[9] (RO)
 *
 * Indicates a reset has been caused by the ARM core indication of a LOCKUP
 * event.
 *
 * Values:
 * - 0b0 - Reset not caused by core LOCKUP event
 * - 0b1 - Reset caused by core LOCKUP event
 */
/*@{*/
/*! @brief Read current value of the RCM_SRS_LOCKUP field. */
#define RCM_RD_SRS_LOCKUP(base) ((RCM_SRS_REG(base) & RCM_SRS_LOCKUP_MASK) >> RCM_SRS_LOCKUP_SHIFT)
#define RCM_BRD_SRS_LOCKUP(base) (BME_UBFX32(&RCM_SRS_REG(base), RCM_SRS_LOCKUP_SHIFT, RCM_SRS_LOCKUP_WIDTH))
/*@}*/

/*!
 * @name Register RCM_SRS, field SW[10] (RO)
 *
 * Indicates a reset has been caused by software setting of SYSRESETREQ bit in
 * Application Interrupt and Reset Control Register in the ARM core. no
 * SYSRESETREQ bit in CM4 TRM ?
 *
 * Values:
 * - 0b0 - Reset not caused by software setting of SYSRESETREQ bit
 * - 0b1 - Reset caused by software setting of SYSRESETREQ bit
 */
/*@{*/
/*! @brief Read current value of the RCM_SRS_SW field. */
#define RCM_RD_SRS_SW(base)  ((RCM_SRS_REG(base) & RCM_SRS_SW_MASK) >> RCM_SRS_SW_SHIFT)
#define RCM_BRD_SRS_SW(base) (BME_UBFX32(&RCM_SRS_REG(base), RCM_SRS_SW_SHIFT, RCM_SRS_SW_WIDTH))
/*@}*/

/*!
 * @name Register RCM_SRS, field SACKERR[13] (RO)
 *
 * Indicates that after an attempt to enter Stop mode, a reset has been caused
 * by a failure of one or more peripherals to acknowledge within approximately one
 * second to enter stop mode.
 *
 * Values:
 * - 0b0 - Reset not caused by peripheral failure to acknowledge attempt to
 *     enter stop mode
 * - 0b1 - Reset caused by peripheral failure to acknowledge attempt to enter
 *     stop mode
 */
/*@{*/
/*! @brief Read current value of the RCM_SRS_SACKERR field. */
#define RCM_RD_SRS_SACKERR(base) ((RCM_SRS_REG(base) & RCM_SRS_SACKERR_MASK) >> RCM_SRS_SACKERR_SHIFT)
#define RCM_BRD_SRS_SACKERR(base) (BME_UBFX32(&RCM_SRS_REG(base), RCM_SRS_SACKERR_SHIFT, RCM_SRS_SACKERR_WIDTH))
/*@}*/

/*!
 * @name Register RCM_SRS, field CORE1[16] (RO)
 *
 * Comes from WDOG1 watchdog timeout.
 *
 * Values:
 * - 0b0 - Reset not caused by Core 1 Reset Source.
 * - 0b1 - Reset caused by Core 1 Reset Source.
 */
/*@{*/
/*! @brief Read current value of the RCM_SRS_CORE1 field. */
#define RCM_RD_SRS_CORE1(base) ((RCM_SRS_REG(base) & RCM_SRS_CORE1_MASK) >> RCM_SRS_CORE1_SHIFT)
#define RCM_BRD_SRS_CORE1(base) (BME_UBFX32(&RCM_SRS_REG(base), RCM_SRS_CORE1_SHIFT, RCM_SRS_CORE1_WIDTH))
/*@}*/

