pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the SLOL field to a new value. */
#define RCM_WR_SSRS_SLOL(base, value) (RCM_RMW_SSRS(base, (RCM_SSRS_SLOL_MASK | RCM_SSRS_SWAKEUP_MASK | RCM_SSRS_SLVD_MASK | RCM_SSRS_SLOC_MASK | RCM_SSRS_SWDOG_MASK | RCM_SSRS_SPIN_MASK | RCM_SSRS_SPOR_MASK | RCM_SSRS_SLOCKUP_MASK | RCM_SSRS_SSW_MASK | RCM_SSRS_SSACKERR_MASK | RCM_SSRS_SCORE1_MASK), RCM_SSRS_SLOL(value)))
#define RCM_BWR_SSRS_SLOL(base, value) (BME_BFI32(&RCM_SSRS_REG(base), ((uint32_t)(value) << RCM_SSRS_SLOL_SHIFT), RCM_SSRS_SLOL_SHIFT, RCM_SSRS_SLOL_WIDTH))
/*@}*/

/*!
 * @name Register RCM_SSRS, field SWDOG[5] (W1C)
 *
 * Indicates a reset has been caused by the watchdog timer timing out. This
 * reset source can be blocked by disabling the watchdog.
 *
 * Values:
 * - 0b0 - Reset not caused by watchdog timeout
 * - 0b1 - Reset caused by watchdog timeout
 */
/*@{*/
/*! @brief Read current value of the RCM_SSRS_SWDOG field. */
#define RCM_RD_SSRS_SWDOG(base) ((RCM_SSRS_REG(base) & RCM_SSRS_SWDOG_MASK) >> RCM_SSRS_SWDOG_SHIFT)
#define RCM_BRD_SSRS_SWDOG(base) (BME_UBFX32(&RCM_SSRS_REG(base), RCM_SSRS_SWDOG_SHIFT, RCM_SSRS_SWDOG_WIDTH))

/*! @brief Set the SWDOG field to a new value. */
#define RCM_WR_SSRS_SWDOG(base, value) (RCM_RMW_SSRS(base, (RCM_SSRS_SWDOG_MASK | RCM_SSRS_SWAKEUP_MASK | RCM_SSRS_SLVD_MASK | RCM_SSRS_SLOC_MASK | RCM_SSRS_SLOL_MASK | RCM_SSRS_SPIN_MASK | RCM_SSRS_SPOR_MASK | RCM_SSRS_SLOCKUP_MASK | RCM_SSRS_SSW_MASK | RCM_SSRS_SSACKERR_MASK | RCM_SSRS_SCORE1_MASK), RCM_SSRS_SWDOG(value)))
#define RCM_BWR_SSRS_SWDOG(base, value) (BME_BFI32(&RCM_SSRS_REG(base), ((uint32_t)(value) << RCM_SSRS_SWDOG_SHIFT), RCM_SSRS_SWDOG_SHIFT, RCM_SSRS_SWDOG_WIDTH))
/*@}*/

/*!
 * @name Register RCM_SSRS, field SPIN[6] (W1C)
 *
 * Indicates a reset has been caused by an active-low level on the external
 * RESET (RESET_b) pin.
 *
 * Values:
 * - 0b0 - Reset not caused by external reset pin
 * - 0b1 - Reset caused by external reset pin
 */
/*@{*/
/*! @brief Read current value of the RCM_SSRS_SPIN field. */
#define RCM_RD_SSRS_SPIN(base) ((RCM_SSRS_REG(base) & RCM_SSRS_SPIN_MASK) >> RCM_SSRS_SPIN_SHIFT)
#define RCM_BRD_SSRS_SPIN(base) (BME_UBFX32(&RCM_SSRS_REG(base), RCM_SSRS_SPIN_SHIFT, RCM_SSRS_SPIN_WIDTH))

/*! @brief Set the SPIN field to a new value. */
#define RCM_WR_SSRS_SPIN(base, value) (RCM_RMW_SSRS(base, (RCM_SSRS_SPIN_MASK | RCM_SSRS_SWAKEUP_MASK | RCM_SSRS_SLVD_MASK | RCM_SSRS_SLOC_MASK | RCM_SSRS_SLOL_MASK | RCM_SSRS_SWDOG_MASK | RCM_SSRS_SPOR_MASK | RCM_SSRS_SLOCKUP_MASK | RCM_SSRS_SSW_MASK | RCM_SSRS_SSACKERR_MASK | RCM_SSRS_SCORE1_MASK), RCM_SSRS_SPIN(value)))
#define RCM_BWR_SSRS_SPIN(base, value) (BME_BFI32(&RCM_SSRS_REG(base), ((uint32_t)(value) << RCM_SSRS_SPIN_SHIFT), RCM_SSRS_SPIN_SHIFT, RCM_SSRS_SPIN_WIDTH))
/*@}*/

/*!
 * @name Register RCM_SSRS, field SPOR[7] (W1C)
 *
 * Indicates a reset has been caused by the power-on detection logic. Because
 * the internal supply voltage was ramping up at the time, the low-voltage reset
 * (LVD) status bit is also set to indicate that the reset occurred while the
 * internal supply was below the LVD threshold.
 *
 * Values:
 * - 0b0 - Reset not caused by POR
 * - 0b1 - Reset caused by POR
 */
/*@{*/
/*! @brief Read current value of the RCM_SSRS_SPOR field. */
#define RCM_RD_SSRS_SPOR(base) ((RCM_SSRS_REG(base) & RCM_SSRS_SPOR_MASK) >> RCM_SSRS_SPOR_SHIFT)
#define RCM_BRD_SSRS_SPOR(base) (BME_UBFX32(&RCM_SSRS_REG(base), RCM_SSRS_SPOR_SHIFT, RCM_SSRS_SPOR_WIDTH))

/*! @brief Set the SPOR field to a new value. */
#define RCM_WR_SSRS_SPOR(base, value) (RCM_RMW_SSRS(base, (RCM_SSRS_SPOR_MASK | RCM_SSRS_SWAKEUP_MASK | RCM_SSRS_SLVD_MASK | RCM_SSRS_SLOC_MASK | RCM_SSRS_SLOL_MASK | RCM_SSRS_SWDOG_MASK | RCM_SSRS_SPIN_MASK | RCM_SSRS_SLOCKUP_MASK | RCM_SSRS_SSW_MASK | RCM_SSRS_SSACKERR_MASK | RCM_SSRS_SCORE1_MASK), RCM_SSRS_SPOR(value)))
#define RCM_BWR_SSRS_SPOR(base, value) (BME_BFI32(&RCM_SSRS_REG(base), ((uint32_t)(value) << RCM_SSRS_SPOR_SHIFT), RCM_SSRS_SPOR_SHIFT, RCM_SSRS_SPOR_WIDTH))
/*@}*/

/*!
 * @name Register RCM_SSRS, field SLOCKUP[9] (W1C)
 *
 * Indicates a reset has been caused by the ARM core indication of a LOCKUP
 * event.
 *
 * Values:
 * - 0b0 - Reset not caused by core LOCKUP event
 * - 0b1 - Reset caused by core LOCKUP event
 */
/*@{*/
/*! @brief Read current value of the RCM_SSRS_SLOCKUP field. */
#define RCM_RD_SSRS_SLOCKUP(base) ((RCM_SSRS_REG(base) & RCM_SSRS_SLOCKUP_MASK) >> RCM_SSRS_SLOCKUP_SHIFT)
#define RCM_BRD_SSRS_SLOCKUP(base) (BME_UBFX32(&RCM_SSRS_REG(base), RCM_SSRS_SLOCKUP_SHIFT, RCM_SSRS_SLOCKUP_WIDTH))

/*! @brief Set the SLOCKUP field to a new value. */
#define RCM_WR_SSRS_SLOCKUP(base, value) (RCM_RMW_SSRS(base, (RCM_SSRS_SLOCKUP_MASK | RCM_SSRS_SWAKEUP_MASK | RCM_SSRS_SLVD_MASK | RCM_SSRS_SLOC_MASK | RCM_SSRS_SLOL_MASK | RCM_SSRS_SWDOG_MASK | RCM_SSRS_SPIN_MASK | RCM_SSRS_SPOR_MASK | RCM_SSRS_SSW_MASK | RCM_SSRS_SSACKERR_MASK | RCM_SSRS_SCORE1_MASK), RCM_SSRS_SLOCKUP(value)))
#define RCM_BWR_SSRS_SLOCKUP(base, value) (BME_BFI32(&RCM_SSRS_REG(base), ((uint32_t)(value) << RCM_SSRS_SLOCKUP_SHIFT), RCM_SSRS_SLOCKUP_SHIFT, RCM_SSRS_SLOCKUP_WIDTH))
/*@}*/

/*!
 * @name Register RCM_SSRS, field SSW[10] (W1C)
 *
 * Indicates a reset has been caused by software setting of SYSRESETREQ bit in
 * Application Interrupt and Reset Control Register in the ARM core. no
 * SYSRESETREQ bit in CM4 TRM ?
 *
 * Values:
 * - 0b0 - Reset not caused by software setting of SYSRESETREQ bit
 * - 0b1 - Reset caused by software setting of SYSRESETREQ bit
 */
/*@{*/
/*! @brief Read current value of the RCM_SSRS_SSW field. */
#define RCM_RD_SSRS_SSW(base) ((RCM_SSRS_REG(base) & RCM_SSRS_SSW_MASK) >> RCM_SSRS_SSW_SHIFT)
#define RCM_BRD_SSRS_SSW(base) (BME_UBFX32(&RCM_SSRS_REG(base), RCM_SSRS_SSW_SHIFT, RCM_SSRS_SSW_WIDTH))

/*! @brief Set the SSW field to a new value. */
#define RCM_WR_SSRS_SSW(base, value) (RCM_RMW_SSRS(base, (RCM_SSRS_SSW_MASK | RCM_SSRS_SWAKEUP_MASK | RCM_SSRS_SLVD_MASK | RCM_SSRS_SLOC_MASK | RCM_SSRS_SLOL_MASK | RCM_SSRS_SWDOG_MASK | RCM_SSRS_SPIN_MASK | RCM_SSRS_SPOR_MASK | RCM_SSRS_SLOCKUP_MASK | RCM_SSRS_SSACKERR_MASK | RCM_SSRS_SCORE1_MASK), RCM_SSRS_SSW(value)))
#define RCM_BWR_SSRS_SSW(base, value) (BME_BFI32(&RCM_SSRS_REG(base), ((uint32_t)(value) << RCM_SSRS_SSW_SHIFT), RCM_SSRS_SSW_SHIFT, RCM_SSRS_SSW_WIDTH))
/*@}*/

/*!
 * @name Register RCM_SSRS, field SSACKERR[13] (W1C)
 *
 * Indicates that after an attempt to enter Stop mode, a reset has been caused
 * by a failure of one or more peripherals to acknowledge within approximately one
 * second to enter stop mode.
 *
 * Values:
 * - 0b0 - Reset not caused by peripheral failure to acknowledge attempt to
 *     enter stop mode
 * - 0b1 - Reset caused by peripheral failure to acknowledge attempt to enter
 *     stop mode
 */
/*@{*/
/*! @brief Read current value of the RCM_SSRS_SSACKERR field. */
#define RCM_RD_SSRS_SSACKERR(base) ((RCM_SSRS_REG(base) & RCM_SSRS_SSACKERR_MASK) >> RCM_SSRS_SSACKERR_SHIFT)
#define RCM_BRD_SSRS_SSACKERR(base) (BME_UBFX32(&RCM_SSRS_REG(base), RCM_SSRS_SSACKERR_SHIFT, RCM_SSRS_SSACKERR_WIDTH))

/*! @brief Set the SSACKERR field to a new value. */
#define RCM_WR_SSRS_SSACKERR(base, value) (RCM_RMW_SSRS(base, (RCM_SSRS_SSACKERR_MASK | RCM_SSRS_SWAKEUP_MASK | RCM_SSRS_SLVD_MASK | RCM_SSRS_SLOC_MASK | RCM_SSRS_SLOL_MASK | RCM_SSRS_SWDOG_MASK | RCM_SSRS_SPIN_MASK | RCM_SSRS_SPOR_MASK | RCM_SSRS_SLOCKUP_MASK | RCM_SSRS_SSW_MASK | RCM_SSRS_SCORE1_MASK), RCM_SSRS_SSACKERR(value)))
#define RCM_BWR_SSRS_SSACKERR(base, value) (BME_BFI32(&RCM_SSRS_REG(base), ((uint32_t)(value) << RCM_SSRS_SSACKERR_SHIFT), RCM_SSRS_SSACKERR_SHIFT, RCM_SSRS_SSACKERR_WIDTH))
/*@}*/

/*!
 * @name Register RCM_SSRS, field SCORE1[16] (W1C)
 *
 * Values:
 * - 0b0 - Reset not caused by Core 1 Reset Source.
 * - 0b1 - Reset caused by Core 1 Reset Source.
 */
/*@{*/
/*! @brief Read current value of the RCM_SSRS_SCORE1 field. */
#define RCM_RD_SSRS_SCORE1(base) ((RCM_SSRS_REG(base) & RCM_SSRS_SCORE1_MASK) >> RCM_SSRS_SCORE1_SHIFT)
#define RCM_BRD_SSRS_SCORE1(base) (BME_UBFX32(&RCM_SSRS_REG(base), RCM_SSRS_SCORE1_SHIFT, RCM_SSRS_SCORE1_WIDTH))

/*! @brief Set the SCORE1 field to a new value. */
#define RCM_WR_SSRS_SCORE1(base, value) (RCM_RMW_SSRS(base, (RCM_SSRS_SCORE1_MASK | RCM_SSRS_SWAKEUP_MASK | RCM_SSRS_SLVD_MASK | RCM_SSRS_SLOC_MASK | RCM_SSRS_SLOL_MASK | RCM_SSRS_SWDOG_MASK | RCM_SSRS_SPIN_MASK | RCM_SSRS_SPOR_MASK | RCM_SSRS_SLOCKUP_MASK | RCM_SSRS_SSW_MASK | RCM_SSRS_SSACKERR_MASK), RCM_SSRS_SCORE1(value)))
#define RCM_BWR_SSRS_SCORE1(base, value) (BME_BFI32(&RCM_SSRS_REG(base), ((uint32_t)(value) << RCM_SSRS_SCORE1_SHIFT), RCM_SSRS_SCORE1_SHIFT, RCM_SSRS_SCORE1_WIDTH))
/*@}*/

