pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * RCM_SRIE - System Reset Interrupt Enable Register
 ******************************************************************************/

/*!
 * @brief RCM_SRIE - System Reset Interrupt Enable Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This registers delays the assertion of a system reset for a period of time
 * (DELAY field) while an interrupt is generated. This allows software to perform a
 * graceful shutdown. A Chip POR source cannot be delayed by this feature, and
 * entering Stop mode will terminate the delay. The SRS will only update after the
 * system reset occurs.
 */
/*!
 * @name Constants and macros for entire RCM_SRIE register
 */
/*@{*/
#define RCM_RD_SRIE(base)        (RCM_SRIE_REG(base))
#define RCM_WR_SRIE(base, value) (RCM_SRIE_REG(base) = (value))
#define RCM_RMW_SRIE(base, mask, value) (RCM_WR_SRIE(base, (RCM_RD_SRIE(base) & ~(mask)) | (value)))
#define RCM_SET_SRIE(base, value) (BME_OR32(&RCM_SRIE_REG(base), (uint32_t)(value)))
#define RCM_CLR_SRIE(base, value) (BME_AND32(&RCM_SRIE_REG(base), (uint32_t)(~(value))))
#define RCM_TOG_SRIE(base, value) (BME_XOR32(&RCM_SRIE_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual RCM_SRIE bitfields
 */

/*!
 * @name Register RCM_SRIE, field DELAY[1:0] (RW)
 *
 * Configures the maximum reset delay time from when the interrupt is asserted
 * and the system reset occurs.
 *
 * Values:
 * - 0b00 - 8 LPO cycles
 * - 0b01 - 32 LPO cycles
 * - 0b10 - 128 LPO cycles
 * - 0b11 - 512 LPO cycles
 */
/*@{*/
/*! @brief Read current value of the RCM_SRIE_DELAY field. */
#define RCM_RD_SRIE_DELAY(base) ((RCM_SRIE_REG(base) & RCM_SRIE_DELAY_MASK) >> RCM_SRIE_DELAY_SHIFT)
#define RCM_BRD_SRIE_DELAY(base) (BME_UBFX32(&RCM_SRIE_REG(base), RCM_SRIE_DELAY_SHIFT, RCM_SRIE_DELAY_WIDTH))

/*! @brief Set the DELAY field to a new value. */
#define RCM_WR_SRIE_DELAY(base, value) (RCM_RMW_SRIE(base, RCM_SRIE_DELAY_MASK, RCM_SRIE_DELAY(value)))
#define RCM_BWR_SRIE_DELAY(base, value) (BME_BFI32(&RCM_SRIE_REG(base), ((uint32_t)(value) << RCM_SRIE_DELAY_SHIFT), RCM_SRIE_DELAY_SHIFT, RCM_SRIE_DELAY_WIDTH))
/*@}*/

/*!
 * @name Register RCM_SRIE, field LOC[2] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the RCM_SRIE_LOC field. */
#define RCM_RD_SRIE_LOC(base) ((RCM_SRIE_REG(base) & RCM_SRIE_LOC_MASK) >> RCM_SRIE_LOC_SHIFT)
#define RCM_BRD_SRIE_LOC(base) (BME_UBFX32(&RCM_SRIE_REG(base), RCM_SRIE_LOC_SHIFT, RCM_SRIE_LOC_WIDTH))

/*! @brief Set the LOC field to a new value. */
#define RCM_WR_SRIE_LOC(base, value) (RCM_RMW_SRIE(base, RCM_SRIE_LOC_MASK, RCM_SRIE_LOC(value)))
#define RCM_BWR_SRIE_LOC(base, value) (BME_BFI32(&RCM_SRIE_REG(base), ((uint32_t)(value) << RCM_SRIE_LOC_SHIFT), RCM_SRIE_LOC_SHIFT, RCM_SRIE_LOC_WIDTH))
/*@}*/

/*!
 * @name Register RCM_SRIE, field LOL[3] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the RCM_SRIE_LOL field. */
#define RCM_RD_SRIE_LOL(base) ((RCM_SRIE_REG(base) & RCM_SRIE_LOL_MASK) >> RCM_SRIE_LOL_SHIFT)
#define RCM_BRD_SRIE_LOL(base) (BME_UBFX32(&RCM_SRIE_REG(base), RCM_SRIE_LOL_SHIFT, RCM_SRIE_LOL_WIDTH))

/*! @brief Set the LOL field to a new value. */
#define RCM_WR_SRIE_LOL(base, value) (RCM_RMW_SRIE(base, RCM_SRIE_LOL_MASK, RCM_SRIE_LOL(value)))
#define RCM_BWR_SRIE_LOL(base, value) (BME_BFI32(&RCM_SRIE_REG(base), ((uint32_t)(value) << RCM_SRIE_LOL_SHIFT), RCM_SRIE_LOL_SHIFT, RCM_SRIE_LOL_WIDTH))
/*@}*/

/*!
 * @name Register RCM_SRIE, field WDOG[5] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the RCM_SRIE_WDOG field. */
#define RCM_RD_SRIE_WDOG(base) ((RCM_SRIE_REG(base) & RCM_SRIE_WDOG_MASK) >> RCM_SRIE_WDOG_SHIFT)
#define RCM_BRD_SRIE_WDOG(base) (BME_UBFX32(&RCM_SRIE_REG(base), RCM_SRIE_WDOG_SHIFT, RCM_SRIE_WDOG_WIDTH))

/*! @brief Set the WDOG field to a new value. */
#define RCM_WR_SRIE_WDOG(base, value) (RCM_RMW_SRIE(base, RCM_SRIE_WDOG_MASK, RCM_SRIE_WDOG(value)))
#define RCM_BWR_SRIE_WDOG(base, value) (BME_BFI32(&RCM_SRIE_REG(base), ((uint32_t)(value) << RCM_SRIE_WDOG_SHIFT), RCM_SRIE_WDOG_SHIFT, RCM_SRIE_WDOG_WIDTH))
/*@}*/

/*!
 * @name Register RCM_SRIE, field PIN[6] (RW)
 *
 * Values:
 * - 0b0 - Reset not caused by external reset pin
 * - 0b1 - Reset caused by external reset pin
 */
/*@{*/
/*! @brief Read current value of the RCM_SRIE_PIN field. */
#define RCM_RD_SRIE_PIN(base) ((RCM_SRIE_REG(base) & RCM_SRIE_PIN_MASK) >> RCM_SRIE_PIN_SHIFT)
#define RCM_BRD_SRIE_PIN(base) (BME_UBFX32(&RCM_SRIE_REG(base), RCM_SRIE_PIN_SHIFT, RCM_SRIE_PIN_WIDTH))

/*! @brief Set the PIN field to a new value. */
#define RCM_WR_SRIE_PIN(base, value) (RCM_RMW_SRIE(base, RCM_SRIE_PIN_MASK, RCM_SRIE_PIN(value)))
#define RCM_BWR_SRIE_PIN(base, value) (BME_BFI32(&RCM_SRIE_REG(base), ((uint32_t)(value) << RCM_SRIE_PIN_SHIFT), RCM_SRIE_PIN_SHIFT, RCM_SRIE_PIN_WIDTH))
/*@}*/

/*!
 * @name Register RCM_SRIE, field GIE[7] (RW)
 *
 * Values:
 * - 0b0 - All interrupt sources disabled.
 * - 0b1 - All interrupt sources enabled.
 */
/*@{*/
/*! @brief Read current value of the RCM_SRIE_GIE field. */
#define RCM_RD_SRIE_GIE(base) ((RCM_SRIE_REG(base) & RCM_SRIE_GIE_MASK) >> RCM_SRIE_GIE_SHIFT)
#define RCM_BRD_SRIE_GIE(base) (BME_UBFX32(&RCM_SRIE_REG(base), RCM_SRIE_GIE_SHIFT, RCM_SRIE_GIE_WIDTH))

/*! @brief Set the GIE field to a new value. */
#define RCM_WR_SRIE_GIE(base, value) (RCM_RMW_SRIE(base, RCM_SRIE_GIE_MASK, RCM_SRIE_GIE(value)))
#define RCM_BWR_SRIE_GIE(base, value) (BME_BFI32(&RCM_SRIE_REG(base), ((uint32_t)(value) << RCM_SRIE_GIE_SHIFT), RCM_SRIE_GIE_SHIFT, RCM_SRIE_GIE_WIDTH))
/*@}*/

/*!
 * @name Register RCM_SRIE, field LOCKUP[9] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the RCM_SRIE_LOCKUP field. */
#define RCM_RD_SRIE_LOCKUP(base) ((RCM_SRIE_REG(base) & RCM_SRIE_LOCKUP_MASK) >> RCM_SRIE_LOCKUP_SHIFT)
#define RCM_BRD_SRIE_LOCKUP(base) (BME_UBFX32(&RCM_SRIE_REG(base), RCM_SRIE_LOCKUP_SHIFT, RCM_SRIE_LOCKUP_WIDTH))

/*! @brief Set the LOCKUP field to a new value. */
#define RCM_WR_SRIE_LOCKUP(base, value) (RCM_RMW_SRIE(base, RCM_SRIE_LOCKUP_MASK, RCM_SRIE_LOCKUP(value)))
#define RCM_BWR_SRIE_LOCKUP(base, value) (BME_BFI32(&RCM_SRIE_REG(base), ((uint32_t)(value) << RCM_SRIE_LOCKUP_SHIFT), RCM_SRIE_LOCKUP_SHIFT, RCM_SRIE_LOCKUP_WIDTH))
/*@}*/

/*!
 * @name Register RCM_SRIE, field SW[10] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the RCM_SRIE_SW field. */
#define RCM_RD_SRIE_SW(base) ((RCM_SRIE_REG(base) & RCM_SRIE_SW_MASK) >> RCM_SRIE_SW_SHIFT)
#define RCM_BRD_SRIE_SW(base) (BME_UBFX32(&RCM_SRIE_REG(base), RCM_SRIE_SW_SHIFT, RCM_SRIE_SW_WIDTH))

/*! @brief Set the SW field to a new value. */
#define RCM_WR_SRIE_SW(base, value) (RCM_RMW_SRIE(base, RCM_SRIE_SW_MASK, RCM_SRIE_SW(value)))
#define RCM_BWR_SRIE_SW(base, value) (BME_BFI32(&RCM_SRIE_REG(base), ((uint32_t)(value) << RCM_SRIE_SW_SHIFT), RCM_SRIE_SW_SHIFT, RCM_SRIE_SW_WIDTH))
/*@}*/

/*!
 * @name Register RCM_SRIE, field SACKERR[13] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the RCM_SRIE_SACKERR field. */
#define RCM_RD_SRIE_SACKERR(base) ((RCM_SRIE_REG(base) & RCM_SRIE_SACKERR_MASK) >> RCM_SRIE_SACKERR_SHIFT)
#define RCM_BRD_SRIE_SACKERR(base) (BME_UBFX32(&RCM_SRIE_REG(base), RCM_SRIE_SACKERR_SHIFT, RCM_SRIE_SACKERR_WIDTH))

/*! @brief Set the SACKERR field to a new value. */
#define RCM_WR_SRIE_SACKERR(base, value) (RCM_RMW_SRIE(base, RCM_SRIE_SACKERR_MASK, RCM_SRIE_SACKERR(value)))
#define RCM_BWR_SRIE_SACKERR(base, value) (BME_BFI32(&RCM_SRIE_REG(base), ((uint32_t)(value) << RCM_SRIE_SACKERR_SHIFT), RCM_SRIE_SACKERR_SHIFT, RCM_SRIE_SACKERR_WIDTH))
/*@}*/

/*!
 * @name Register RCM_SRIE, field CORE1[16] (RW)
 *
 * Values:
 * - 0b0 - Interrupt disabled.
 * - 0b1 - Interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the RCM_SRIE_CORE1 field. */
#define RCM_RD_SRIE_CORE1(base) ((RCM_SRIE_REG(base) & RCM_SRIE_CORE1_MASK) >> RCM_SRIE_CORE1_SHIFT)
#define RCM_BRD_SRIE_CORE1(base) (BME_UBFX32(&RCM_SRIE_REG(base), RCM_SRIE_CORE1_SHIFT, RCM_SRIE_CORE1_WIDTH))

/*! @brief Set the CORE1 field to a new value. */
#define RCM_WR_SRIE_CORE1(base, value) (RCM_RMW_SRIE(base, RCM_SRIE_CORE1_MASK, RCM_SRIE_CORE1(value)))
#define RCM_BWR_SRIE_CORE1(base, value) (BME_BFI32(&RCM_SRIE_REG(base), ((uint32_t)(value) << RCM_SRIE_CORE1_SHIFT), RCM_SRIE_CORE1_SHIFT, RCM_SRIE_CORE1_WIDTH))
/*@}*/

