pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * MKL28Z7 SCG
 *
 * System Clock Generator
 *
 * Registers defined in this header file:
 * - SCG_VERID - Version ID Register
 * - SCG_PARAM - Parameter Register
 * - SCG_CSR - Clock Status Register
 * - SCG_RCCR - Run Clock Control Register
 * - SCG_VCCR - VLPR Clock Control Register
 * - SCG_HCCR - HSRUN Clock Control Register
 * - SCG_CLKOUTCNFG - SCG CLKOUT Configuration Register
 * - SCG_SOSCCSR - System OSC Control Status Register
 * - SCG_SOSCDIV - System OSC Divide Register
 * - SCG_SOSCCFG - System Oscillator Configuration Register
 * - SCG_SIRCCSR - Slow IRC Control Status Register
 * - SCG_SIRCDIV - Slow IRC Divide Register
 * - SCG_SIRCCFG - Slow IRC Configuration Register
 * - SCG_FIRCCSR - Fast IRC Control Status Register
 * - SCG_FIRCDIV - Fast IRC Divide Register
 * - SCG_FIRCCFG - Fast IRC Configuration Register
 * - SCG_FIRCTCFG - Fast IRC Trim Configuration Register
 * - SCG_FIRCSTAT - Fast IRC Status Register
 * - SCG_SPLLCSR - System PLL Control Status Register
 * - SCG_SPLLDIV - System PLL Divide Register
 * - SCG_SPLLCFG - System PLL Configuration Register
 */

#define SCG_INSTANCE_COUNT (1U) /*!< Number of instances of the SCG module. */
#define SCG_IDX (0U) /*!< Instance number for SCG. */

/*******************************************************************************
 * SCG_VERID - Version ID Register
 ******************************************************************************/

/*!
 * @brief SCG_VERID - Version ID Register (RO)
 *
 * Reset value: 0x01000000U
 */
/*!
 * @name Constants and macros for entire SCG_VERID register
 */
/*@{*/
#define SCG_RD_VERID(base)       (SCG_VERID_REG(base))
/*@}*/

/*******************************************************************************
 * SCG_PARAM - Parameter Register
 ******************************************************************************/

/*!
 * @brief SCG_PARAM - Parameter Register (RO)
 *
 * Reset value: 0xF80000FEU
 */
/*!
 * @name Constants and macros for entire SCG_PARAM register
 */
/*@{*/
#define SCG_RD_PARAM(base)       (SCG_PARAM_REG(base))
/*@}*/

/*
 * Constants & macros for individual SCG_PARAM bitfields
 */

/*!
 * @name Register SCG_PARAM, field CLKPRES[7:0] (RO)
 *
 * Indicates which clock sources are present in this instance of SCG. Any bits
 * not defined in this bit field are Reserved and always has the value 0 when read.
 */
/*@{*/
/*! @brief Read current value of the SCG_PARAM_CLKPRES field. */
#define SCG_RD_PARAM_CLKPRES(base) ((SCG_PARAM_REG(base) & SCG_PARAM_CLKPRES_MASK) >> SCG_PARAM_CLKPRES_SHIFT)
#define SCG_BRD_PARAM_CLKPRES(base) (BME_UBFX32(&SCG_PARAM_REG(base), SCG_PARAM_CLKPRES_SHIFT, SCG_PARAM_CLKPRES_WIDTH))
/*@}*/

/*!
 * @name Register SCG_PARAM, field UNDEFINED1[15:8] (ROZ)
 */
/*@{*/
/*! @brief Read current value of the SCG_PARAM_UNDEFINED1 field. */
#define SCG_RD_PARAM_UNDEFINED1(base) ((SCG_PARAM_REG(base) & SCG_PARAM_UNDEFINED1_MASK) >> SCG_PARAM_UNDEFINED1_SHIFT)
#define SCG_BRD_PARAM_UNDEFINED1(base) (BME_UBFX32(&SCG_PARAM_REG(base), SCG_PARAM_UNDEFINED1_SHIFT, SCG_PARAM_UNDEFINED1_WIDTH))
/*@}*/

/*!
 * @name Register SCG_PARAM, field UNDEFINED2[26:16] (ROZ)
 */
/*@{*/
/*! @brief Read current value of the SCG_PARAM_UNDEFINED2 field. */
#define SCG_RD_PARAM_UNDEFINED2(base) ((SCG_PARAM_REG(base) & SCG_PARAM_UNDEFINED2_MASK) >> SCG_PARAM_UNDEFINED2_SHIFT)
#define SCG_BRD_PARAM_UNDEFINED2(base) (SCG_RD_PARAM_UNDEFINED2(base))
/*@}*/

/*!
 * @name Register SCG_PARAM, field DIVPRES[31:27] (RO)
 *
 * Indicates which system clock dividers are present in this instance of SCG.
 */
/*@{*/
/*! @brief Read current value of the SCG_PARAM_DIVPRES field. */
#define SCG_RD_PARAM_DIVPRES(base) ((SCG_PARAM_REG(base) & SCG_PARAM_DIVPRES_MASK) >> SCG_PARAM_DIVPRES_SHIFT)
#define SCG_BRD_PARAM_DIVPRES(base) (BME_UBFX32(&SCG_PARAM_REG(base), SCG_PARAM_DIVPRES_SHIFT, SCG_PARAM_DIVPRES_WIDTH))
/*@}*/

/*******************************************************************************
 * SCG_CSR - Clock Status Register
 ******************************************************************************/

/*!
 * @brief SCG_CSR - Clock Status Register (RO)
 *
 * Reset value: 0x03000001U
 *
 * This register returns the currently configured system clock source and the
 * system clock dividers for the core (DIVCORE) and peripheral interface clock
 * (DIVSLOW). The SCG_CSR reflects the configuration set by one of three clock
 * control registers SCG_RCCR, SCG_VCCR, SCG_HCCR.
 */
/*!
 * @name Constants and macros for entire SCG_CSR register
 */
/*@{*/
#define SCG_RD_CSR(base)         (SCG_CSR_REG(base))
/*@}*/

/*
 * Constants & macros for individual SCG_CSR bitfields
 */

/*!
 * @name Register SCG_CSR, field DIVSLOW[3:0] (RO)
 *
 * Values:
 * - 0b0000 - Divide-by-1
 * - 0b0001 - Divide-by-2
 * - 0b0010 - Divide-by-3
 * - 0b0011 - Divide-by-4
 * - 0b0100 - Divide-by-5
 * - 0b0101 - Divide-by-6
 * - 0b0110 - Divide-by-7
 * - 0b0111 - Divide-by-8
 * - 0b1000 - Divide-by-9
 * - 0b1001 - Divide-by-10
 * - 0b1010 - Divide-by-11
 * - 0b1011 - Divide-by-12
 * - 0b1100 - Divide-by-13
 * - 0b1101 - Divide-by-14
 * - 0b1110 - Divide-by-15
 * - 0b1111 - Divide-by-16
 */
/*@{*/
/*! @brief Read current value of the SCG_CSR_DIVSLOW field. */
#define SCG_RD_CSR_DIVSLOW(base) ((SCG_CSR_REG(base) & SCG_CSR_DIVSLOW_MASK) >> SCG_CSR_DIVSLOW_SHIFT)
#define SCG_BRD_CSR_DIVSLOW(base) (BME_UBFX32(&SCG_CSR_REG(base), SCG_CSR_DIVSLOW_SHIFT, SCG_CSR_DIVSLOW_WIDTH))
/*@}*/

/*!
 * @name Register SCG_CSR, field DIVCORE[19:16] (RO)
 *
 * Values:
 * - 0b0000 - Divide-by-1
 * - 0b0001 - Divide-by-2
 * - 0b0010 - Divide-by-3
 * - 0b0011 - Divide-by-4
 * - 0b0100 - Divide-by-5
 * - 0b0101 - Divide-by-6
 * - 0b0110 - Divide-by-7
 * - 0b0111 - Divide-by-8
 * - 0b1000 - Divide-by-9
 * - 0b1001 - Divide-by-10
 * - 0b1010 - Divide-by-11
 * - 0b1011 - Divide-by-12
 * - 0b1100 - Divide-by-13
 * - 0b1101 - Divide-by-14
 * - 0b1110 - Divide-by-15
 * - 0b1111 - Divide-by-16
 */
/*@{*/
/*! @brief Read current value of the SCG_CSR_DIVCORE field. */
#define SCG_RD_CSR_DIVCORE(base) ((SCG_CSR_REG(base) & SCG_CSR_DIVCORE_MASK) >> SCG_CSR_DIVCORE_SHIFT)
#define SCG_BRD_CSR_DIVCORE(base) (BME_UBFX32(&SCG_CSR_REG(base), SCG_CSR_DIVCORE_SHIFT, SCG_CSR_DIVCORE_WIDTH))
/*@}*/

/*!
 * @name Register SCG_CSR, field SCS[27:24] (RO)
 *
 * Returns the currently configured clock source generating the system clock.
 *
 * Values:
 * - 0b0000 - Reserved
 * - 0b0001 - System OSC
 * - 0b0010 - Slow IRC
 * - 0b0011 - Fast IRC
 * - 0b0100 - Reserved
 * - 0b0101 - Reserved
 * - 0b0110 - System PLL
 * - 0b0111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SCG_CSR_SCS field. */
#define SCG_RD_CSR_SCS(base) ((SCG_CSR_REG(base) & SCG_CSR_SCS_MASK) >> SCG_CSR_SCS_SHIFT)
#define SCG_BRD_CSR_SCS(base) (BME_UBFX32(&SCG_CSR_REG(base), SCG_CSR_SCS_SHIFT, SCG_CSR_SCS_WIDTH))
/*@}*/

