pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the RANGE field to a new value. */
#define SCG_WR_SOSCCFG_RANGE(base, value) (SCG_RMW_SOSCCFG(base, SCG_SOSCCFG_RANGE_MASK, SCG_SOSCCFG_RANGE(value)))
#define SCG_BWR_SOSCCFG_RANGE(base, value) (BME_BFI32(&SCG_SOSCCFG_REG(base), ((uint32_t)(value) << SCG_SOSCCFG_RANGE_SHIFT), SCG_SOSCCFG_RANGE_SHIFT, SCG_SOSCCFG_RANGE_WIDTH))
/*@}*/

/*!
 * @name Register SCG_SOSCCFG, field SC16P[8] (RW)
 */
/*@{*/
/*! @brief Read current value of the SCG_SOSCCFG_SC16P field. */
#define SCG_RD_SOSCCFG_SC16P(base) ((SCG_SOSCCFG_REG(base) & SCG_SOSCCFG_SC16P_MASK) >> SCG_SOSCCFG_SC16P_SHIFT)
#define SCG_BRD_SOSCCFG_SC16P(base) (BME_UBFX32(&SCG_SOSCCFG_REG(base), SCG_SOSCCFG_SC16P_SHIFT, SCG_SOSCCFG_SC16P_WIDTH))

/*! @brief Set the SC16P field to a new value. */
#define SCG_WR_SOSCCFG_SC16P(base, value) (SCG_RMW_SOSCCFG(base, SCG_SOSCCFG_SC16P_MASK, SCG_SOSCCFG_SC16P(value)))
#define SCG_BWR_SOSCCFG_SC16P(base, value) (BME_BFI32(&SCG_SOSCCFG_REG(base), ((uint32_t)(value) << SCG_SOSCCFG_SC16P_SHIFT), SCG_SOSCCFG_SC16P_SHIFT, SCG_SOSCCFG_SC16P_WIDTH))
/*@}*/

/*!
 * @name Register SCG_SOSCCFG, field SC8P[9] (RW)
 */
/*@{*/
/*! @brief Read current value of the SCG_SOSCCFG_SC8P field. */
#define SCG_RD_SOSCCFG_SC8P(base) ((SCG_SOSCCFG_REG(base) & SCG_SOSCCFG_SC8P_MASK) >> SCG_SOSCCFG_SC8P_SHIFT)
#define SCG_BRD_SOSCCFG_SC8P(base) (BME_UBFX32(&SCG_SOSCCFG_REG(base), SCG_SOSCCFG_SC8P_SHIFT, SCG_SOSCCFG_SC8P_WIDTH))

/*! @brief Set the SC8P field to a new value. */
#define SCG_WR_SOSCCFG_SC8P(base, value) (SCG_RMW_SOSCCFG(base, SCG_SOSCCFG_SC8P_MASK, SCG_SOSCCFG_SC8P(value)))
#define SCG_BWR_SOSCCFG_SC8P(base, value) (BME_BFI32(&SCG_SOSCCFG_REG(base), ((uint32_t)(value) << SCG_SOSCCFG_SC8P_SHIFT), SCG_SOSCCFG_SC8P_SHIFT, SCG_SOSCCFG_SC8P_WIDTH))
/*@}*/

/*!
 * @name Register SCG_SOSCCFG, field SC4P[10] (RW)
 */
/*@{*/
/*! @brief Read current value of the SCG_SOSCCFG_SC4P field. */
#define SCG_RD_SOSCCFG_SC4P(base) ((SCG_SOSCCFG_REG(base) & SCG_SOSCCFG_SC4P_MASK) >> SCG_SOSCCFG_SC4P_SHIFT)
#define SCG_BRD_SOSCCFG_SC4P(base) (BME_UBFX32(&SCG_SOSCCFG_REG(base), SCG_SOSCCFG_SC4P_SHIFT, SCG_SOSCCFG_SC4P_WIDTH))

/*! @brief Set the SC4P field to a new value. */
#define SCG_WR_SOSCCFG_SC4P(base, value) (SCG_RMW_SOSCCFG(base, SCG_SOSCCFG_SC4P_MASK, SCG_SOSCCFG_SC4P(value)))
#define SCG_BWR_SOSCCFG_SC4P(base, value) (BME_BFI32(&SCG_SOSCCFG_REG(base), ((uint32_t)(value) << SCG_SOSCCFG_SC4P_SHIFT), SCG_SOSCCFG_SC4P_SHIFT, SCG_SOSCCFG_SC4P_WIDTH))
/*@}*/

/*!
 * @name Register SCG_SOSCCFG, field SC2P[11] (RW)
 */
/*@{*/
/*! @brief Read current value of the SCG_SOSCCFG_SC2P field. */
#define SCG_RD_SOSCCFG_SC2P(base) ((SCG_SOSCCFG_REG(base) & SCG_SOSCCFG_SC2P_MASK) >> SCG_SOSCCFG_SC2P_SHIFT)
#define SCG_BRD_SOSCCFG_SC2P(base) (BME_UBFX32(&SCG_SOSCCFG_REG(base), SCG_SOSCCFG_SC2P_SHIFT, SCG_SOSCCFG_SC2P_WIDTH))

/*! @brief Set the SC2P field to a new value. */
#define SCG_WR_SOSCCFG_SC2P(base, value) (SCG_RMW_SOSCCFG(base, SCG_SOSCCFG_SC2P_MASK, SCG_SOSCCFG_SC2P(value)))
#define SCG_BWR_SOSCCFG_SC2P(base, value) (BME_BFI32(&SCG_SOSCCFG_REG(base), ((uint32_t)(value) << SCG_SOSCCFG_SC2P_SHIFT), SCG_SOSCCFG_SC2P_SHIFT, SCG_SOSCCFG_SC2P_WIDTH))
/*@}*/

/*******************************************************************************
 * SCG_SIRCCSR - Slow IRC Control Status Register
 ******************************************************************************/

/*!
 * @brief SCG_SIRCCSR - Slow IRC Control Status Register (RW)
 *
 * Reset value: 0x03000005U
 */
/*!
 * @name Constants and macros for entire SCG_SIRCCSR register
 */
/*@{*/
#define SCG_RD_SIRCCSR(base)     (SCG_SIRCCSR_REG(base))
#define SCG_WR_SIRCCSR(base, value) (SCG_SIRCCSR_REG(base) = (value))
#define SCG_RMW_SIRCCSR(base, mask, value) (SCG_WR_SIRCCSR(base, (SCG_RD_SIRCCSR(base) & ~(mask)) | (value)))
#define SCG_SET_SIRCCSR(base, value) (BME_OR32(&SCG_SIRCCSR_REG(base), (uint32_t)(value)))
#define SCG_CLR_SIRCCSR(base, value) (BME_AND32(&SCG_SIRCCSR_REG(base), (uint32_t)(~(value))))
#define SCG_TOG_SIRCCSR(base, value) (BME_XOR32(&SCG_SIRCCSR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SCG_SIRCCSR bitfields
 */

/*!
 * @name Register SCG_SIRCCSR, field SIRCEN[0] (RW)
 *
 * Values:
 * - 0b0 - Slow IRC is disabled
 * - 0b1 - Slow IRC is enabled
 */
/*@{*/
/*! @brief Read current value of the SCG_SIRCCSR_SIRCEN field. */
#define SCG_RD_SIRCCSR_SIRCEN(base) ((SCG_SIRCCSR_REG(base) & SCG_SIRCCSR_SIRCEN_MASK) >> SCG_SIRCCSR_SIRCEN_SHIFT)
#define SCG_BRD_SIRCCSR_SIRCEN(base) (BME_UBFX32(&SCG_SIRCCSR_REG(base), SCG_SIRCCSR_SIRCEN_SHIFT, SCG_SIRCCSR_SIRCEN_WIDTH))

/*! @brief Set the SIRCEN field to a new value. */
#define SCG_WR_SIRCCSR_SIRCEN(base, value) (SCG_RMW_SIRCCSR(base, SCG_SIRCCSR_SIRCEN_MASK, SCG_SIRCCSR_SIRCEN(value)))
#define SCG_BWR_SIRCCSR_SIRCEN(base, value) (BME_BFI32(&SCG_SIRCCSR_REG(base), ((uint32_t)(value) << SCG_SIRCCSR_SIRCEN_SHIFT), SCG_SIRCCSR_SIRCEN_SHIFT, SCG_SIRCCSR_SIRCEN_WIDTH))
/*@}*/

/*!
 * @name Register SCG_SIRCCSR, field SIRCSTEN[1] (RW)
 *
 * Values:
 * - 0b0 - Slow IRC is disabled in Stop modes
 * - 0b1 - Slow IRC is enabled in Stop modes
 */
/*@{*/
/*! @brief Read current value of the SCG_SIRCCSR_SIRCSTEN field. */
#define SCG_RD_SIRCCSR_SIRCSTEN(base) ((SCG_SIRCCSR_REG(base) & SCG_SIRCCSR_SIRCSTEN_MASK) >> SCG_SIRCCSR_SIRCSTEN_SHIFT)
#define SCG_BRD_SIRCCSR_SIRCSTEN(base) (BME_UBFX32(&SCG_SIRCCSR_REG(base), SCG_SIRCCSR_SIRCSTEN_SHIFT, SCG_SIRCCSR_SIRCSTEN_WIDTH))

/*! @brief Set the SIRCSTEN field to a new value. */
#define SCG_WR_SIRCCSR_SIRCSTEN(base, value) (SCG_RMW_SIRCCSR(base, SCG_SIRCCSR_SIRCSTEN_MASK, SCG_SIRCCSR_SIRCSTEN(value)))
#define SCG_BWR_SIRCCSR_SIRCSTEN(base, value) (BME_BFI32(&SCG_SIRCCSR_REG(base), ((uint32_t)(value) << SCG_SIRCCSR_SIRCSTEN_SHIFT), SCG_SIRCCSR_SIRCSTEN_SHIFT, SCG_SIRCCSR_SIRCSTEN_WIDTH))
/*@}*/

/*!
 * @name Register SCG_SIRCCSR, field SIRCLPEN[2] (RW)
 *
 * Values:
 * - 0b0 - Slow IRC is disabled in VLP modes
 * - 0b1 - Slow IRC is enabled in VLP modes
 */
/*@{*/
/*! @brief Read current value of the SCG_SIRCCSR_SIRCLPEN field. */
#define SCG_RD_SIRCCSR_SIRCLPEN(base) ((SCG_SIRCCSR_REG(base) & SCG_SIRCCSR_SIRCLPEN_MASK) >> SCG_SIRCCSR_SIRCLPEN_SHIFT)
#define SCG_BRD_SIRCCSR_SIRCLPEN(base) (BME_UBFX32(&SCG_SIRCCSR_REG(base), SCG_SIRCCSR_SIRCLPEN_SHIFT, SCG_SIRCCSR_SIRCLPEN_WIDTH))

