pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * SCG_SIRCCFG - Slow IRC Configuration Register
 ******************************************************************************/

/*!
 * @brief SCG_SIRCCFG - Slow IRC Configuration Register (RW)
 *
 * Reset value: 0x00000001U
 *
 * The SIRCCFG register cannot be changed when the slow IRC clock is enabled.
 * When the slow IRC clock is enabled, writes to this register are ignored, and
 * there is no transfer error.
 */
/*!
 * @name Constants and macros for entire SCG_SIRCCFG register
 */
/*@{*/
#define SCG_RD_SIRCCFG(base)     (SCG_SIRCCFG_REG(base))
#define SCG_WR_SIRCCFG(base, value) (SCG_SIRCCFG_REG(base) = (value))
#define SCG_RMW_SIRCCFG(base, mask, value) (SCG_WR_SIRCCFG(base, (SCG_RD_SIRCCFG(base) & ~(mask)) | (value)))
#define SCG_SET_SIRCCFG(base, value) (BME_OR32(&SCG_SIRCCFG_REG(base), (uint32_t)(value)))
#define SCG_CLR_SIRCCFG(base, value) (BME_AND32(&SCG_SIRCCFG_REG(base), (uint32_t)(~(value))))
#define SCG_TOG_SIRCCFG(base, value) (BME_XOR32(&SCG_SIRCCFG_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SCG_SIRCCFG bitfields
 */

/*!
 * @name Register SCG_SIRCCFG, field RANGE[0] (RW)
 *
 * Values:
 * - 0b0 - Slow IRC low range clock (2 MHz)
 * - 0b1 - Slow IRC high range clock (8 MHz)
 */
/*@{*/
/*! @brief Read current value of the SCG_SIRCCFG_RANGE field. */
#define SCG_RD_SIRCCFG_RANGE(base) ((SCG_SIRCCFG_REG(base) & SCG_SIRCCFG_RANGE_MASK) >> SCG_SIRCCFG_RANGE_SHIFT)
#define SCG_BRD_SIRCCFG_RANGE(base) (BME_UBFX32(&SCG_SIRCCFG_REG(base), SCG_SIRCCFG_RANGE_SHIFT, SCG_SIRCCFG_RANGE_WIDTH))

/*! @brief Set the RANGE field to a new value. */
#define SCG_WR_SIRCCFG_RANGE(base, value) (SCG_RMW_SIRCCFG(base, SCG_SIRCCFG_RANGE_MASK, SCG_SIRCCFG_RANGE(value)))
#define SCG_BWR_SIRCCFG_RANGE(base, value) (BME_BFI32(&SCG_SIRCCFG_REG(base), ((uint32_t)(value) << SCG_SIRCCFG_RANGE_SHIFT), SCG_SIRCCFG_RANGE_SHIFT, SCG_SIRCCFG_RANGE_WIDTH))
/*@}*/

/*******************************************************************************
 * SCG_FIRCCSR - Fast IRC Control Status Register
 ******************************************************************************/

/*!
 * @brief SCG_FIRCCSR - Fast IRC Control Status Register (RW)
 *
 * Reset value: 0x00000001U
 */
/*!
 * @name Constants and macros for entire SCG_FIRCCSR register
 */
/*@{*/
#define SCG_RD_FIRCCSR(base)     (SCG_FIRCCSR_REG(base))
#define SCG_WR_FIRCCSR(base, value) (SCG_FIRCCSR_REG(base) = (value))
#define SCG_RMW_FIRCCSR(base, mask, value) (SCG_WR_FIRCCSR(base, (SCG_RD_FIRCCSR(base) & ~(mask)) | (value)))
#define SCG_SET_FIRCCSR(base, value) (BME_OR32(&SCG_FIRCCSR_REG(base), (uint32_t)(value)))
#define SCG_CLR_FIRCCSR(base, value) (BME_AND32(&SCG_FIRCCSR_REG(base), (uint32_t)(~(value))))
#define SCG_TOG_FIRCCSR(base, value) (BME_XOR32(&SCG_FIRCCSR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SCG_FIRCCSR bitfields
 */

/*!
 * @name Register SCG_FIRCCSR, field FIRCEN[0] (RW)
 *
 * Values:
 * - 0b0 - Fast IRC is disabled
 * - 0b1 - Fast IRC is enabled
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCCSR_FIRCEN field. */
#define SCG_RD_FIRCCSR_FIRCEN(base) ((SCG_FIRCCSR_REG(base) & SCG_FIRCCSR_FIRCEN_MASK) >> SCG_FIRCCSR_FIRCEN_SHIFT)
#define SCG_BRD_FIRCCSR_FIRCEN(base) (BME_UBFX32(&SCG_FIRCCSR_REG(base), SCG_FIRCCSR_FIRCEN_SHIFT, SCG_FIRCCSR_FIRCEN_WIDTH))

/*! @brief Set the FIRCEN field to a new value. */
#define SCG_WR_FIRCCSR_FIRCEN(base, value) (SCG_RMW_FIRCCSR(base, (SCG_FIRCCSR_FIRCEN_MASK | SCG_FIRCCSR_FIRCERR_MASK), SCG_FIRCCSR_FIRCEN(value)))
#define SCG_BWR_FIRCCSR_FIRCEN(base, value) (BME_BFI32(&SCG_FIRCCSR_REG(base), ((uint32_t)(value) << SCG_FIRCCSR_FIRCEN_SHIFT), SCG_FIRCCSR_FIRCEN_SHIFT, SCG_FIRCCSR_FIRCEN_WIDTH))
/*@}*/

/*!
 * @name Register SCG_FIRCCSR, field FIRCSTEN[1] (RW)
 *
 * Values:
 * - 0b0 - Fast IRC is disabled in Stop modes. When selected as the reference
 *     clock to the System PLL and if the System PLL is enabled in STOP mode, the
 *     Fast IRC will stay enabled even if FIRCSTEN=0.
 * - 0b1 - Fast IRC is enabled in Stop modes
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCCSR_FIRCSTEN field. */
#define SCG_RD_FIRCCSR_FIRCSTEN(base) ((SCG_FIRCCSR_REG(base) & SCG_FIRCCSR_FIRCSTEN_MASK) >> SCG_FIRCCSR_FIRCSTEN_SHIFT)
#define SCG_BRD_FIRCCSR_FIRCSTEN(base) (BME_UBFX32(&SCG_FIRCCSR_REG(base), SCG_FIRCCSR_FIRCSTEN_SHIFT, SCG_FIRCCSR_FIRCSTEN_WIDTH))

/*! @brief Set the FIRCSTEN field to a new value. */
#define SCG_WR_FIRCCSR_FIRCSTEN(base, value) (SCG_RMW_FIRCCSR(base, (SCG_FIRCCSR_FIRCSTEN_MASK | SCG_FIRCCSR_FIRCERR_MASK), SCG_FIRCCSR_FIRCSTEN(value)))
#define SCG_BWR_FIRCCSR_FIRCSTEN(base, value) (BME_BFI32(&SCG_FIRCCSR_REG(base), ((uint32_t)(value) << SCG_FIRCCSR_FIRCSTEN_SHIFT), SCG_FIRCCSR_FIRCSTEN_SHIFT, SCG_FIRCCSR_FIRCSTEN_WIDTH))
/*@}*/

/*!
 * @name Register SCG_FIRCCSR, field FIRCREGOFF[2] (RW)
 *
 * Values:
 * - 0b0 - Fast IRC Regulator is enabled.
 * - 0b1 - Fast IRC Regulator is disabled.
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCCSR_FIRCREGOFF field. */
#define SCG_RD_FIRCCSR_FIRCREGOFF(base) ((SCG_FIRCCSR_REG(base) & SCG_FIRCCSR_FIRCREGOFF_MASK) >> SCG_FIRCCSR_FIRCREGOFF_SHIFT)
#define SCG_BRD_FIRCCSR_FIRCREGOFF(base) (BME_UBFX32(&SCG_FIRCCSR_REG(base), SCG_FIRCCSR_FIRCREGOFF_SHIFT, SCG_FIRCCSR_FIRCREGOFF_WIDTH))

/*! @brief Set the FIRCREGOFF field to a new value. */
#define SCG_WR_FIRCCSR_FIRCREGOFF(base, value) (SCG_RMW_FIRCCSR(base, (SCG_FIRCCSR_FIRCREGOFF_MASK | SCG_FIRCCSR_FIRCERR_MASK), SCG_FIRCCSR_FIRCREGOFF(value)))
#define SCG_BWR_FIRCCSR_FIRCREGOFF(base, value) (BME_BFI32(&SCG_FIRCCSR_REG(base), ((uint32_t)(value) << SCG_FIRCCSR_FIRCREGOFF_SHIFT), SCG_FIRCCSR_FIRCREGOFF_SHIFT, SCG_FIRCCSR_FIRCREGOFF_WIDTH))
/*@}*/

/*!
 * @name Register SCG_FIRCCSR, field FIRCLPEN[3] (RW)
 *
 * Values:
 * - 0b0 - Fast IRC is disabled in VLP modes
 * - 0b1 - Fast IRC is enabled in VLP modes
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCCSR_FIRCLPEN field. */
#define SCG_RD_FIRCCSR_FIRCLPEN(base) ((SCG_FIRCCSR_REG(base) & SCG_FIRCCSR_FIRCLPEN_MASK) >> SCG_FIRCCSR_FIRCLPEN_SHIFT)
#define SCG_BRD_FIRCCSR_FIRCLPEN(base) (BME_UBFX32(&SCG_FIRCCSR_REG(base), SCG_FIRCCSR_FIRCLPEN_SHIFT, SCG_FIRCCSR_FIRCLPEN_WIDTH))

/*! @brief Set the FIRCLPEN field to a new value. */
#define SCG_WR_FIRCCSR_FIRCLPEN(base, value) (SCG_RMW_FIRCCSR(base, (SCG_FIRCCSR_FIRCLPEN_MASK | SCG_FIRCCSR_FIRCERR_MASK), SCG_FIRCCSR_FIRCLPEN(value)))
#define SCG_BWR_FIRCCSR_FIRCLPEN(base, value) (BME_BFI32(&SCG_FIRCCSR_REG(base), ((uint32_t)(value) << SCG_FIRCCSR_FIRCLPEN_SHIFT), SCG_FIRCCSR_FIRCLPEN_SHIFT, SCG_FIRCCSR_FIRCLPEN_WIDTH))
/*@}*/

/*!
 * @name Register SCG_FIRCCSR, field FIRCTREN[8] (RW)
 *
 * Values:
 * - 0b0 - Disable trimming Fast IRC to an external clock source
 * - 0b1 - Enable trimming Fast IRC to an external clock source
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCCSR_FIRCTREN field. */
#define SCG_RD_FIRCCSR_FIRCTREN(base) ((SCG_FIRCCSR_REG(base) & SCG_FIRCCSR_FIRCTREN_MASK) >> SCG_FIRCCSR_FIRCTREN_SHIFT)
#define SCG_BRD_FIRCCSR_FIRCTREN(base) (BME_UBFX32(&SCG_FIRCCSR_REG(base), SCG_FIRCCSR_FIRCTREN_SHIFT, SCG_FIRCCSR_FIRCTREN_WIDTH))

