pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the FIRCDIV1 field to a new value. */
#define SCG_WR_FIRCDIV_FIRCDIV1(base, value) (SCG_RMW_FIRCDIV(base, SCG_FIRCDIV_FIRCDIV1_MASK, SCG_FIRCDIV_FIRCDIV1(value)))
#define SCG_BWR_FIRCDIV_FIRCDIV1(base, value) (BME_BFI32(&SCG_FIRCDIV_REG(base), ((uint32_t)(value) << SCG_FIRCDIV_FIRCDIV1_SHIFT), SCG_FIRCDIV_FIRCDIV1_SHIFT, SCG_FIRCDIV_FIRCDIV1_WIDTH))
/*@}*/

/*!
 * @name Register SCG_FIRCDIV, field FIRCDIV2[10:8] (RW)
 *
 * Clock divider 2 for the Fast IRC.
 *
 * Values:
 * - 0b000 - Output disabled
 * - 0b001 - Divide by 1
 * - 0b010 - Divide by 2
 * - 0b011 - Divide by 4
 * - 0b100 - Divide by 8
 * - 0b101 - Divide by 16
 * - 0b110 - Divide by 32
 * - 0b111 - Divide by 64
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCDIV_FIRCDIV2 field. */
#define SCG_RD_FIRCDIV_FIRCDIV2(base) ((SCG_FIRCDIV_REG(base) & SCG_FIRCDIV_FIRCDIV2_MASK) >> SCG_FIRCDIV_FIRCDIV2_SHIFT)
#define SCG_BRD_FIRCDIV_FIRCDIV2(base) (BME_UBFX32(&SCG_FIRCDIV_REG(base), SCG_FIRCDIV_FIRCDIV2_SHIFT, SCG_FIRCDIV_FIRCDIV2_WIDTH))

/*! @brief Set the FIRCDIV2 field to a new value. */
#define SCG_WR_FIRCDIV_FIRCDIV2(base, value) (SCG_RMW_FIRCDIV(base, SCG_FIRCDIV_FIRCDIV2_MASK, SCG_FIRCDIV_FIRCDIV2(value)))
#define SCG_BWR_FIRCDIV_FIRCDIV2(base, value) (BME_BFI32(&SCG_FIRCDIV_REG(base), ((uint32_t)(value) << SCG_FIRCDIV_FIRCDIV2_SHIFT), SCG_FIRCDIV_FIRCDIV2_SHIFT, SCG_FIRCDIV_FIRCDIV2_WIDTH))
/*@}*/

/*!
 * @name Register SCG_FIRCDIV, field FIRCDIV3[18:16] (RW)
 *
 * Clock divider 2 for the Fast IRC.
 *
 * Values:
 * - 0b000 - Clock disabled
 * - 0b001 - Divide by 1
 * - 0b010 - Divide by 2
 * - 0b011 - Divide by 4
 * - 0b100 - Divide by 8
 * - 0b101 - Divide by 16
 * - 0b110 - Divide by 32
 * - 0b111 - Divide by 64
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCDIV_FIRCDIV3 field. */
#define SCG_RD_FIRCDIV_FIRCDIV3(base) ((SCG_FIRCDIV_REG(base) & SCG_FIRCDIV_FIRCDIV3_MASK) >> SCG_FIRCDIV_FIRCDIV3_SHIFT)
#define SCG_BRD_FIRCDIV_FIRCDIV3(base) (BME_UBFX32(&SCG_FIRCDIV_REG(base), SCG_FIRCDIV_FIRCDIV3_SHIFT, SCG_FIRCDIV_FIRCDIV3_WIDTH))

/*! @brief Set the FIRCDIV3 field to a new value. */
#define SCG_WR_FIRCDIV_FIRCDIV3(base, value) (SCG_RMW_FIRCDIV(base, SCG_FIRCDIV_FIRCDIV3_MASK, SCG_FIRCDIV_FIRCDIV3(value)))
#define SCG_BWR_FIRCDIV_FIRCDIV3(base, value) (BME_BFI32(&SCG_FIRCDIV_REG(base), ((uint32_t)(value) << SCG_FIRCDIV_FIRCDIV3_SHIFT), SCG_FIRCDIV_FIRCDIV3_SHIFT, SCG_FIRCDIV_FIRCDIV3_WIDTH))
/*@}*/

/*******************************************************************************
 * SCG_FIRCCFG - Fast IRC Configuration Register
 ******************************************************************************/

/*!
 * @brief SCG_FIRCCFG - Fast IRC Configuration Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The FIRCCFG register cannot be changed when the Fast IRC is enabled. When the
 * Fast IRC is enabled, writes to this register are ignored, and there is no
 * transfer error.
 */
/*!
 * @name Constants and macros for entire SCG_FIRCCFG register
 */
/*@{*/
#define SCG_RD_FIRCCFG(base)     (SCG_FIRCCFG_REG(base))
#define SCG_WR_FIRCCFG(base, value) (SCG_FIRCCFG_REG(base) = (value))
#define SCG_RMW_FIRCCFG(base, mask, value) (SCG_WR_FIRCCFG(base, (SCG_RD_FIRCCFG(base) & ~(mask)) | (value)))
#define SCG_SET_FIRCCFG(base, value) (BME_OR32(&SCG_FIRCCFG_REG(base), (uint32_t)(value)))
#define SCG_CLR_FIRCCFG(base, value) (BME_AND32(&SCG_FIRCCFG_REG(base), (uint32_t)(~(value))))
#define SCG_TOG_FIRCCFG(base, value) (BME_XOR32(&SCG_FIRCCFG_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SCG_FIRCCFG bitfields
 */

/*!
 * @name Register SCG_FIRCCFG, field RANGE[1:0] (RW)
 *
 * Values:
 * - 0b00 - Fast IRC is trimmed to 48 MHz
 * - 0b01 - Fast IRC is trimmed to 52 MHz
 * - 0b10 - Fast IRC is trimmed to 56 MHz
 * - 0b11 - Fast IRC is trimmed to 60 MHz
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCCFG_RANGE field. */
#define SCG_RD_FIRCCFG_RANGE(base) ((SCG_FIRCCFG_REG(base) & SCG_FIRCCFG_RANGE_MASK) >> SCG_FIRCCFG_RANGE_SHIFT)
#define SCG_BRD_FIRCCFG_RANGE(base) (BME_UBFX32(&SCG_FIRCCFG_REG(base), SCG_FIRCCFG_RANGE_SHIFT, SCG_FIRCCFG_RANGE_WIDTH))

/*! @brief Set the RANGE field to a new value. */
#define SCG_WR_FIRCCFG_RANGE(base, value) (SCG_RMW_FIRCCFG(base, SCG_FIRCCFG_RANGE_MASK, SCG_FIRCCFG_RANGE(value)))
#define SCG_BWR_FIRCCFG_RANGE(base, value) (BME_BFI32(&SCG_FIRCCFG_REG(base), ((uint32_t)(value) << SCG_FIRCCFG_RANGE_SHIFT), SCG_FIRCCFG_RANGE_SHIFT, SCG_FIRCCFG_RANGE_WIDTH))
/*@}*/

/*******************************************************************************
 * SCG_FIRCTCFG - Fast IRC Trim Configuration Register
 ******************************************************************************/

/*!
 * @brief SCG_FIRCTCFG - Fast IRC Trim Configuration Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The FIRCTCFG register cannot be changed when Fast IRC tuning is enabled. When
 * the Fast IRC tuning is enabled, writes to this register are ignored, and
 * there is no transfer error.
 */
/*!
 * @name Constants and macros for entire SCG_FIRCTCFG register
 */
/*@{*/
#define SCG_RD_FIRCTCFG(base)    (SCG_FIRCTCFG_REG(base))
#define SCG_WR_FIRCTCFG(base, value) (SCG_FIRCTCFG_REG(base) = (value))
#define SCG_RMW_FIRCTCFG(base, mask, value) (SCG_WR_FIRCTCFG(base, (SCG_RD_FIRCTCFG(base) & ~(mask)) | (value)))
#define SCG_SET_FIRCTCFG(base, value) (BME_OR32(&SCG_FIRCTCFG_REG(base), (uint32_t)(value)))
#define SCG_CLR_FIRCTCFG(base, value) (BME_AND32(&SCG_FIRCTCFG_REG(base), (uint32_t)(~(value))))
#define SCG_TOG_FIRCTCFG(base, value) (BME_XOR32(&SCG_FIRCTCFG_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SCG_FIRCTCFG bitfields
 */

/*!
 * @name Register SCG_FIRCTCFG, field TRIMSRC[1:0] (RW)
 *
 * Configures the external clock source to tune the Fast IRC.
 *
 * Values:
 * - 0b00 - USB0 Start of Frame (1 kHz)
 * - 0b01 - USB1 Start of Frame (1 kHz)
 * - 0b10 - System OSC
 * - 0b11 - RTC OSC (32.768 kHz)
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCTCFG_TRIMSRC field. */
#define SCG_RD_FIRCTCFG_TRIMSRC(base) ((SCG_FIRCTCFG_REG(base) & SCG_FIRCTCFG_TRIMSRC_MASK) >> SCG_FIRCTCFG_TRIMSRC_SHIFT)
#define SCG_BRD_FIRCTCFG_TRIMSRC(base) (BME_UBFX32(&SCG_FIRCTCFG_REG(base), SCG_FIRCTCFG_TRIMSRC_SHIFT, SCG_FIRCTCFG_TRIMSRC_WIDTH))

/*! @brief Set the TRIMSRC field to a new value. */
#define SCG_WR_FIRCTCFG_TRIMSRC(base, value) (SCG_RMW_FIRCTCFG(base, SCG_FIRCTCFG_TRIMSRC_MASK, SCG_FIRCTCFG_TRIMSRC(value)))
#define SCG_BWR_FIRCTCFG_TRIMSRC(base, value) (BME_BFI32(&SCG_FIRCTCFG_REG(base), ((uint32_t)(value) << SCG_FIRCTCFG_TRIMSRC_SHIFT), SCG_FIRCTCFG_TRIMSRC_SHIFT, SCG_FIRCTCFG_TRIMSRC_WIDTH))
/*@}*/

/*!
 * @name Register SCG_FIRCTCFG, field TRIMDIV[10:8] (RW)
 *
 * Divide the System OSC down for Fast IRC trimming.
 *
 * Values:
 * - 0b000 - Divide by 1
 * - 0b001 - Divide by 128
 * - 0b010 - Divide by 256
 * - 0b011 - Divide by 512
 * - 0b100 - Divide by 1024
 * - 0b101 - Divide by 2048
 * - 0b110 - Reserved. Writing this value will result in Divide by 1.
 * - 0b111 - Reserved. Writing this value will result in a Divide by 1.
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCTCFG_TRIMDIV field. */
#define SCG_RD_FIRCTCFG_TRIMDIV(base) ((SCG_FIRCTCFG_REG(base) & SCG_FIRCTCFG_TRIMDIV_MASK) >> SCG_FIRCTCFG_TRIMDIV_SHIFT)
#define SCG_BRD_FIRCTCFG_TRIMDIV(base) (BME_UBFX32(&SCG_FIRCTCFG_REG(base), SCG_FIRCTCFG_TRIMDIV_SHIFT, SCG_FIRCTCFG_TRIMDIV_WIDTH))

/*! @brief Set the TRIMDIV field to a new value. */
#define SCG_WR_FIRCTCFG_TRIMDIV(base, value) (SCG_RMW_FIRCTCFG(base, SCG_FIRCTCFG_TRIMDIV_MASK, SCG_FIRCTCFG_TRIMDIV(value)))
#define SCG_BWR_FIRCTCFG_TRIMDIV(base, value) (BME_BFI32(&SCG_FIRCTCFG_REG(base), ((uint32_t)(value) << SCG_FIRCTCFG_TRIMDIV_SHIFT), SCG_FIRCTCFG_TRIMDIV_SHIFT, SCG_FIRCTCFG_TRIMDIV_WIDTH))
/*@}*/

