pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * SCG_FIRCSTAT - Fast IRC Status Register
 ******************************************************************************/

/*!
 * @brief SCG_FIRCSTAT - Fast IRC Status Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is loaded from IFR during reset. These register gets uploaded
 * with the trim values generated by FIRC auto trimming which is enabled when FIRC
 * is enabled and FIRCTREN=1 and FRICTRUP=1. When FIRC auto trimming is enabled
 * and FIRCTRUP is off, writes to this register is allowed and values written to
 * this register are used to trim FIRC clock.
 */
/*!
 * @name Constants and macros for entire SCG_FIRCSTAT register
 */
/*@{*/
#define SCG_RD_FIRCSTAT(base)    (SCG_FIRCSTAT_REG(base))
#define SCG_WR_FIRCSTAT(base, value) (SCG_FIRCSTAT_REG(base) = (value))
#define SCG_RMW_FIRCSTAT(base, mask, value) (SCG_WR_FIRCSTAT(base, (SCG_RD_FIRCSTAT(base) & ~(mask)) | (value)))
#define SCG_SET_FIRCSTAT(base, value) (BME_OR32(&SCG_FIRCSTAT_REG(base), (uint32_t)(value)))
#define SCG_CLR_FIRCSTAT(base, value) (BME_AND32(&SCG_FIRCSTAT_REG(base), (uint32_t)(~(value))))
#define SCG_TOG_FIRCSTAT(base, value) (BME_XOR32(&SCG_FIRCSTAT_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SCG_FIRCSTAT bitfields
 */

/*!
 * @name Register SCG_FIRCSTAT, field TRIMFINE[6:0] (RW)
 *
 * When FIRC is enabled and auto trimming is enabled (FIRCTREN=1 and FIRCTRUP=1)
 * these register gets uploaded with the trimmed coarse value. When FIRCTRUP=0,
 * these register is writeable to allow user programming of fine trim values.
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCSTAT_TRIMFINE field. */
#define SCG_RD_FIRCSTAT_TRIMFINE(base) ((SCG_FIRCSTAT_REG(base) & SCG_FIRCSTAT_TRIMFINE_MASK) >> SCG_FIRCSTAT_TRIMFINE_SHIFT)
#define SCG_BRD_FIRCSTAT_TRIMFINE(base) (BME_UBFX32(&SCG_FIRCSTAT_REG(base), SCG_FIRCSTAT_TRIMFINE_SHIFT, SCG_FIRCSTAT_TRIMFINE_WIDTH))

/*! @brief Set the TRIMFINE field to a new value. */
#define SCG_WR_FIRCSTAT_TRIMFINE(base, value) (SCG_RMW_FIRCSTAT(base, SCG_FIRCSTAT_TRIMFINE_MASK, SCG_FIRCSTAT_TRIMFINE(value)))
#define SCG_BWR_FIRCSTAT_TRIMFINE(base, value) (BME_BFI32(&SCG_FIRCSTAT_REG(base), ((uint32_t)(value) << SCG_FIRCSTAT_TRIMFINE_SHIFT), SCG_FIRCSTAT_TRIMFINE_SHIFT, SCG_FIRCSTAT_TRIMFINE_WIDTH))
/*@}*/

/*!
 * @name Register SCG_FIRCSTAT, field TRIMCOAR[15:8] (RW)
 *
 * When FIRC is enabled and auto trimming is enabled (FIRCTREN=1 and FIRCTRUP=1)
 * these register gets uploaded with the trimmed coarse value. When FIRCTRUP=0,
 * these register is writable to allow user programming of coarse trim values.
 */
/*@{*/
/*! @brief Read current value of the SCG_FIRCSTAT_TRIMCOAR field. */
#define SCG_RD_FIRCSTAT_TRIMCOAR(base) ((SCG_FIRCSTAT_REG(base) & SCG_FIRCSTAT_TRIMCOAR_MASK) >> SCG_FIRCSTAT_TRIMCOAR_SHIFT)
#define SCG_BRD_FIRCSTAT_TRIMCOAR(base) (BME_UBFX32(&SCG_FIRCSTAT_REG(base), SCG_FIRCSTAT_TRIMCOAR_SHIFT, SCG_FIRCSTAT_TRIMCOAR_WIDTH))

/*! @brief Set the TRIMCOAR field to a new value. */
#define SCG_WR_FIRCSTAT_TRIMCOAR(base, value) (SCG_RMW_FIRCSTAT(base, SCG_FIRCSTAT_TRIMCOAR_MASK, SCG_FIRCSTAT_TRIMCOAR(value)))
#define SCG_BWR_FIRCSTAT_TRIMCOAR(base, value) (BME_BFI32(&SCG_FIRCSTAT_REG(base), ((uint32_t)(value) << SCG_FIRCSTAT_TRIMCOAR_SHIFT), SCG_FIRCSTAT_TRIMCOAR_SHIFT, SCG_FIRCSTAT_TRIMCOAR_WIDTH))
/*@}*/

/*******************************************************************************
 * SCG_SPLLCSR - System PLL Control Status Register
 ******************************************************************************/

/*!
 * @brief SCG_SPLLCSR - System PLL Control Status Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SCG_SPLLCSR register
 */
/*@{*/
#define SCG_RD_SPLLCSR(base)     (SCG_SPLLCSR_REG(base))
#define SCG_WR_SPLLCSR(base, value) (SCG_SPLLCSR_REG(base) = (value))
#define SCG_RMW_SPLLCSR(base, mask, value) (SCG_WR_SPLLCSR(base, (SCG_RD_SPLLCSR(base) & ~(mask)) | (value)))
#define SCG_SET_SPLLCSR(base, value) (BME_OR32(&SCG_SPLLCSR_REG(base), (uint32_t)(value)))
#define SCG_CLR_SPLLCSR(base, value) (BME_AND32(&SCG_SPLLCSR_REG(base), (uint32_t)(~(value))))
#define SCG_TOG_SPLLCSR(base, value) (BME_XOR32(&SCG_SPLLCSR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SCG_SPLLCSR bitfields
 */

/*!
 * @name Register SCG_SPLLCSR, field SPLLEN[0] (RW)
 *
 * Values:
 * - 0b0 - System PLL is disabled
 * - 0b1 - System PLL is enabled
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLCSR_SPLLEN field. */
#define SCG_RD_SPLLCSR_SPLLEN(base) ((SCG_SPLLCSR_REG(base) & SCG_SPLLCSR_SPLLEN_MASK) >> SCG_SPLLCSR_SPLLEN_SHIFT)
#define SCG_BRD_SPLLCSR_SPLLEN(base) (BME_UBFX32(&SCG_SPLLCSR_REG(base), SCG_SPLLCSR_SPLLEN_SHIFT, SCG_SPLLCSR_SPLLEN_WIDTH))

/*! @brief Set the SPLLEN field to a new value. */
#define SCG_WR_SPLLCSR_SPLLEN(base, value) (SCG_RMW_SPLLCSR(base, (SCG_SPLLCSR_SPLLEN_MASK | SCG_SPLLCSR_SPLLERR_MASK), SCG_SPLLCSR_SPLLEN(value)))
#define SCG_BWR_SPLLCSR_SPLLEN(base, value) (BME_BFI32(&SCG_SPLLCSR_REG(base), ((uint32_t)(value) << SCG_SPLLCSR_SPLLEN_SHIFT), SCG_SPLLCSR_SPLLEN_SHIFT, SCG_SPLLCSR_SPLLEN_WIDTH))
/*@}*/

/*!
 * @name Register SCG_SPLLCSR, field SPLLSTEN[1] (RW)
 *
 * Values:
 * - 0b0 - System PLL is disabled in Stop modes
 * - 0b1 - System PLL is enabled in Stop modes
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLCSR_SPLLSTEN field. */
#define SCG_RD_SPLLCSR_SPLLSTEN(base) ((SCG_SPLLCSR_REG(base) & SCG_SPLLCSR_SPLLSTEN_MASK) >> SCG_SPLLCSR_SPLLSTEN_SHIFT)
#define SCG_BRD_SPLLCSR_SPLLSTEN(base) (BME_UBFX32(&SCG_SPLLCSR_REG(base), SCG_SPLLCSR_SPLLSTEN_SHIFT, SCG_SPLLCSR_SPLLSTEN_WIDTH))

/*! @brief Set the SPLLSTEN field to a new value. */
#define SCG_WR_SPLLCSR_SPLLSTEN(base, value) (SCG_RMW_SPLLCSR(base, (SCG_SPLLCSR_SPLLSTEN_MASK | SCG_SPLLCSR_SPLLERR_MASK), SCG_SPLLCSR_SPLLSTEN(value)))
#define SCG_BWR_SPLLCSR_SPLLSTEN(base, value) (BME_BFI32(&SCG_SPLLCSR_REG(base), ((uint32_t)(value) << SCG_SPLLCSR_SPLLSTEN_SHIFT), SCG_SPLLCSR_SPLLSTEN_SHIFT, SCG_SPLLCSR_SPLLSTEN_WIDTH))
/*@}*/

/*!
 * @name Register SCG_SPLLCSR, field SPLLCM[16] (RW)
 *
 * Enables the clock monitor, if the clock source is disabled in a low power
 * mode then the clock monitor is also disabled in the low power mode. The clock
 * monitor is always disabled in LLS/VLLS modes. When the clock monitor is disabled
 * in a low power mode, it remains disabled until the clock valid flag is set
 * following exit from the low power mode.
 *
 * Values:
 * - 0b0 - System PLL Clock Monitor is disabled
 * - 0b1 - System PLL Clock Monitor is enabled
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLCSR_SPLLCM field. */
#define SCG_RD_SPLLCSR_SPLLCM(base) ((SCG_SPLLCSR_REG(base) & SCG_SPLLCSR_SPLLCM_MASK) >> SCG_SPLLCSR_SPLLCM_SHIFT)
#define SCG_BRD_SPLLCSR_SPLLCM(base) (BME_UBFX32(&SCG_SPLLCSR_REG(base), SCG_SPLLCSR_SPLLCM_SHIFT, SCG_SPLLCSR_SPLLCM_WIDTH))

