pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the SPLLCM field to a new value. */
#define SCG_WR_SPLLCSR_SPLLCM(base, value) (SCG_RMW_SPLLCSR(base, (SCG_SPLLCSR_SPLLCM_MASK | SCG_SPLLCSR_SPLLERR_MASK), SCG_SPLLCSR_SPLLCM(value)))
#define SCG_BWR_SPLLCSR_SPLLCM(base, value) (BME_BFI32(&SCG_SPLLCSR_REG(base), ((uint32_t)(value) << SCG_SPLLCSR_SPLLCM_SHIFT), SCG_SPLLCSR_SPLLCM_SHIFT, SCG_SPLLCSR_SPLLCM_WIDTH))
/*@}*/

/*!
 * @name Register SCG_SPLLCSR, field SPLLCMRE[17] (RW)
 *
 * Values:
 * - 0b0 - Clock Monitor generates interrupt when error detected
 * - 0b1 - Clock Monitor generates reset when error detected
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLCSR_SPLLCMRE field. */
#define SCG_RD_SPLLCSR_SPLLCMRE(base) ((SCG_SPLLCSR_REG(base) & SCG_SPLLCSR_SPLLCMRE_MASK) >> SCG_SPLLCSR_SPLLCMRE_SHIFT)
#define SCG_BRD_SPLLCSR_SPLLCMRE(base) (BME_UBFX32(&SCG_SPLLCSR_REG(base), SCG_SPLLCSR_SPLLCMRE_SHIFT, SCG_SPLLCSR_SPLLCMRE_WIDTH))

/*! @brief Set the SPLLCMRE field to a new value. */
#define SCG_WR_SPLLCSR_SPLLCMRE(base, value) (SCG_RMW_SPLLCSR(base, (SCG_SPLLCSR_SPLLCMRE_MASK | SCG_SPLLCSR_SPLLERR_MASK), SCG_SPLLCSR_SPLLCMRE(value)))
#define SCG_BWR_SPLLCSR_SPLLCMRE(base, value) (BME_BFI32(&SCG_SPLLCSR_REG(base), ((uint32_t)(value) << SCG_SPLLCSR_SPLLCMRE_SHIFT), SCG_SPLLCSR_SPLLCMRE_SHIFT, SCG_SPLLCSR_SPLLCMRE_WIDTH))
/*@}*/

/*!
 * @name Register SCG_SPLLCSR, field LK[23] (RW)
 *
 * Values:
 * - 0b0 - Control Status Register can be written.
 * - 0b1 - Control Status Register cannot be written until the next System Reset.
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLCSR_LK field. */
#define SCG_RD_SPLLCSR_LK(base) ((SCG_SPLLCSR_REG(base) & SCG_SPLLCSR_LK_MASK) >> SCG_SPLLCSR_LK_SHIFT)
#define SCG_BRD_SPLLCSR_LK(base) (BME_UBFX32(&SCG_SPLLCSR_REG(base), SCG_SPLLCSR_LK_SHIFT, SCG_SPLLCSR_LK_WIDTH))

/*! @brief Set the LK field to a new value. */
#define SCG_WR_SPLLCSR_LK(base, value) (SCG_RMW_SPLLCSR(base, (SCG_SPLLCSR_LK_MASK | SCG_SPLLCSR_SPLLERR_MASK), SCG_SPLLCSR_LK(value)))
#define SCG_BWR_SPLLCSR_LK(base, value) (BME_BFI32(&SCG_SPLLCSR_REG(base), ((uint32_t)(value) << SCG_SPLLCSR_LK_SHIFT), SCG_SPLLCSR_LK_SHIFT, SCG_SPLLCSR_LK_WIDTH))
/*@}*/

/*!
 * @name Register SCG_SPLLCSR, field SPLLVLD[24] (RO)
 *
 * Indicates when the SPLL clock is valid. Disabling the SPLL or a SOSC error
 * when selected as the reference clock to the SPLL will cause the SPLLVLD to clear
 * without setting SPLLERROR.
 *
 * Values:
 * - 0b0 - System PLL is not enabled or clock is not valid
 * - 0b1 - System PLL is enabled and output clock is valid
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLCSR_SPLLVLD field. */
#define SCG_RD_SPLLCSR_SPLLVLD(base) ((SCG_SPLLCSR_REG(base) & SCG_SPLLCSR_SPLLVLD_MASK) >> SCG_SPLLCSR_SPLLVLD_SHIFT)
#define SCG_BRD_SPLLCSR_SPLLVLD(base) (BME_UBFX32(&SCG_SPLLCSR_REG(base), SCG_SPLLCSR_SPLLVLD_SHIFT, SCG_SPLLCSR_SPLLVLD_WIDTH))
/*@}*/

/*!
 * @name Register SCG_SPLLCSR, field SPLLSEL[25] (RO)
 *
 * Values:
 * - 0b0 - System PLL is not the system clock source
 * - 0b1 - System PLL is the system clock source
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLCSR_SPLLSEL field. */
#define SCG_RD_SPLLCSR_SPLLSEL(base) ((SCG_SPLLCSR_REG(base) & SCG_SPLLCSR_SPLLSEL_MASK) >> SCG_SPLLCSR_SPLLSEL_SHIFT)
#define SCG_BRD_SPLLCSR_SPLLSEL(base) (BME_UBFX32(&SCG_SPLLCSR_REG(base), SCG_SPLLCSR_SPLLSEL_SHIFT, SCG_SPLLCSR_SPLLSEL_WIDTH))
/*@}*/

/*!
 * @name Register SCG_SPLLCSR, field SPLLERR[26] (W1C)
 *
 * This flag is reset on Chip POR only, software can also clear this flag by
 * writing a logic one
 *
 * Values:
 * - 0b0 - System PLL Clock Monitor is disabled or has not detected an error
 * - 0b1 - System PLL Clock Monitor is enabled and detected an error. System PLL
 *     Clock Error flag will not set when System OSC is selected as its source
 *     and SOSCERR has set.
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLCSR_SPLLERR field. */
#define SCG_RD_SPLLCSR_SPLLERR(base) ((SCG_SPLLCSR_REG(base) & SCG_SPLLCSR_SPLLERR_MASK) >> SCG_SPLLCSR_SPLLERR_SHIFT)
#define SCG_BRD_SPLLCSR_SPLLERR(base) (BME_UBFX32(&SCG_SPLLCSR_REG(base), SCG_SPLLCSR_SPLLERR_SHIFT, SCG_SPLLCSR_SPLLERR_WIDTH))

/*! @brief Set the SPLLERR field to a new value. */
#define SCG_WR_SPLLCSR_SPLLERR(base, value) (SCG_RMW_SPLLCSR(base, SCG_SPLLCSR_SPLLERR_MASK, SCG_SPLLCSR_SPLLERR(value)))
#define SCG_BWR_SPLLCSR_SPLLERR(base, value) (BME_BFI32(&SCG_SPLLCSR_REG(base), ((uint32_t)(value) << SCG_SPLLCSR_SPLLERR_SHIFT), SCG_SPLLCSR_SPLLERR_SHIFT, SCG_SPLLCSR_SPLLERR_WIDTH))
/*@}*/

/*******************************************************************************
 * SCG_SPLLDIV - System PLL Divide Register
 ******************************************************************************/

/*!
 * @brief SCG_SPLLDIV - System PLL Divide Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * Changes to SPLLDIV should be done when System PLL is disabled to prevent
 * glitches to output divided clock.
 */
/*!
 * @name Constants and macros for entire SCG_SPLLDIV register
 */
/*@{*/
#define SCG_RD_SPLLDIV(base)     (SCG_SPLLDIV_REG(base))
#define SCG_WR_SPLLDIV(base, value) (SCG_SPLLDIV_REG(base) = (value))
#define SCG_RMW_SPLLDIV(base, mask, value) (SCG_WR_SPLLDIV(base, (SCG_RD_SPLLDIV(base) & ~(mask)) | (value)))
#define SCG_SET_SPLLDIV(base, value) (BME_OR32(&SCG_SPLLDIV_REG(base), (uint32_t)(value)))
#define SCG_CLR_SPLLDIV(base, value) (BME_AND32(&SCG_SPLLDIV_REG(base), (uint32_t)(~(value))))
#define SCG_TOG_SPLLDIV(base, value) (BME_XOR32(&SCG_SPLLDIV_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SCG_SPLLDIV bitfields
 */

/*!
 * @name Register SCG_SPLLDIV, field SPLLDIV1[2:0] (RW)
 *
 * Clock divider 1 for System PLL. Used to generate the system clock source used
 * by platform clock modules that need an asynchronous clock source.
 *
 * Values:
 * - 0b000 - Clock disabled
 * - 0b001 - Divide by 1
 * - 0b010 - Divide by 2
 * - 0b011 - Divide by 4
 * - 0b100 - Divide by 8
 * - 0b101 - Divide by 16
 * - 0b110 - Divide by 32
 * - 0b111 - Divide by 64
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLDIV_SPLLDIV1 field. */
#define SCG_RD_SPLLDIV_SPLLDIV1(base) ((SCG_SPLLDIV_REG(base) & SCG_SPLLDIV_SPLLDIV1_MASK) >> SCG_SPLLDIV_SPLLDIV1_SHIFT)
#define SCG_BRD_SPLLDIV_SPLLDIV1(base) (BME_UBFX32(&SCG_SPLLDIV_REG(base), SCG_SPLLDIV_SPLLDIV1_SHIFT, SCG_SPLLDIV_SPLLDIV1_WIDTH))

/*! @brief Set the SPLLDIV1 field to a new value. */
#define SCG_WR_SPLLDIV_SPLLDIV1(base, value) (SCG_RMW_SPLLDIV(base, SCG_SPLLDIV_SPLLDIV1_MASK, SCG_SPLLDIV_SPLLDIV1(value)))
#define SCG_BWR_SPLLDIV_SPLLDIV1(base, value) (BME_BFI32(&SCG_SPLLDIV_REG(base), ((uint32_t)(value) << SCG_SPLLDIV_SPLLDIV1_SHIFT), SCG_SPLLDIV_SPLLDIV1_SHIFT, SCG_SPLLDIV_SPLLDIV1_WIDTH))
/*@}*/

/*!
 * @name Register SCG_SPLLDIV, field SPLLDIV2[10:8] (RW)
 *
 * Clock divider 2 for System PLL.
 *
 * Values:
 * - 0b000 - Clock disabled
 * - 0b001 - Divide by 1
 * - 0b010 - Divide by 2
 * - 0b011 - Divide by 4
 * - 0b100 - Divide by 8
 * - 0b101 - Divide by 16
 * - 0b110 - Divide by 32
 * - 0b111 - Divide by 64
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLDIV_SPLLDIV2 field. */
#define SCG_RD_SPLLDIV_SPLLDIV2(base) ((SCG_SPLLDIV_REG(base) & SCG_SPLLDIV_SPLLDIV2_MASK) >> SCG_SPLLDIV_SPLLDIV2_SHIFT)
#define SCG_BRD_SPLLDIV_SPLLDIV2(base) (BME_UBFX32(&SCG_SPLLDIV_REG(base), SCG_SPLLDIV_SPLLDIV2_SHIFT, SCG_SPLLDIV_SPLLDIV2_WIDTH))

/*! @brief Set the SPLLDIV2 field to a new value. */
#define SCG_WR_SPLLDIV_SPLLDIV2(base, value) (SCG_RMW_SPLLDIV(base, SCG_SPLLDIV_SPLLDIV2_MASK, SCG_SPLLDIV_SPLLDIV2(value)))
#define SCG_BWR_SPLLDIV_SPLLDIV2(base, value) (BME_BFI32(&SCG_SPLLDIV_REG(base), ((uint32_t)(value) << SCG_SPLLDIV_SPLLDIV2_SHIFT), SCG_SPLLDIV_SPLLDIV2_SHIFT, SCG_SPLLDIV_SPLLDIV2_WIDTH))
/*@}*/

/*!
 * @name Register SCG_SPLLDIV, field SPLLDIV3[18:16] (RW)
 *
 * Clock divider 3 for System PLL.
 *
 * Values:
 * - 0b000 - Clock disabled
 * - 0b001 - Divide by 1
 * - 0b010 - Divide by 2
 * - 0b011 - Divide by 4
 * - 0b100 - Divide by 8
 * - 0b101 - Divide by 16
 * - 0b110 - Divide by 32
 * - 0b111 - Divide by 64
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLDIV_SPLLDIV3 field. */
#define SCG_RD_SPLLDIV_SPLLDIV3(base) ((SCG_SPLLDIV_REG(base) & SCG_SPLLDIV_SPLLDIV3_MASK) >> SCG_SPLLDIV_SPLLDIV3_SHIFT)
#define SCG_BRD_SPLLDIV_SPLLDIV3(base) (BME_UBFX32(&SCG_SPLLDIV_REG(base), SCG_SPLLDIV_SPLLDIV3_SHIFT, SCG_SPLLDIV_SPLLDIV3_WIDTH))

/*! @brief Set the SPLLDIV3 field to a new value. */
#define SCG_WR_SPLLDIV_SPLLDIV3(base, value) (SCG_RMW_SPLLDIV(base, SCG_SPLLDIV_SPLLDIV3_MASK, SCG_SPLLDIV_SPLLDIV3(value)))
#define SCG_BWR_SPLLDIV_SPLLDIV3(base, value) (BME_BFI32(&SCG_SPLLDIV_REG(base), ((uint32_t)(value) << SCG_SPLLDIV_SPLLDIV3_SHIFT), SCG_SPLLDIV_SPLLDIV3_SHIFT, SCG_SPLLDIV_SPLLDIV3_WIDTH))
/*@}*/

