pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * SCG_SPLLCFG - System PLL Configuration Register
 ******************************************************************************/

/*!
 * @brief SCG_SPLLCFG - System PLL Configuration Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The SPLLCFG register cannot be changed when the System PLL is enabled. When
 * the System PLL is enabled, writes to this register are ignored, and there is no
 * transfer error.
 */
/*!
 * @name Constants and macros for entire SCG_SPLLCFG register
 */
/*@{*/
#define SCG_RD_SPLLCFG(base)     (SCG_SPLLCFG_REG(base))
#define SCG_WR_SPLLCFG(base, value) (SCG_SPLLCFG_REG(base) = (value))
#define SCG_RMW_SPLLCFG(base, mask, value) (SCG_WR_SPLLCFG(base, (SCG_RD_SPLLCFG(base) & ~(mask)) | (value)))
#define SCG_SET_SPLLCFG(base, value) (BME_OR32(&SCG_SPLLCFG_REG(base), (uint32_t)(value)))
#define SCG_CLR_SPLLCFG(base, value) (BME_AND32(&SCG_SPLLCFG_REG(base), (uint32_t)(~(value))))
#define SCG_TOG_SPLLCFG(base, value) (BME_XOR32(&SCG_SPLLCFG_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SCG_SPLLCFG bitfields
 */

/*!
 * @name Register SCG_SPLLCFG, field SOURCE[0] (RW)
 *
 * Configures the input clock source for the System PLL.
 *
 * Values:
 * - 0b0 - System OSC
 * - 0b1 - Fast IRC
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLCFG_SOURCE field. */
#define SCG_RD_SPLLCFG_SOURCE(base) ((SCG_SPLLCFG_REG(base) & SCG_SPLLCFG_SOURCE_MASK) >> SCG_SPLLCFG_SOURCE_SHIFT)
#define SCG_BRD_SPLLCFG_SOURCE(base) (BME_UBFX32(&SCG_SPLLCFG_REG(base), SCG_SPLLCFG_SOURCE_SHIFT, SCG_SPLLCFG_SOURCE_WIDTH))

/*! @brief Set the SOURCE field to a new value. */
#define SCG_WR_SPLLCFG_SOURCE(base, value) (SCG_RMW_SPLLCFG(base, SCG_SPLLCFG_SOURCE_MASK, SCG_SPLLCFG_SOURCE(value)))
#define SCG_BWR_SPLLCFG_SOURCE(base, value) (BME_BFI32(&SCG_SPLLCFG_REG(base), ((uint32_t)(value) << SCG_SPLLCFG_SOURCE_SHIFT), SCG_SPLLCFG_SOURCE_SHIFT, SCG_SPLLCFG_SOURCE_WIDTH))
/*@}*/

/*!
 * @name Register SCG_SPLLCFG, field PREDIV[10:8] (RW)
 *
 * Selects the amount to divide down the reference clock for the System PLL. The
 * resulting frequency must be in the range of 8 MHz to 32 MHz. System PLL
 * Reference Divide Factor PERDIV Divide Factor 000 1 001 2 010 3 011 4 100 5 101 6
 * 110 7 111 8
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLCFG_PREDIV field. */
#define SCG_RD_SPLLCFG_PREDIV(base) ((SCG_SPLLCFG_REG(base) & SCG_SPLLCFG_PREDIV_MASK) >> SCG_SPLLCFG_PREDIV_SHIFT)
#define SCG_BRD_SPLLCFG_PREDIV(base) (BME_UBFX32(&SCG_SPLLCFG_REG(base), SCG_SPLLCFG_PREDIV_SHIFT, SCG_SPLLCFG_PREDIV_WIDTH))

/*! @brief Set the PREDIV field to a new value. */
#define SCG_WR_SPLLCFG_PREDIV(base, value) (SCG_RMW_SPLLCFG(base, SCG_SPLLCFG_PREDIV_MASK, SCG_SPLLCFG_PREDIV(value)))
#define SCG_BWR_SPLLCFG_PREDIV(base, value) (BME_BFI32(&SCG_SPLLCFG_REG(base), ((uint32_t)(value) << SCG_SPLLCFG_PREDIV_SHIFT), SCG_SPLLCFG_PREDIV_SHIFT, SCG_SPLLCFG_PREDIV_WIDTH))
/*@}*/

/*!
 * @name Register SCG_SPLLCFG, field MULT[20:16] (RW)
 *
 * Multiplier for the System PLL. The MULT bits establish the multiplication
 * factor applied to the PLL reference clock frequency. PLL VCO Multiply Factor MULT
 * Multiply Factor MULT Multiply Factor MULT Multiply Factor MULT Multiply
 * Factor 00000 16 01000 24 10000 32 11000 40 00001 17 01001 25 10001 33 11001 41
 * 00010 18 01010 26 10010 34 11010 42 00011 19 01011 27 10011 35 11011 43 00100 20
 * 01100 28 10100 36 11100 44 00101 21 01101 29 10101 37 11101 45 00110 22 01110
 * 30 10110 38 11110 46 00111 23 01111 31 10111 39 11111 47
 */
/*@{*/
/*! @brief Read current value of the SCG_SPLLCFG_MULT field. */
#define SCG_RD_SPLLCFG_MULT(base) ((SCG_SPLLCFG_REG(base) & SCG_SPLLCFG_MULT_MASK) >> SCG_SPLLCFG_MULT_SHIFT)
#define SCG_BRD_SPLLCFG_MULT(base) (BME_UBFX32(&SCG_SPLLCFG_REG(base), SCG_SPLLCFG_MULT_SHIFT, SCG_SPLLCFG_MULT_WIDTH))

/*! @brief Set the MULT field to a new value. */
#define SCG_WR_SPLLCFG_MULT(base, value) (SCG_RMW_SPLLCFG(base, SCG_SPLLCFG_MULT_MASK, SCG_SPLLCFG_MULT(value)))
#define SCG_BWR_SPLLCFG_MULT(base, value) (BME_BFI32(&SCG_SPLLCFG_REG(base), ((uint32_t)(value) << SCG_SPLLCFG_MULT_SHIFT), SCG_SPLLCFG_MULT_SHIFT, SCG_SPLLCFG_MULT_WIDTH))
/*@}*/

/*
 * MKL28Z7 SEMA42
 *
 * SEMA42
 *
 * Registers defined in this header file:
 * - SEMA42_GATE3 - Gate Register
 * - SEMA42_GATE2 - Gate Register
 * - SEMA42_GATE1 - Gate Register
 * - SEMA42_GATE0 - Gate Register
 * - SEMA42_GATE7 - Gate Register
 * - SEMA42_GATE6 - Gate Register
 * - SEMA42_GATE5 - Gate Register
 * - SEMA42_GATE4 - Gate Register
 * - SEMA42_GATE11 - Gate Register
 * - SEMA42_GATE10 - Gate Register
 * - SEMA42_GATE9 - Gate Register
 * - SEMA42_GATE8 - Gate Register
 * - SEMA42_GATE15 - Gate Register
 * - SEMA42_GATE14 - Gate Register
 * - SEMA42_GATE13 - Gate Register
 * - SEMA42_GATE12 - Gate Register
 * - SEMA42_RSTGT_R - Reset Gate Read
 * - SEMA42_RSTGT_W - Reset Gate Write
 */

#define SEMA42_INSTANCE_COUNT (2U) /*!< Number of instances of the SEMA42 module. */
#define SEMA420_IDX (0U) /*!< Instance number for SEMA420. */
#define SEMA421_IDX (1U) /*!< Instance number for SEMA421. */

/*******************************************************************************
 * SEMA42_GATE3 - Gate Register
 ******************************************************************************/

/*!
 * @brief SEMA42_GATE3 - Gate Register (RW)
 *
 * Reset value: 0x00U
 *
 * Each semaphore gate is implemented in a 4-bit finite state machine,
 * right-justified in a byte data structure. The hardware uses the logical bus master
 * number in conjunction with the data patterns to validate all attempted write
 * operations. Only processor bus masters can modify the gate registers. Once locked,
 * a gate can (and must) be opened (unlocked) by the locking processor core.
 * Multiple gate values can be read in a single access, but only a single gate can be
 * updated via a write operation at a time. Attempted writes with a data value
 * that is neither the unlock value (0x00) nor the appropriate lock value
 * (processor_number + 1) are simply treated as "no operation" and do not affect any gate
 * state. Attempts to write multiple gates in a single aligned access with a
 * size larger than an 8-bit (byte) reference generate an error termination and do
 * not allow any gate state changes.
 */
/*!
 * @name Constants and macros for entire SEMA42_GATE3 register
 */
/*@{*/
#define SEMA42_RD_GATE3(base)    (SEMA42_GATE3_REG(base))
#define SEMA42_WR_GATE3(base, value) (SEMA42_GATE3_REG(base) = (value))
#define SEMA42_RMW_GATE3(base, mask, value) (SEMA42_WR_GATE3(base, (SEMA42_RD_GATE3(base) & ~(mask)) | (value)))
#define SEMA42_SET_GATE3(base, value) (BME_OR8(&SEMA42_GATE3_REG(base), (uint8_t)(value)))
#define SEMA42_CLR_GATE3(base, value) (BME_AND8(&SEMA42_GATE3_REG(base), (uint8_t)(~(value))))
#define SEMA42_TOG_GATE3(base, value) (BME_XOR8(&SEMA42_GATE3_REG(base), (uint8_t)(value)))
/*@}*/

