pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * Constants & macros for individual SEMA42_GATE11 bitfields
 */

/*!
 * @name Register SEMA42_GATE11, field GTFSM[3:0] (RW)
 *
 * The state of the gate reflects the last processor that locked it, which can
 * be useful during system debug. The hardware gate is maintained in a 16-state
 * implementation, defined as:
 *
 * Values:
 * - 0b0000 - The gate is unlocked (free).
 * - 0b0001 - The gate has been locked by processor 0.
 * - 0b0010 - The gate has been locked by processor 1.
 * - 0b0011 - The gate has been locked by processor 2.
 * - 0b0100 - The gate has been locked by processor 3.
 * - 0b0101 - The gate has been locked by processor 4.
 * - 0b0110 - The gate has been locked by processor 5.
 * - 0b0111 - The gate has been locked by processor 6.
 * - 0b1000 - The gate has been locked by processor 7.
 * - 0b1001 - The gate has been locked by processor 8.
 * - 0b1010 - The gate has been locked by processor 9.
 * - 0b1011 - The gate has been locked by processor 10.
 * - 0b1100 - The gate has been locked by processor 11.
 * - 0b1101 - The gate has been locked by processor 12.
 * - 0b1110 - The gate has been locked by processor 13.
 * - 0b1111 - The gate has been locked by processor 14.
 */
/*@{*/
/*! @brief Read current value of the SEMA42_GATE11_GTFSM field. */
#define SEMA42_RD_GATE11_GTFSM(base) ((SEMA42_GATE11_REG(base) & SEMA42_GATE11_GTFSM_MASK) >> SEMA42_GATE11_GTFSM_SHIFT)
#define SEMA42_BRD_GATE11_GTFSM(base) (BME_UBFX8(&SEMA42_GATE11_REG(base), SEMA42_GATE11_GTFSM_SHIFT, SEMA42_GATE11_GTFSM_WIDTH))

/*! @brief Set the GTFSM field to a new value. */
#define SEMA42_WR_GATE11_GTFSM(base, value) (SEMA42_RMW_GATE11(base, SEMA42_GATE11_GTFSM_MASK, SEMA42_GATE11_GTFSM(value)))
#define SEMA42_BWR_GATE11_GTFSM(base, value) (BME_BFI8(&SEMA42_GATE11_REG(base), ((uint8_t)(value) << SEMA42_GATE11_GTFSM_SHIFT), SEMA42_GATE11_GTFSM_SHIFT, SEMA42_GATE11_GTFSM_WIDTH))
/*@}*/

/*******************************************************************************
 * SEMA42_GATE10 - Gate Register
 ******************************************************************************/

/*!
 * @brief SEMA42_GATE10 - Gate Register (RW)
 *
 * Reset value: 0x00U
 *
 * Each semaphore gate is implemented in a 4-bit finite state machine,
 * right-justified in a byte data structure. The hardware uses the logical bus master
 * number in conjunction with the data patterns to validate all attempted write
 * operations. Only processor bus masters can modify the gate registers. Once locked,
 * a gate can (and must) be opened (unlocked) by the locking processor core.
 * Multiple gate values can be read in a single access, but only a single gate can be
 * updated via a write operation at a time. Attempted writes with a data value
 * that is neither the unlock value (0x00) nor the appropriate lock value
 * (processor_number + 1) are simply treated as "no operation" and do not affect any gate
 * state. Attempts to write multiple gates in a single aligned access with a
 * size larger than an 8-bit (byte) reference generate an error termination and do
 * not allow any gate state changes.
 */
/*!
 * @name Constants and macros for entire SEMA42_GATE10 register
 */
/*@{*/
#define SEMA42_RD_GATE10(base)   (SEMA42_GATE10_REG(base))
#define SEMA42_WR_GATE10(base, value) (SEMA42_GATE10_REG(base) = (value))
#define SEMA42_RMW_GATE10(base, mask, value) (SEMA42_WR_GATE10(base, (SEMA42_RD_GATE10(base) & ~(mask)) | (value)))
#define SEMA42_SET_GATE10(base, value) (BME_OR8(&SEMA42_GATE10_REG(base), (uint8_t)(value)))
#define SEMA42_CLR_GATE10(base, value) (BME_AND8(&SEMA42_GATE10_REG(base), (uint8_t)(~(value))))
#define SEMA42_TOG_GATE10(base, value) (BME_XOR8(&SEMA42_GATE10_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SEMA42_GATE10 bitfields
 */

/*!
 * @name Register SEMA42_GATE10, field GTFSM[3:0] (RW)
 *
 * The state of the gate reflects the last processor that locked it, which can
 * be useful during system debug. The hardware gate is maintained in a 16-state
 * implementation, defined as:
 *
 * Values:
 * - 0b0000 - The gate is unlocked (free).
 * - 0b0001 - The gate has been locked by processor 0.
 * - 0b0010 - The gate has been locked by processor 1.
 * - 0b0011 - The gate has been locked by processor 2.
 * - 0b0100 - The gate has been locked by processor 3.
 * - 0b0101 - The gate has been locked by processor 4.
 * - 0b0110 - The gate has been locked by processor 5.
 * - 0b0111 - The gate has been locked by processor 6.
 * - 0b1000 - The gate has been locked by processor 7.
 * - 0b1001 - The gate has been locked by processor 8.
 * - 0b1010 - The gate has been locked by processor 9.
 * - 0b1011 - The gate has been locked by processor 10.
 * - 0b1100 - The gate has been locked by processor 11.
 * - 0b1101 - The gate has been locked by processor 12.
 * - 0b1110 - The gate has been locked by processor 13.
 * - 0b1111 - The gate has been locked by processor 14.
 */
/*@{*/
/*! @brief Read current value of the SEMA42_GATE10_GTFSM field. */
#define SEMA42_RD_GATE10_GTFSM(base) ((SEMA42_GATE10_REG(base) & SEMA42_GATE10_GTFSM_MASK) >> SEMA42_GATE10_GTFSM_SHIFT)
#define SEMA42_BRD_GATE10_GTFSM(base) (BME_UBFX8(&SEMA42_GATE10_REG(base), SEMA42_GATE10_GTFSM_SHIFT, SEMA42_GATE10_GTFSM_WIDTH))

/*! @brief Set the GTFSM field to a new value. */
#define SEMA42_WR_GATE10_GTFSM(base, value) (SEMA42_RMW_GATE10(base, SEMA42_GATE10_GTFSM_MASK, SEMA42_GATE10_GTFSM(value)))
#define SEMA42_BWR_GATE10_GTFSM(base, value) (BME_BFI8(&SEMA42_GATE10_REG(base), ((uint8_t)(value) << SEMA42_GATE10_GTFSM_SHIFT), SEMA42_GATE10_GTFSM_SHIFT, SEMA42_GATE10_GTFSM_WIDTH))
/*@}*/

/*******************************************************************************
 * SEMA42_GATE9 - Gate Register
 ******************************************************************************/

/*!
 * @brief SEMA42_GATE9 - Gate Register (RW)
 *
 * Reset value: 0x00U
 *
 * Each semaphore gate is implemented in a 4-bit finite state machine,
 * right-justified in a byte data structure. The hardware uses the logical bus master
 * number in conjunction with the data patterns to validate all attempted write
 * operations. Only processor bus masters can modify the gate registers. Once locked,
 * a gate can (and must) be opened (unlocked) by the locking processor core.
 * Multiple gate values can be read in a single access, but only a single gate can be
 * updated via a write operation at a time. Attempted writes with a data value
 * that is neither the unlock value (0x00) nor the appropriate lock value
 * (processor_number + 1) are simply treated as "no operation" and do not affect any gate
 * state. Attempts to write multiple gates in a single aligned access with a
 * size larger than an 8-bit (byte) reference generate an error termination and do
 * not allow any gate state changes.
 */
/*!
 * @name Constants and macros for entire SEMA42_GATE9 register
 */
/*@{*/
#define SEMA42_RD_GATE9(base)    (SEMA42_GATE9_REG(base))
#define SEMA42_WR_GATE9(base, value) (SEMA42_GATE9_REG(base) = (value))
#define SEMA42_RMW_GATE9(base, mask, value) (SEMA42_WR_GATE9(base, (SEMA42_RD_GATE9(base) & ~(mask)) | (value)))
#define SEMA42_SET_GATE9(base, value) (BME_OR8(&SEMA42_GATE9_REG(base), (uint8_t)(value)))
#define SEMA42_CLR_GATE9(base, value) (BME_AND8(&SEMA42_GATE9_REG(base), (uint8_t)(~(value))))
#define SEMA42_TOG_GATE9(base, value) (BME_XOR8(&SEMA42_GATE9_REG(base), (uint8_t)(value)))
/*@}*/

