pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * Constants & macros for individual SEMA42_RSTGT_R bitfields
 */

/*!
 * @name Register SEMA42_RSTGT_R, field RSTGTN[7:0] (RW)
 *
 * Reset Gate Number. This 8-bit field specifies the specific hardware gate to
 * be reset. This field is updated by the second write. If RSTGTN < 64, then reset
 * the single gate defined by RSTGTN, else reset all the gates.
 */
/*@{*/
/*! @brief Read current value of the SEMA42_RSTGT_R_RSTGTN field. */
#define SEMA42_RD_RSTGT_R_RSTGTN(base) ((SEMA42_RSTGT_R_REG(base) & SEMA42_RSTGT_R_RSTGTN_MASK) >> SEMA42_RSTGT_R_RSTGTN_SHIFT)
#define SEMA42_BRD_RSTGT_R_RSTGTN(base) (BME_UBFX16(&SEMA42_RSTGT_R_REG(base), SEMA42_RSTGT_R_RSTGTN_SHIFT, SEMA42_RSTGT_R_RSTGTN_WIDTH))

/*! @brief Set the RSTGTN field to a new value. */
#define SEMA42_WR_RSTGT_R_RSTGTN(base, value) (SEMA42_RMW_RSTGT_R(base, SEMA42_RSTGT_R_RSTGTN_MASK, SEMA42_RSTGT_R_RSTGTN(value)))
#define SEMA42_BWR_RSTGT_R_RSTGTN(base, value) (BME_BFI16(&SEMA42_RSTGT_R_REG(base), ((uint16_t)(value) << SEMA42_RSTGT_R_RSTGTN_SHIFT), SEMA42_RSTGT_R_RSTGTN_SHIFT, SEMA42_RSTGT_R_RSTGTN_WIDTH))
/*@}*/

/*!
 * @name Register SEMA42_RSTGT_R, field RSTGMS[11:8] (RO)
 *
 * Reset Gate Bus Master. This 4-bit read-only field records the logical number
 * of the bus master performing the gate reset function. The logical number is
 * the domain number. This domain number is determined by the Extended Resource
 * Domain Controller's Master Domain Assignment Controller (XRDA_MDAC). The reset
 * function requires that the two consecutive writes to this register must be
 * initiated by the same bus master to succeed. This field is updated each time a
 * write to this register occurs. The association between system bus master port
 * numbers, the associated bus master device, and the logical processor number is
 * SoC-specific. Consult the device reference manual for this information.
 */
/*@{*/
/*! @brief Read current value of the SEMA42_RSTGT_R_RSTGMS field. */
#define SEMA42_RD_RSTGT_R_RSTGMS(base) ((SEMA42_RSTGT_R_REG(base) & SEMA42_RSTGT_R_RSTGMS_MASK) >> SEMA42_RSTGT_R_RSTGMS_SHIFT)
#define SEMA42_BRD_RSTGT_R_RSTGMS(base) (BME_UBFX16(&SEMA42_RSTGT_R_REG(base), SEMA42_RSTGT_R_RSTGMS_SHIFT, SEMA42_RSTGT_R_RSTGMS_WIDTH))
/*@}*/

/*!
 * @name Register SEMA42_RSTGT_R, field RSTGSM[13:12] (RO)
 *
 * Reset Gate Finite State Machine. Reads of the SEMA42_RSTGT register return
 * the encoded state machine value. Note the RSTGSM = 10 state is valid for only a
 * single machine cycle, so it is impossible for a read to return this value. The
 * reset state machine is maintained in a 2-bit, 3-state implementation, defined
 * as:
 *
 * Values:
 * - 0b00 - Idle, waiting for the first data pattern write.
 * - 0b01 - Waiting for the second data pattern write.
 * - 0b10 - The 2-write sequence has completed. Generate the specified gate
 *     reset(s). After the reset is performed, this machine returns to the idle
 *     (waiting for first data pattern write) state. The "01" state persists for only
 *     one clock cycle. Software cannot observe this state.
 * - 0b11 - This state encoding is never used and therefore reserved.
 */
/*@{*/
/*! @brief Read current value of the SEMA42_RSTGT_R_RSTGSM field. */
#define SEMA42_RD_RSTGT_R_RSTGSM(base) ((SEMA42_RSTGT_R_REG(base) & SEMA42_RSTGT_R_RSTGSM_MASK) >> SEMA42_RSTGT_R_RSTGSM_SHIFT)
#define SEMA42_BRD_RSTGT_R_RSTGSM(base) (BME_UBFX16(&SEMA42_RSTGT_R_REG(base), SEMA42_RSTGT_R_RSTGSM_SHIFT, SEMA42_RSTGT_R_RSTGSM_WIDTH))
/*@}*/

/*******************************************************************************
 * SEMA42_RSTGT_W - Reset Gate Write
 ******************************************************************************/

/*!
 * @brief SEMA42_RSTGT_W - Reset Gate Write (RW)
 *
 * Reset value: 0x0000U
 *
 * Although the intent of the hardware gate implementation specifies a protocol
 * where the locking processor must unlock the gate, it is recognized that system
 * operation may require a reset function to re-initialize the state of any
 * gate(s) without requiring a system-level reset. To support this special gate reset
 * requirement, the Semaphores module implements a "secure" reset mechanism that
 * allows a hardware gate (or all the gates) to be initialized by following a
 * specific dual-write access pattern. Using a technique similar to that required
 * for the servicing of a software watchdog timer, the secure gate reset requires
 * two consecutive writes with predefined data patterns from the same processor
 * to force the clearing of the specified gate(s). The required access pattern is:
 * A processor performs a 16-bit write to the SEMA42_RSTGT memory location. The
 * most significant byte (SEMA42_RSTGT[RSTGDP]) must be 0xE2; the least
 * significant byte is a "don't_care" for this reference. The same processor then performs
 * a second 16-bit write to the SEMA42_RSTGT location. For this write, the upper
 * byte (SEMA42_RSTGT[RSTGDP]) is the logical complement of the first data
 * pattern (0x1D) and the lower byte (SEMA42_RSTGT[RSTGTN]) specifies the gate(s) to
 * be reset. This gate field can specify a single gate be cleared, or in the case
 * where SEMA42_RSTGT[RSTGTN] = 64 or greater, all gates are to be cleared. If
 * the same processor writes incorrect data on the second access or another
 * processor performs the second write access, the special gate reset sequence is
 * aborted and no error signal is asserted. Reads of the SEMA42_RSTGT location return
 * information on the 2-bit state machine (SEMA42_RSTGT[RSTGSM]) that implements
 * this function, the bus master performing the reset (SEMA42_RSTGT[RSTGMS], and
 * the gate number(s) last cleared (SEMA42_RSTGT[RSTGTN]). Reads of the
 * SEMA42_RSTGT register do not affect the secure reset finite state machine in any manner.
 */
/*!
 * @name Constants and macros for entire SEMA42_RSTGT_W register
 */
/*@{*/
#define SEMA42_RD_RSTGT_W(base)  (SEMA42_RSTGT_W_REG(base))
#define SEMA42_WR_RSTGT_W(base, value) (SEMA42_RSTGT_W_REG(base) = (value))
#define SEMA42_RMW_RSTGT_W(base, mask, value) (SEMA42_WR_RSTGT_W(base, (SEMA42_RD_RSTGT_W(base) & ~(mask)) | (value)))
#define SEMA42_SET_RSTGT_W(base, value) (BME_OR16(&SEMA42_RSTGT_W_REG(base), (uint16_t)(value)))
#define SEMA42_CLR_RSTGT_W(base, value) (BME_AND16(&SEMA42_RSTGT_W_REG(base), (uint16_t)(~(value))))
#define SEMA42_TOG_RSTGT_W(base, value) (BME_XOR16(&SEMA42_RSTGT_W_REG(base), (uint16_t)(value)))
/*@}*/

