pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * SIM_UIDMH - Unique Identification Register Mid-High
 ******************************************************************************/

/*!
 * @brief SIM_UIDMH - Unique Identification Register Mid-High (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_UIDMH register
 */
/*@{*/
#define SIM_RD_UIDMH(base)       (SIM_UIDMH_REG(base))
/*@}*/

/*
 * Constants & macros for individual SIM_UIDMH bitfields
 */

/*!
 * @name Register SIM_UIDMH, field UID[15:0] (RO)
 *
 * Unique identification for the device.
 */
/*@{*/
/*! @brief Read current value of the SIM_UIDMH_UID field. */
#define SIM_RD_UIDMH_UID(base) ((SIM_UIDMH_REG(base) & SIM_UIDMH_UID_MASK) >> SIM_UIDMH_UID_SHIFT)
#define SIM_BRD_UIDMH_UID(base) (SIM_RD_UIDMH_UID(base))
/*@}*/

/*******************************************************************************
 * SIM_UIDML - Unique Identification Register Mid Low
 ******************************************************************************/

/*!
 * @brief SIM_UIDML - Unique Identification Register Mid Low (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_UIDML register
 */
/*@{*/
#define SIM_RD_UIDML(base)       (SIM_UIDML_REG(base))
/*@}*/

/*******************************************************************************
 * SIM_UIDL - Unique Identification Register Low
 ******************************************************************************/

/*!
 * @brief SIM_UIDL - Unique Identification Register Low (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_UIDL register
 */
/*@{*/
#define SIM_RD_UIDL(base)        (SIM_UIDL_REG(base))
/*@}*/

/*
 * MKL28Z7 SMC
 *
 * System Mode Controller
 *
 * Registers defined in this header file:
 * - SMC_VERID - SMC Version ID Register
 * - SMC_PARAM - SMC Parameter Register
 * - SMC_PMPROT - Power Mode Protection register
 * - SMC_PMCTRL - Power Mode Control register
 * - SMC_STOPCTRL - Stop Control Register
 * - SMC_PMSTAT - Power Mode Status register
 */

#define SMC_INSTANCE_COUNT (1U) /*!< Number of instances of the SMC module. */
#define SMC_IDX (0U) /*!< Instance number for SMC. */

/*******************************************************************************
 * SMC_VERID - SMC Version ID Register
 ******************************************************************************/

/*!
 * @brief SMC_VERID - SMC Version ID Register (RO)
 *
 * Reset value: 0x01000000U
 */
/*!
 * @name Constants and macros for entire SMC_VERID register
 */
/*@{*/
#define SMC_RD_VERID(base)       (SMC_VERID_REG(base))
/*@}*/

/*
 * Constants & macros for individual SMC_VERID bitfields
 */

/*!
 * @name Register SMC_VERID, field FEATURE[15:0] (RO)
 *
 * This read only field returns the feature set number.
 *
 * Values:
 * - 0b0000000000000000 - Standard features implemented
 */
/*@{*/
/*! @brief Read current value of the SMC_VERID_FEATURE field. */
#define SMC_RD_VERID_FEATURE(base) ((SMC_VERID_REG(base) & SMC_VERID_FEATURE_MASK) >> SMC_VERID_FEATURE_SHIFT)
#define SMC_BRD_VERID_FEATURE(base) (SMC_RD_VERID_FEATURE(base))
/*@}*/

/*!
 * @name Register SMC_VERID, field MINOR[23:16] (RO)
 *
 * This read only field returns the minor version number for the module
 * specification.
 */
/*@{*/
/*! @brief Read current value of the SMC_VERID_MINOR field. */
#define SMC_RD_VERID_MINOR(base) ((SMC_VERID_REG(base) & SMC_VERID_MINOR_MASK) >> SMC_VERID_MINOR_SHIFT)
#define SMC_BRD_VERID_MINOR(base) (BME_UBFX32(&SMC_VERID_REG(base), SMC_VERID_MINOR_SHIFT, SMC_VERID_MINOR_WIDTH))
/*@}*/

/*!
 * @name Register SMC_VERID, field MAJOR[31:24] (RO)
 *
 * This read only field returns the major version number for the module
 * specification.
 */
/*@{*/
/*! @brief Read current value of the SMC_VERID_MAJOR field. */
#define SMC_RD_VERID_MAJOR(base) ((SMC_VERID_REG(base) & SMC_VERID_MAJOR_MASK) >> SMC_VERID_MAJOR_SHIFT)
#define SMC_BRD_VERID_MAJOR(base) (BME_UBFX32(&SMC_VERID_REG(base), SMC_VERID_MAJOR_SHIFT, SMC_VERID_MAJOR_WIDTH))
/*@}*/

/*******************************************************************************
 * SMC_PARAM - SMC Parameter Register
 ******************************************************************************/

/*!
 * @brief SMC_PARAM - SMC Parameter Register (RO)
 *
 * Reset value: 0x00000069U
 */
/*!
 * @name Constants and macros for entire SMC_PARAM register
 */
/*@{*/
#define SMC_RD_PARAM(base)       (SMC_PARAM_REG(base))
/*@}*/

/*
 * Constants & macros for individual SMC_PARAM bitfields
 */

/*!
 * @name Register SMC_PARAM, field EHSRUN[0] (RO)
 *
 * HSRUN mode enabled
 */
/*@{*/
/*! @brief Read current value of the SMC_PARAM_EHSRUN field. */
#define SMC_RD_PARAM_EHSRUN(base) ((SMC_PARAM_REG(base) & SMC_PARAM_EHSRUN_MASK) >> SMC_PARAM_EHSRUN_SHIFT)
#define SMC_BRD_PARAM_EHSRUN(base) (BME_UBFX32(&SMC_PARAM_REG(base), SMC_PARAM_EHSRUN_SHIFT, SMC_PARAM_EHSRUN_WIDTH))
/*@}*/

/*!
 * @name Register SMC_PARAM, field ELLS[3] (RO)
 *
 * LLS mode enabled
 */
/*@{*/
/*! @brief Read current value of the SMC_PARAM_ELLS field. */
#define SMC_RD_PARAM_ELLS(base) ((SMC_PARAM_REG(base) & SMC_PARAM_ELLS_MASK) >> SMC_PARAM_ELLS_SHIFT)
#define SMC_BRD_PARAM_ELLS(base) (BME_UBFX32(&SMC_PARAM_REG(base), SMC_PARAM_ELLS_SHIFT, SMC_PARAM_ELLS_WIDTH))
/*@}*/

/*!
 * @name Register SMC_PARAM, field ELLS2[5] (RO)
 *
 * LLS2 mode enabled
 */
/*@{*/
/*! @brief Read current value of the SMC_PARAM_ELLS2 field. */
#define SMC_RD_PARAM_ELLS2(base) ((SMC_PARAM_REG(base) & SMC_PARAM_ELLS2_MASK) >> SMC_PARAM_ELLS2_SHIFT)
#define SMC_BRD_PARAM_ELLS2(base) (BME_UBFX32(&SMC_PARAM_REG(base), SMC_PARAM_ELLS2_SHIFT, SMC_PARAM_ELLS2_WIDTH))
/*@}*/

/*!
 * @name Register SMC_PARAM, field EVLLS0[6] (RO)
 *
 * VLLS0 mode enabled
 */
/*@{*/
/*! @brief Read current value of the SMC_PARAM_EVLLS0 field. */
#define SMC_RD_PARAM_EVLLS0(base) ((SMC_PARAM_REG(base) & SMC_PARAM_EVLLS0_MASK) >> SMC_PARAM_EVLLS0_SHIFT)
#define SMC_BRD_PARAM_EVLLS0(base) (BME_UBFX32(&SMC_PARAM_REG(base), SMC_PARAM_EVLLS0_SHIFT, SMC_PARAM_EVLLS0_WIDTH))
/*@}*/

