pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * MKL28Z7 TRGMUX
 *
 *
 *
 * Registers defined in this header file:
 * - TRGMUX_TRGCFG - TRGMUX TRGCFG Register
 */

#define TRGMUX_INSTANCE_COUNT (2U) /*!< Number of instances of the TRGMUX module. */
#define TRGMUX0_IDX (0U) /*!< Instance number for TRGMUX0. */
#define TRGMUX1_IDX (1U) /*!< Instance number for TRGMUX1. */

/*******************************************************************************
 * TRGMUX_TRGCFG - TRGMUX TRGCFG Register
 ******************************************************************************/

/*!
 * @brief TRGMUX_TRGCFG - TRGMUX TRGCFG Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire TRGMUX_TRGCFG register
 */
/*@{*/
#define TRGMUX_RD_TRGCFG(base, index) (TRGMUX_TRGCFG_REG(base, index))
#define TRGMUX_WR_TRGCFG(base, index, value) (TRGMUX_TRGCFG_REG(base, index) = (value))
#define TRGMUX_RMW_TRGCFG(base, index, mask, value) (TRGMUX_WR_TRGCFG(base, index, (TRGMUX_RD_TRGCFG(base, index) & ~(mask)) | (value)))
#define TRGMUX_SET_TRGCFG(base, index, value) (BME_OR32(&TRGMUX_TRGCFG_REG(base, index), (uint32_t)(value)))
#define TRGMUX_CLR_TRGCFG(base, index, value) (BME_AND32(&TRGMUX_TRGCFG_REG(base, index), (uint32_t)(~(value))))
#define TRGMUX_TOG_TRGCFG(base, index, value) (BME_XOR32(&TRGMUX_TRGCFG_REG(base, index), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual TRGMUX_TRGCFG bitfields
 */

/*!
 * @name Register TRGMUX_TRGCFG, field SEL0[5:0] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 0. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_TRGCFG_SEL0 field. */
#define TRGMUX_RD_TRGCFG_SEL0(base, index) ((TRGMUX_TRGCFG_REG(base, index) & TRGMUX_TRGCFG_SEL0_MASK) >> TRGMUX_TRGCFG_SEL0_SHIFT)
#define TRGMUX_BRD_TRGCFG_SEL0(base, index) (BME_UBFX32(&TRGMUX_TRGCFG_REG(base, index), TRGMUX_TRGCFG_SEL0_SHIFT, TRGMUX_TRGCFG_SEL0_WIDTH))

/*! @brief Set the SEL0 field to a new value. */
#define TRGMUX_WR_TRGCFG_SEL0(base, index, value) (TRGMUX_RMW_TRGCFG(base, index, TRGMUX_TRGCFG_SEL0_MASK, TRGMUX_TRGCFG_SEL0(value)))
#define TRGMUX_BWR_TRGCFG_SEL0(base, index, value) (BME_BFI32(&TRGMUX_TRGCFG_REG(base, index), ((uint32_t)(value) << TRGMUX_TRGCFG_SEL0_SHIFT), TRGMUX_TRGCFG_SEL0_SHIFT, TRGMUX_TRGCFG_SEL0_WIDTH))
/*@}*/

/*!
 * @name Register TRGMUX_TRGCFG, field SEL1[13:8] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 1. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_TRGCFG_SEL1 field. */
#define TRGMUX_RD_TRGCFG_SEL1(base, index) ((TRGMUX_TRGCFG_REG(base, index) & TRGMUX_TRGCFG_SEL1_MASK) >> TRGMUX_TRGCFG_SEL1_SHIFT)
#define TRGMUX_BRD_TRGCFG_SEL1(base, index) (BME_UBFX32(&TRGMUX_TRGCFG_REG(base, index), TRGMUX_TRGCFG_SEL1_SHIFT, TRGMUX_TRGCFG_SEL1_WIDTH))

/*! @brief Set the SEL1 field to a new value. */
#define TRGMUX_WR_TRGCFG_SEL1(base, index, value) (TRGMUX_RMW_TRGCFG(base, index, TRGMUX_TRGCFG_SEL1_MASK, TRGMUX_TRGCFG_SEL1(value)))
#define TRGMUX_BWR_TRGCFG_SEL1(base, index, value) (BME_BFI32(&TRGMUX_TRGCFG_REG(base, index), ((uint32_t)(value) << TRGMUX_TRGCFG_SEL1_SHIFT), TRGMUX_TRGCFG_SEL1_SHIFT, TRGMUX_TRGCFG_SEL1_WIDTH))
/*@}*/

/*!
 * @name Register TRGMUX_TRGCFG, field SEL2[21:16] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 2. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_TRGCFG_SEL2 field. */
#define TRGMUX_RD_TRGCFG_SEL2(base, index) ((TRGMUX_TRGCFG_REG(base, index) & TRGMUX_TRGCFG_SEL2_MASK) >> TRGMUX_TRGCFG_SEL2_SHIFT)
#define TRGMUX_BRD_TRGCFG_SEL2(base, index) (BME_UBFX32(&TRGMUX_TRGCFG_REG(base, index), TRGMUX_TRGCFG_SEL2_SHIFT, TRGMUX_TRGCFG_SEL2_WIDTH))

/*! @brief Set the SEL2 field to a new value. */
#define TRGMUX_WR_TRGCFG_SEL2(base, index, value) (TRGMUX_RMW_TRGCFG(base, index, TRGMUX_TRGCFG_SEL2_MASK, TRGMUX_TRGCFG_SEL2(value)))
#define TRGMUX_BWR_TRGCFG_SEL2(base, index, value) (BME_BFI32(&TRGMUX_TRGCFG_REG(base, index), ((uint32_t)(value) << TRGMUX_TRGCFG_SEL2_SHIFT), TRGMUX_TRGCFG_SEL2_SHIFT, TRGMUX_TRGCFG_SEL2_WIDTH))
/*@}*/

/*!
 * @name Register TRGMUX_TRGCFG, field SEL3[29:24] (RW)
 *
 * This read/write bit field is used to configure the MUX select for peripheral
 * trigger input 3. Refer to the Select Bit Fields table in the Features section
 * for bit field information.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_TRGCFG_SEL3 field. */
#define TRGMUX_RD_TRGCFG_SEL3(base, index) ((TRGMUX_TRGCFG_REG(base, index) & TRGMUX_TRGCFG_SEL3_MASK) >> TRGMUX_TRGCFG_SEL3_SHIFT)
#define TRGMUX_BRD_TRGCFG_SEL3(base, index) (BME_UBFX32(&TRGMUX_TRGCFG_REG(base, index), TRGMUX_TRGCFG_SEL3_SHIFT, TRGMUX_TRGCFG_SEL3_WIDTH))

/*! @brief Set the SEL3 field to a new value. */
#define TRGMUX_WR_TRGCFG_SEL3(base, index, value) (TRGMUX_RMW_TRGCFG(base, index, TRGMUX_TRGCFG_SEL3_MASK, TRGMUX_TRGCFG_SEL3(value)))
#define TRGMUX_BWR_TRGCFG_SEL3(base, index, value) (BME_BFI32(&TRGMUX_TRGCFG_REG(base, index), ((uint32_t)(value) << TRGMUX_TRGCFG_SEL3_SHIFT), TRGMUX_TRGCFG_SEL3_SHIFT, TRGMUX_TRGCFG_SEL3_WIDTH))
/*@}*/

/*!
 * @name Register TRGMUX_TRGCFG, field LK[31] (RO)
 *
 * This bit shows whether the register can be written or not.
 *
 * Values:
 * - 0b0 - Register can be written.
 * - 0b1 - Register cannot be written until the next system Reset.
 */
/*@{*/
/*! @brief Read current value of the TRGMUX_TRGCFG_LK field. */
#define TRGMUX_RD_TRGCFG_LK(base, index) ((TRGMUX_TRGCFG_REG(base, index) & TRGMUX_TRGCFG_LK_MASK) >> TRGMUX_TRGCFG_LK_SHIFT)
#define TRGMUX_BRD_TRGCFG_LK(base, index) (BME_UBFX32(&TRGMUX_TRGCFG_REG(base, index), TRGMUX_TRGCFG_LK_SHIFT, TRGMUX_TRGCFG_LK_WIDTH))
/*@}*/

/*
 * MKL28Z7 TRNG
 *
 * RNG
 *
 * Registers defined in this header file:
 * - TRNG_RTMCTL - RNG Miscellaneous Control Register
 * - TRNG_RTSCMISC - RNG Statistical Check Miscellaneous Register
 * - TRNG_RTPKRRNG - RNG Poker Range Register
 * - TRNG_RTPKRMAX - RNG Poker Maximum Limit Register
 * - TRNG_RTPKRSQ - RNG Poker Square Calculation Result Register
 * - TRNG_RTSDCTL - RNG Seed Control Register
 * - TRNG_RTSBLIM - RNG Sparse Bit Limit Register
 * - TRNG_RTTOTSAM - RNG Total Samples Register
 * - TRNG_RTFRQMIN - RNG Frequency Count Minimum Limit Register
 * - TRNG_RTFRQCNT - RNG Frequency Count Register
 * - TRNG_RTFRQMAX - RNG Frequency Count Maximum Limit Register
 * - TRNG_RTSCMC - RNG Statistical Check Monobit Count Register
 * - TRNG_RTSCML - RNG Statistical Check Monobit Limit Register
 * - TRNG_RTSCR1C - RNG Statistical Check Run Length 1 Count Register
 * - TRNG_RTSCR1L - RNG Statistical Check Run Length 1 Limit Register
 * - TRNG_RTSCR2C - RNG Statistical Check Run Length 2 Count Register
 * - TRNG_RTSCR2L - RNG Statistical Check Run Length 2 Limit Register
 * - TRNG_RTSCR3C - RNG Statistical Check Run Length 3 Count Register
 * - TRNG_RTSCR3L - RNG Statistical Check Run Length 3 Limit Register
 * - TRNG_RTSCR4C - RNG Statistical Check Run Length 4 Count Register
 * - TRNG_RTSCR4L - RNG Statistical Check Run Length 4 Limit Register
 * - TRNG_RTSCR5C - RNG Statistical Check Run Length 5 Count Register
 * - TRNG_RTSCR5L - RNG Statistical Check Run Length 5 Limit Register
 * - TRNG_RTSCR6PC - RNG Statistical Check Run Length 6+ Count Register
 * - TRNG_RTSCR6PL - RNG Statistical Check Run Length 6+ Limit Register
 * - TRNG_RTSTATUS - RNG Status Register
 * - TRNG_RTENT0 - RNG TRNG Entropy Read Register
 * - TRNG_RTENT1 - RNG TRNG Entropy Read Register
 * - TRNG_RTENT2 - RNG TRNG Entropy Read Register
 * - TRNG_RTENT3 - RNG TRNG Entropy Read Register
 * - TRNG_RTENT4 - RNG TRNG Entropy Read Register
 * - TRNG_RTENT5 - RNG TRNG Entropy Read Register
 * - TRNG_RTENT6 - RNG TRNG Entropy Read Register
 * - TRNG_RTENT7 - RNG TRNG Entropy Read Register
 * - TRNG_RTENT8 - RNG TRNG Entropy Read Register
 * - TRNG_RTENT9 - RNG TRNG Entropy Read Register
 * - TRNG_RTENT10 - RNG TRNG Entropy Read Register
 * - TRNG_RTENT11 - RNG TRNG Entropy Read Register
 * - TRNG_RTENT12 - RNG TRNG Entropy Read Register
 * - TRNG_RTENT13 - RNG TRNG Entropy Read Register
 * - TRNG_RTENT14 - RNG TRNG Entropy Read Register
 * - TRNG_RTENT15 - RNG TRNG Entropy Read Register
 * - TRNG_RTPKRCNT10 - RNG Statistical Check Poker Count 1 and 0 Register
 * - TRNG_RTPKRCNT32 - RNG Statistical Check Poker Count 3 and 2 Register
 * - TRNG_RTPKRCNT54 - RNG Statistical Check Poker Count 5 and 4 Register
 * - TRNG_RTPKRCNT76 - RNG Statistical Check Poker Count 7 and 6 Register
 * - TRNG_RTPKRCNT98 - RNG Statistical Check Poker Count 9 and 8 Register
 * - TRNG_RTPKRCNTBA - RNG Statistical Check Poker Count B and A Register
 * - TRNG_RTPKRCNTDC - RNG Statistical Check Poker Count D and C Register
 * - TRNG_RTPKRCNTFE - RNG Statistical Check Poker Count F and E Register
 * - TRNG_SA_TRNG_SEC_CFG - RNG Security Configuration Register
 * - TRNG_SA_TRNG_INT_CTRL - RNG Interrupt Control Register
 * - TRNG_SA_TRNG_INT_MASK - RNG Mask Register
 * - TRNG_SA_TRNG_INT_STATUS - RNG Interrupt Status Register
 * - TRNG_SA_TRNG_VID1 - RNG Version ID Register (MS)
 * - TRNG_SA_TRNG_VID2 - RNG Version ID Register (LS)
 */

#define TRNG_INSTANCE_COUNT (1U) /*!< Number of instances of the TRNG module. */
#define TRNG_IDX (0U) /*!< Instance number for TRNG. */

