pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * TRNG_RTMCTL - RNG Miscellaneous Control Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTMCTL - RNG Miscellaneous Control Register (RW)
 *
 * Reset value: 0x00012001U
 *
 * This register is intended to be used for programming, configuring and testing
 * the RNG. It is the main register to read/write, in order to enable Entropy
 * generation, to stop entropy generation and to block access to entropy registers.
 * This is done via the special TRNG_ACC and PRGM bits below. The RNG
 * Miscellaneous Control Register is a read/write register used to control the RNG's True
 * Random Number Generator (TRNG) access, operation and test. Note that in many
 * cases two RNG registers share the same address, and a particular register at the
 * shared address is selected based upon the value in the PRGM field of the true
 * register.
 */
/*!
 * @name Constants and macros for entire TRNG_RTMCTL register
 */
/*@{*/
#define TRNG_RD_RTMCTL(base)     (TRNG_RTMCTL_REG(base))
#define TRNG_WR_RTMCTL(base, value) (TRNG_RTMCTL_REG(base) = (value))
#define TRNG_RMW_RTMCTL(base, mask, value) (TRNG_WR_RTMCTL(base, (TRNG_RD_RTMCTL(base) & ~(mask)) | (value)))
#define TRNG_SET_RTMCTL(base, value) (BME_OR32(&TRNG_RTMCTL_REG(base), (uint32_t)(value)))
#define TRNG_CLR_RTMCTL(base, value) (BME_AND32(&TRNG_RTMCTL_REG(base), (uint32_t)(~(value))))
#define TRNG_TOG_RTMCTL(base, value) (BME_XOR32(&TRNG_RTMCTL_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual TRNG_RTMCTL bitfields
 */

/*!
 * @name Register TRNG_RTMCTL, field SAMP_MODE[1:0] (RW)
 *
 * Sample Mode. Determines the method of sampling the ring oscillator while
 * generating the Entropy value:This field is writable only if PRGM bit is 1, or PRGM
 * bit is being written to 1 simultaneously with writing this field. This field
 * is cleared to 00 by writing the RST_DEF bit to 1.
 *
 * Values:
 * - 0b00 - use Von Neumann data into both Entropy shifter and Statistical
 *     Checker
 * - 0b01 - use raw data into both Entropy shifter and Statistical Checker
 * - 0b10 - use Von Neumann data into Entropy shifter. Use raw data into
 *     Statistical Checker
 * - 0b11 - reserved.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTMCTL_SAMP_MODE field. */
#define TRNG_RD_RTMCTL_SAMP_MODE(base) ((TRNG_RTMCTL_REG(base) & TRNG_RTMCTL_SAMP_MODE_MASK) >> TRNG_RTMCTL_SAMP_MODE_SHIFT)
#define TRNG_BRD_RTMCTL_SAMP_MODE(base) (BME_UBFX32(&TRNG_RTMCTL_REG(base), TRNG_RTMCTL_SAMP_MODE_SHIFT, TRNG_RTMCTL_SAMP_MODE_WIDTH))

/*! @brief Set the SAMP_MODE field to a new value. */
#define TRNG_WR_RTMCTL_SAMP_MODE(base, value) (TRNG_RMW_RTMCTL(base, (TRNG_RTMCTL_SAMP_MODE_MASK | TRNG_RTMCTL_ERR_MASK), TRNG_RTMCTL_SAMP_MODE(value)))
#define TRNG_BWR_RTMCTL_SAMP_MODE(base, value) (BME_BFI32(&TRNG_RTMCTL_REG(base), ((uint32_t)(value) << TRNG_RTMCTL_SAMP_MODE_SHIFT), TRNG_RTMCTL_SAMP_MODE_SHIFT, TRNG_RTMCTL_SAMP_MODE_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTMCTL, field OSC_DIV[3:2] (RW)
 *
 * Oscillator Divide. Determines the amount of dividing done to the ring
 * oscillator before it is used by the TRNG.This field is writable only if PRGM bit is
 * 1, or PRGM bit is being written to 1 simultaneously to writing this field. This
 * field is cleared to 00 by writing the RST_DEF bit to 1.
 *
 * Values:
 * - 0b00 - use ring oscillator with no divide
 * - 0b01 - use ring oscillator divided-by-2
 * - 0b10 - use ring oscillator divided-by-4
 * - 0b11 - use ring oscillator divided-by-8
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTMCTL_OSC_DIV field. */
#define TRNG_RD_RTMCTL_OSC_DIV(base) ((TRNG_RTMCTL_REG(base) & TRNG_RTMCTL_OSC_DIV_MASK) >> TRNG_RTMCTL_OSC_DIV_SHIFT)
#define TRNG_BRD_RTMCTL_OSC_DIV(base) (BME_UBFX32(&TRNG_RTMCTL_REG(base), TRNG_RTMCTL_OSC_DIV_SHIFT, TRNG_RTMCTL_OSC_DIV_WIDTH))

/*! @brief Set the OSC_DIV field to a new value. */
#define TRNG_WR_RTMCTL_OSC_DIV(base, value) (TRNG_RMW_RTMCTL(base, (TRNG_RTMCTL_OSC_DIV_MASK | TRNG_RTMCTL_ERR_MASK), TRNG_RTMCTL_OSC_DIV(value)))
#define TRNG_BWR_RTMCTL_OSC_DIV(base, value) (BME_BFI32(&TRNG_RTMCTL_REG(base), ((uint32_t)(value) << TRNG_RTMCTL_OSC_DIV_SHIFT), TRNG_RTMCTL_OSC_DIV_SHIFT, TRNG_RTMCTL_OSC_DIV_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTMCTL, field UNUSED[4] (RW)
 *
 * This bit is unused but write-able. Must be left as zero.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTMCTL_UNUSED field. */
#define TRNG_RD_RTMCTL_UNUSED(base) ((TRNG_RTMCTL_REG(base) & TRNG_RTMCTL_UNUSED_MASK) >> TRNG_RTMCTL_UNUSED_SHIFT)
#define TRNG_BRD_RTMCTL_UNUSED(base) (BME_UBFX32(&TRNG_RTMCTL_REG(base), TRNG_RTMCTL_UNUSED_SHIFT, TRNG_RTMCTL_UNUSED_WIDTH))

/*! @brief Set the UNUSED field to a new value. */
#define TRNG_WR_RTMCTL_UNUSED(base, value) (TRNG_RMW_RTMCTL(base, (TRNG_RTMCTL_UNUSED_MASK | TRNG_RTMCTL_ERR_MASK), TRNG_RTMCTL_UNUSED(value)))
#define TRNG_BWR_RTMCTL_UNUSED(base, value) (BME_BFI32(&TRNG_RTMCTL_REG(base), ((uint32_t)(value) << TRNG_RTMCTL_UNUSED_SHIFT), TRNG_RTMCTL_UNUSED_SHIFT, TRNG_RTMCTL_UNUSED_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTMCTL, field TRNG_ACC[5] (RW)
 *
 * TRNG Access Mode. If this bit is set to 1, the TRNG will generate an Entropy
 * value that can be read via the true0-true15 registers. The Entropy value may
 * be read once the ENT VAL bit is asserted. Also see truea register descriptions
 * (For a = 0 to 15).
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTMCTL_TRNG_ACC field. */
#define TRNG_RD_RTMCTL_TRNG_ACC(base) ((TRNG_RTMCTL_REG(base) & TRNG_RTMCTL_TRNG_ACC_MASK) >> TRNG_RTMCTL_TRNG_ACC_SHIFT)
#define TRNG_BRD_RTMCTL_TRNG_ACC(base) (BME_UBFX32(&TRNG_RTMCTL_REG(base), TRNG_RTMCTL_TRNG_ACC_SHIFT, TRNG_RTMCTL_TRNG_ACC_WIDTH))

/*! @brief Set the TRNG_ACC field to a new value. */
#define TRNG_WR_RTMCTL_TRNG_ACC(base, value) (TRNG_RMW_RTMCTL(base, (TRNG_RTMCTL_TRNG_ACC_MASK | TRNG_RTMCTL_ERR_MASK), TRNG_RTMCTL_TRNG_ACC(value)))
#define TRNG_BWR_RTMCTL_TRNG_ACC(base, value) (BME_BFI32(&TRNG_RTMCTL_REG(base), ((uint32_t)(value) << TRNG_RTMCTL_TRNG_ACC_SHIFT), TRNG_RTMCTL_TRNG_ACC_SHIFT, TRNG_RTMCTL_TRNG_ACC_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTMCTL, field RST_DEF[6] (WO)
 *
 * Reset Defaults. Writing a 1 to this bit clears various TRNG registers, and
 * bits within registers, to their default state. This bit is writable only if PRGM
 * bit is 1, or PRGM bit is being written to 1 simultaneously to writing this
 * bit. Reading this bit always produces a 0.
 */
/*@{*/
/*! @brief Set the RST_DEF field to a new value. */
#define TRNG_WR_RTMCTL_RST_DEF(base, value) (TRNG_RMW_RTMCTL(base, (TRNG_RTMCTL_RST_DEF_MASK | TRNG_RTMCTL_ERR_MASK), TRNG_RTMCTL_RST_DEF(value)))
#define TRNG_BWR_RTMCTL_RST_DEF(base, value) (TRNG_WR_RTMCTL_RST_DEF(base, value))
/*@}*/

/*!
 * @name Register TRNG_RTMCTL, field FOR_SCLK[7] (RW)
 *
 * Force System Clock. If set, the system clock is used to operate the TRNG,
 * instead of the ring oscillator. This is for test use only, and indeterminate
 * results may occur. This bit is writable only if PRGM bit is 1, or PRGM bit is
 * being written to 1 simultaneously to writing this bit. This bit is cleared by
 * writing the RST_DEF bit to 1.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTMCTL_FOR_SCLK field. */
#define TRNG_RD_RTMCTL_FOR_SCLK(base) ((TRNG_RTMCTL_REG(base) & TRNG_RTMCTL_FOR_SCLK_MASK) >> TRNG_RTMCTL_FOR_SCLK_SHIFT)
#define TRNG_BRD_RTMCTL_FOR_SCLK(base) (BME_UBFX32(&TRNG_RTMCTL_REG(base), TRNG_RTMCTL_FOR_SCLK_SHIFT, TRNG_RTMCTL_FOR_SCLK_WIDTH))

/*! @brief Set the FOR_SCLK field to a new value. */
#define TRNG_WR_RTMCTL_FOR_SCLK(base, value) (TRNG_RMW_RTMCTL(base, (TRNG_RTMCTL_FOR_SCLK_MASK | TRNG_RTMCTL_ERR_MASK), TRNG_RTMCTL_FOR_SCLK(value)))
#define TRNG_BWR_RTMCTL_FOR_SCLK(base, value) (BME_BFI32(&TRNG_RTMCTL_REG(base), ((uint32_t)(value) << TRNG_RTMCTL_FOR_SCLK_SHIFT), TRNG_RTMCTL_FOR_SCLK_SHIFT, TRNG_RTMCTL_FOR_SCLK_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTMCTL, field FCT_FAIL[8] (RO)
 *
 * Read only: Frequency Count Fail. The frequency counter has detected a
 * failure. This may be due to improper programming of the true and/or true registers,
 * or a hardware failure in the ring oscillator. This error may be cleared by
 * writing a 1 to the ERR bit.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTMCTL_FCT_FAIL field. */
#define TRNG_RD_RTMCTL_FCT_FAIL(base) ((TRNG_RTMCTL_REG(base) & TRNG_RTMCTL_FCT_FAIL_MASK) >> TRNG_RTMCTL_FCT_FAIL_SHIFT)
#define TRNG_BRD_RTMCTL_FCT_FAIL(base) (BME_UBFX32(&TRNG_RTMCTL_REG(base), TRNG_RTMCTL_FCT_FAIL_SHIFT, TRNG_RTMCTL_FCT_FAIL_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTMCTL, field FCT_VAL[9] (RO)
 *
 * Read only: Frequency Count Valid. Indicates that a valid frequency count may
 * be read from true.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTMCTL_FCT_VAL field. */
#define TRNG_RD_RTMCTL_FCT_VAL(base) ((TRNG_RTMCTL_REG(base) & TRNG_RTMCTL_FCT_VAL_MASK) >> TRNG_RTMCTL_FCT_VAL_SHIFT)
#define TRNG_BRD_RTMCTL_FCT_VAL(base) (BME_UBFX32(&TRNG_RTMCTL_REG(base), TRNG_RTMCTL_FCT_VAL_SHIFT, TRNG_RTMCTL_FCT_VAL_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTMCTL, field ENT_VAL[10] (RO)
 *
 * Read only: Entropy Valid. Will assert only if TRNG ACC bit is set, and then
 * after an entropy value is generated. Will be cleared when true15 is read.
 * (true0 through true14 should be read before reading true15).
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTMCTL_ENT_VAL field. */
#define TRNG_RD_RTMCTL_ENT_VAL(base) ((TRNG_RTMCTL_REG(base) & TRNG_RTMCTL_ENT_VAL_MASK) >> TRNG_RTMCTL_ENT_VAL_SHIFT)
#define TRNG_BRD_RTMCTL_ENT_VAL(base) (BME_UBFX32(&TRNG_RTMCTL_REG(base), TRNG_RTMCTL_ENT_VAL_SHIFT, TRNG_RTMCTL_ENT_VAL_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTMCTL, field TST_OUT[11] (RO)
 *
 * Read only: Test point inside ring oscillator.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTMCTL_TST_OUT field. */
#define TRNG_RD_RTMCTL_TST_OUT(base) ((TRNG_RTMCTL_REG(base) & TRNG_RTMCTL_TST_OUT_MASK) >> TRNG_RTMCTL_TST_OUT_SHIFT)
#define TRNG_BRD_RTMCTL_TST_OUT(base) (BME_UBFX32(&TRNG_RTMCTL_REG(base), TRNG_RTMCTL_TST_OUT_SHIFT, TRNG_RTMCTL_TST_OUT_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTMCTL, field ERR[12] (W1C)
 *
 * Read: Error status. 1 = error detected. 0 = no error.Write: Write 1 to clear
 * errors. Writing 0 has no effect.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTMCTL_ERR field. */
#define TRNG_RD_RTMCTL_ERR(base) ((TRNG_RTMCTL_REG(base) & TRNG_RTMCTL_ERR_MASK) >> TRNG_RTMCTL_ERR_SHIFT)
#define TRNG_BRD_RTMCTL_ERR(base) (BME_UBFX32(&TRNG_RTMCTL_REG(base), TRNG_RTMCTL_ERR_SHIFT, TRNG_RTMCTL_ERR_WIDTH))

