pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the ERR field to a new value. */
#define TRNG_WR_RTMCTL_ERR(base, value) (TRNG_RMW_RTMCTL(base, TRNG_RTMCTL_ERR_MASK, TRNG_RTMCTL_ERR(value)))
#define TRNG_BWR_RTMCTL_ERR(base, value) (BME_BFI32(&TRNG_RTMCTL_REG(base), ((uint32_t)(value) << TRNG_RTMCTL_ERR_SHIFT), TRNG_RTMCTL_ERR_SHIFT, TRNG_RTMCTL_ERR_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTMCTL, field TSTOP_OK[13] (RO)
 *
 * TRNG_OK_TO_STOP. Software should check that this bit is a 1 before
 * transitioning RNG to low power mode (RNG clock stopped). RNG turns on the TRNG
 * free-running ring oscillator whenever new entropy is being generated and turns off the
 * ring oscillator when entropy generation is complete. If the RNG clock is
 * stopped while the TRNG ring oscillator is running, the oscillator will continue
 * running even though the RNG clock is stopped. TSTOP_OK is asserted when the TRNG
 * ring oscillator is not running. and therefore it is ok to stop the RNG clock.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTMCTL_TSTOP_OK field. */
#define TRNG_RD_RTMCTL_TSTOP_OK(base) ((TRNG_RTMCTL_REG(base) & TRNG_RTMCTL_TSTOP_OK_MASK) >> TRNG_RTMCTL_TSTOP_OK_SHIFT)
#define TRNG_BRD_RTMCTL_TSTOP_OK(base) (BME_UBFX32(&TRNG_RTMCTL_REG(base), TRNG_RTMCTL_TSTOP_OK_SHIFT, TRNG_RTMCTL_TSTOP_OK_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTMCTL, field PRGM[16] (RW)
 *
 * Programming Mode Select. When this bit is 1, the TRNG is in Program Mode,
 * otherwise it is in Run Mode. No Entropy value will be generated while the TRNG is
 * in Program Mode. Note that different RNG registers are accessible at the same
 * address depending on whether PRGM is set to 1 or 0. This is noted in the RNG
 * register descriptions.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTMCTL_PRGM field. */
#define TRNG_RD_RTMCTL_PRGM(base) ((TRNG_RTMCTL_REG(base) & TRNG_RTMCTL_PRGM_MASK) >> TRNG_RTMCTL_PRGM_SHIFT)
#define TRNG_BRD_RTMCTL_PRGM(base) (BME_UBFX32(&TRNG_RTMCTL_REG(base), TRNG_RTMCTL_PRGM_SHIFT, TRNG_RTMCTL_PRGM_WIDTH))

/*! @brief Set the PRGM field to a new value. */
#define TRNG_WR_RTMCTL_PRGM(base, value) (TRNG_RMW_RTMCTL(base, (TRNG_RTMCTL_PRGM_MASK | TRNG_RTMCTL_ERR_MASK), TRNG_RTMCTL_PRGM(value)))
#define TRNG_BWR_RTMCTL_PRGM(base, value) (BME_BFI32(&TRNG_RTMCTL_REG(base), ((uint32_t)(value) << TRNG_RTMCTL_PRGM_SHIFT), TRNG_RTMCTL_PRGM_SHIFT, TRNG_RTMCTL_PRGM_WIDTH))
/*@}*/

/*******************************************************************************
 * TRNG_RTSCMISC - RNG Statistical Check Miscellaneous Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTSCMISC - RNG Statistical Check Miscellaneous Register (RW)
 *
 * Reset value: 0x0001001FU
 *
 * The RNG Statistical Check Miscellaneous Register contains the Long Run
 * Maximum Limit value and the Retry Count value. This register is accessible only when
 * the true[PRGM] bit is 1, otherwise this register will read zeroes, and cannot
 * be written.
 */
/*!
 * @name Constants and macros for entire TRNG_RTSCMISC register
 */
/*@{*/
#define TRNG_RD_RTSCMISC(base)   (TRNG_RTSCMISC_REG(base))
#define TRNG_WR_RTSCMISC(base, value) (TRNG_RTSCMISC_REG(base) = (value))
#define TRNG_RMW_RTSCMISC(base, mask, value) (TRNG_WR_RTSCMISC(base, (TRNG_RD_RTSCMISC(base) & ~(mask)) | (value)))
#define TRNG_SET_RTSCMISC(base, value) (BME_OR32(&TRNG_RTSCMISC_REG(base), (uint32_t)(value)))
#define TRNG_CLR_RTSCMISC(base, value) (BME_AND32(&TRNG_RTSCMISC_REG(base), (uint32_t)(~(value))))
#define TRNG_TOG_RTSCMISC(base, value) (BME_XOR32(&TRNG_RTSCMISC_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual TRNG_RTSCMISC bitfields
 */

/*!
 * @name Register TRNG_RTSCMISC, field LRUN_MAX[7:0] (RW)
 *
 * LONG RUN MAX LIMIT. This value is the largest allowable number of consecutive
 * samples of all 1, or all 0, that is allowed during the Entropy generation.
 * This field is writable only if true[PRGM] bit is 1. This field will read zeroes
 * if true[PRGM] = 0. This field is cleared to 22h by writing the true[RST_DEF]
 * bit to 1.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCMISC_LRUN_MAX field. */
#define TRNG_RD_RTSCMISC_LRUN_MAX(base) ((TRNG_RTSCMISC_REG(base) & TRNG_RTSCMISC_LRUN_MAX_MASK) >> TRNG_RTSCMISC_LRUN_MAX_SHIFT)
#define TRNG_BRD_RTSCMISC_LRUN_MAX(base) (BME_UBFX32(&TRNG_RTSCMISC_REG(base), TRNG_RTSCMISC_LRUN_MAX_SHIFT, TRNG_RTSCMISC_LRUN_MAX_WIDTH))

/*! @brief Set the LRUN_MAX field to a new value. */
#define TRNG_WR_RTSCMISC_LRUN_MAX(base, value) (TRNG_RMW_RTSCMISC(base, TRNG_RTSCMISC_LRUN_MAX_MASK, TRNG_RTSCMISC_LRUN_MAX(value)))
#define TRNG_BWR_RTSCMISC_LRUN_MAX(base, value) (BME_BFI32(&TRNG_RTSCMISC_REG(base), ((uint32_t)(value) << TRNG_RTSCMISC_LRUN_MAX_SHIFT), TRNG_RTSCMISC_LRUN_MAX_SHIFT, TRNG_RTSCMISC_LRUN_MAX_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTSCMISC, field RTY_CT[19:16] (RW)
 *
 * RETRY COUNT. If a statistical check fails during the TRNG Entropy Generation,
 * the RTY_CT value indicates the number of times a retry should occur before
 * generating an error. This field is writable only if true[PRGM] bit is 1. This
 * field will read zeroes if true[PRGM] = 0. This field is cleared to 1h by writing
 * the true[RST_DEF] bit to 1.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCMISC_RTY_CT field. */
#define TRNG_RD_RTSCMISC_RTY_CT(base) ((TRNG_RTSCMISC_REG(base) & TRNG_RTSCMISC_RTY_CT_MASK) >> TRNG_RTSCMISC_RTY_CT_SHIFT)
#define TRNG_BRD_RTSCMISC_RTY_CT(base) (BME_UBFX32(&TRNG_RTSCMISC_REG(base), TRNG_RTSCMISC_RTY_CT_SHIFT, TRNG_RTSCMISC_RTY_CT_WIDTH))

/*! @brief Set the RTY_CT field to a new value. */
#define TRNG_WR_RTSCMISC_RTY_CT(base, value) (TRNG_RMW_RTSCMISC(base, TRNG_RTSCMISC_RTY_CT_MASK, TRNG_RTSCMISC_RTY_CT(value)))
#define TRNG_BWR_RTSCMISC_RTY_CT(base, value) (BME_BFI32(&TRNG_RTSCMISC_REG(base), ((uint32_t)(value) << TRNG_RTSCMISC_RTY_CT_SHIFT), TRNG_RTSCMISC_RTY_CT_SHIFT, TRNG_RTSCMISC_RTY_CT_WIDTH))
/*@}*/

/*******************************************************************************
 * TRNG_RTPKRRNG - RNG Poker Range Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTPKRRNG - RNG Poker Range Register (RW)
 *
 * Reset value: 0x000009A3U
 *
 * The RNG Poker Range Register defines the difference between the TRNG Poker
 * Maximum Limit and the minimum limit. These limits are used during the TRNG
 * Statistical Check Poker Test.
 */
/*!
 * @name Constants and macros for entire TRNG_RTPKRRNG register
 */
/*@{*/
#define TRNG_RD_RTPKRRNG(base)   (TRNG_RTPKRRNG_REG(base))
#define TRNG_WR_RTPKRRNG(base, value) (TRNG_RTPKRRNG_REG(base) = (value))
#define TRNG_RMW_RTPKRRNG(base, mask, value) (TRNG_WR_RTPKRRNG(base, (TRNG_RD_RTPKRRNG(base) & ~(mask)) | (value)))
#define TRNG_SET_RTPKRRNG(base, value) (BME_OR32(&TRNG_RTPKRRNG_REG(base), (uint32_t)(value)))
#define TRNG_CLR_RTPKRRNG(base, value) (BME_AND32(&TRNG_RTPKRRNG_REG(base), (uint32_t)(~(value))))
#define TRNG_TOG_RTPKRRNG(base, value) (BME_XOR32(&TRNG_RTPKRRNG_REG(base), (uint32_t)(value)))
/*@}*/

