pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * Constants & macros for individual TRNG_RTPKRRNG bitfields
 */

/*!
 * @name Register TRNG_RTPKRRNG, field PKR_RNG[15:0] (RW)
 *
 * Poker Range. During the TRNG Statistical Checks, a "Poker Test" is run which
 * requires a maximum and minimum limit. The maximum is programmed in the
 * RTPKRMAX[PKR_MAX] register, and the minimum is derived by subtracting the PKR_RNG
 * value from the programmed maximum value. This field is writable only if
 * true[PRGM] bit is 1. This field will read zeroes if true[PRGM] = 0. This field is
 * cleared to 09A3h (decimal 2467) by writing the true[RST_DEF] bit to 1. Note that
 * the minimum allowable Poker result is PKR_MAX - PKR_RNG + 1.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTPKRRNG_PKR_RNG field. */
#define TRNG_RD_RTPKRRNG_PKR_RNG(base) ((TRNG_RTPKRRNG_REG(base) & TRNG_RTPKRRNG_PKR_RNG_MASK) >> TRNG_RTPKRRNG_PKR_RNG_SHIFT)
#define TRNG_BRD_RTPKRRNG_PKR_RNG(base) (TRNG_RD_RTPKRRNG_PKR_RNG(base))

/*! @brief Set the PKR_RNG field to a new value. */
#define TRNG_WR_RTPKRRNG_PKR_RNG(base, value) (TRNG_RMW_RTPKRRNG(base, TRNG_RTPKRRNG_PKR_RNG_MASK, TRNG_RTPKRRNG_PKR_RNG(value)))
#define TRNG_BWR_RTPKRRNG_PKR_RNG(base, value) (TRNG_WR_RTPKRRNG_PKR_RNG(base, value))
/*@}*/

/*******************************************************************************
 * TRNG_RTPKRSQ - RNG Poker Square Calculation Result Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTPKRSQ - RNG Poker Square Calculation Result Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG Poker Square Calculation Result Register is a read-only register used
 * to read the result of the TRNG Statistical Check Poker Test's Square
 * Calculation. This test starts with the true value and decreases towards a final
 * result, which is read here. For the Poker Test to pass, this final result must be
 * less than the programmed true value. Note that this offset (0xBASE_060C) is used
 * as true if true[PRGM] is 1. If true[PRGM] is 0, this offset is used as true
 * readback register, as described here.
 */
/*!
 * @name Constants and macros for entire TRNG_RTPKRSQ register
 */
/*@{*/
#define TRNG_RD_RTPKRSQ(base)    (TRNG_RTPKRSQ_REG(base))
/*@}*/

/*
 * Constants & macros for individual TRNG_RTPKRSQ bitfields
 */

/*!
 * @name Register TRNG_RTPKRSQ, field PKR_SQ[23:0] (RO)
 *
 * Poker Square Calculation Result. During the TRNG Statistical Checks, a "Poker
 * Test" is run which starts with the value true[PKR_MAX]. This value decreases
 * according to a "sum of squares" algorithm, and must remain greater than zero,
 * but less than the true[PKR_RNG] limit. The resulting value may be read through
 * this register, if true[PRGM] bit is 0. Note that if true[PRGM] bit is 1, this
 * register address is used to access the Poker Test Maximum Limit in register
 * true, as defined in the previous section.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTPKRSQ_PKR_SQ field. */
#define TRNG_RD_RTPKRSQ_PKR_SQ(base) ((TRNG_RTPKRSQ_REG(base) & TRNG_RTPKRSQ_PKR_SQ_MASK) >> TRNG_RTPKRSQ_PKR_SQ_SHIFT)
#define TRNG_BRD_RTPKRSQ_PKR_SQ(base) (TRNG_RD_RTPKRSQ_PKR_SQ(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTPKRMAX - RNG Poker Maximum Limit Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTPKRMAX - RNG Poker Maximum Limit Register (RW)
 *
 * Reset value: 0x00006920U
 *
 * The RNG Poker Maximum Limit Register defines Maximum Limit allowable during
 * the TRNG Statistical Check Poker Test. Note that this offset (0xBASE_060C) is
 * used as true only if true[PRGM] is 1. If true[PRGM] is 0, this offset is used
 * as the true readback register.
 */
/*!
 * @name Constants and macros for entire TRNG_RTPKRMAX register
 */
/*@{*/
#define TRNG_RD_RTPKRMAX(base)   (TRNG_RTPKRMAX_REG(base))
#define TRNG_WR_RTPKRMAX(base, value) (TRNG_RTPKRMAX_REG(base) = (value))
#define TRNG_RMW_RTPKRMAX(base, mask, value) (TRNG_WR_RTPKRMAX(base, (TRNG_RD_RTPKRMAX(base) & ~(mask)) | (value)))
#define TRNG_SET_RTPKRMAX(base, value) (BME_OR32(&TRNG_RTPKRMAX_REG(base), (uint32_t)(value)))
#define TRNG_CLR_RTPKRMAX(base, value) (BME_AND32(&TRNG_RTPKRMAX_REG(base), (uint32_t)(~(value))))
#define TRNG_TOG_RTPKRMAX(base, value) (BME_XOR32(&TRNG_RTPKRMAX_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual TRNG_RTPKRMAX bitfields
 */

/*!
 * @name Register TRNG_RTPKRMAX, field PKR_MAX[23:0] (RW)
 *
 * Poker Maximum Limit. During the TRNG Statistical Checks, a "Poker Test" is
 * run which requires a maximum and minimum limit. The maximum allowable result is
 * programmed in the true[PKR_MAX] register. This field is writable only if
 * true[PRGM] bit is 1. This register is cleared to 006920h (decimal 26912) by writing
 * the true[RST_DEF] bit to 1. Note that the true and true registers combined
 * are used to define the minimum allowable Poker result, which is PKR_MAX -
 * PKR_RNG + 1. Note that if true[PRGM] bit is 0, this register address is used to read
 * the Poker Test Square Calculation result in register true, as defined in the
 * following section.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTPKRMAX_PKR_MAX field. */
#define TRNG_RD_RTPKRMAX_PKR_MAX(base) ((TRNG_RTPKRMAX_REG(base) & TRNG_RTPKRMAX_PKR_MAX_MASK) >> TRNG_RTPKRMAX_PKR_MAX_SHIFT)
#define TRNG_BRD_RTPKRMAX_PKR_MAX(base) (TRNG_RD_RTPKRMAX_PKR_MAX(base))

/*! @brief Set the PKR_MAX field to a new value. */
#define TRNG_WR_RTPKRMAX_PKR_MAX(base, value) (TRNG_RMW_RTPKRMAX(base, TRNG_RTPKRMAX_PKR_MAX_MASK, TRNG_RTPKRMAX_PKR_MAX(value)))
#define TRNG_BWR_RTPKRMAX_PKR_MAX(base, value) (TRNG_WR_RTPKRMAX_PKR_MAX(base, value))
/*@}*/

/*******************************************************************************
 * TRNG_RTSDCTL - RNG Seed Control Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTSDCTL - RNG Seed Control Register (RW)
 *
 * Reset value: 0x0C8009C4U
 *
 * The RNG Seed Control Register contains two fields. One field defines the
 * length (in system clocks) of each Entropy sample (ENT_DLY), and the other field
 * indicates the number of samples that will taken during each TRNG Entropy
 * generation (SAMP_SIZE).
 */
/*!
 * @name Constants and macros for entire TRNG_RTSDCTL register
 */
/*@{*/
#define TRNG_RD_RTSDCTL(base)    (TRNG_RTSDCTL_REG(base))
#define TRNG_WR_RTSDCTL(base, value) (TRNG_RTSDCTL_REG(base) = (value))
#define TRNG_RMW_RTSDCTL(base, mask, value) (TRNG_WR_RTSDCTL(base, (TRNG_RD_RTSDCTL(base) & ~(mask)) | (value)))
#define TRNG_SET_RTSDCTL(base, value) (BME_OR32(&TRNG_RTSDCTL_REG(base), (uint32_t)(value)))
#define TRNG_CLR_RTSDCTL(base, value) (BME_AND32(&TRNG_RTSDCTL_REG(base), (uint32_t)(~(value))))
#define TRNG_TOG_RTSDCTL(base, value) (BME_XOR32(&TRNG_RTSDCTL_REG(base), (uint32_t)(value)))
/*@}*/

