pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * Constants & macros for individual TRNG_RTSDCTL bitfields
 */

/*!
 * @name Register TRNG_RTSDCTL, field SAMP_SIZE[15:0] (RW)
 *
 * Sample Size. Defines the total number of Entropy samples that will be taken
 * during Entropy generation. This field is writable only if true[PRGM] bit is 1.
 * This field will read zeroes if true[PRGM] = 0. This field is cleared to 09C4h
 * (decimal 2500) by writing the true[RST_DEF] bit to 1.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSDCTL_SAMP_SIZE field. */
#define TRNG_RD_RTSDCTL_SAMP_SIZE(base) ((TRNG_RTSDCTL_REG(base) & TRNG_RTSDCTL_SAMP_SIZE_MASK) >> TRNG_RTSDCTL_SAMP_SIZE_SHIFT)
#define TRNG_BRD_RTSDCTL_SAMP_SIZE(base) (TRNG_RD_RTSDCTL_SAMP_SIZE(base))

/*! @brief Set the SAMP_SIZE field to a new value. */
#define TRNG_WR_RTSDCTL_SAMP_SIZE(base, value) (TRNG_RMW_RTSDCTL(base, TRNG_RTSDCTL_SAMP_SIZE_MASK, TRNG_RTSDCTL_SAMP_SIZE(value)))
#define TRNG_BWR_RTSDCTL_SAMP_SIZE(base, value) (TRNG_WR_RTSDCTL_SAMP_SIZE(base, value))
/*@}*/

/*!
 * @name Register TRNG_RTSDCTL, field ENT_DLY[31:16] (RW)
 *
 * Entropy Delay. Defines the length (in system clocks) of each Entropy sample
 * taken. This field is writable only if true[PRGM] bit is 1. This field will read
 * zeroes if true[PRGM] = 0. This field is cleared to 0C80h (decimal 3200) by
 * writing the true[RST_DEF] bit to 1.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSDCTL_ENT_DLY field. */
#define TRNG_RD_RTSDCTL_ENT_DLY(base) ((TRNG_RTSDCTL_REG(base) & TRNG_RTSDCTL_ENT_DLY_MASK) >> TRNG_RTSDCTL_ENT_DLY_SHIFT)
#define TRNG_BRD_RTSDCTL_ENT_DLY(base) (TRNG_RD_RTSDCTL_ENT_DLY(base))

/*! @brief Set the ENT_DLY field to a new value. */
#define TRNG_WR_RTSDCTL_ENT_DLY(base, value) (TRNG_RMW_RTSDCTL(base, TRNG_RTSDCTL_ENT_DLY_MASK, TRNG_RTSDCTL_ENT_DLY(value)))
#define TRNG_BWR_RTSDCTL_ENT_DLY(base, value) (TRNG_WR_RTSDCTL_ENT_DLY(base, value))
/*@}*/

/*******************************************************************************
 * TRNG_RTTOTSAM - RNG Total Samples Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTTOTSAM - RNG Total Samples Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG Total Samples Register is a read-only register used to read the total
 * number of samples taken during Entropy generation. It is used to give an
 * indication of how often a sample is actually used during Von Neumann sampling.
 * Note that this offset (0xBASE_0614) is used as true if true[PRGM] is 1. If
 * true[PRGM] is 0, this offset is used as true readback register, as described here.
 */
/*!
 * @name Constants and macros for entire TRNG_RTTOTSAM register
 */
/*@{*/
#define TRNG_RD_RTTOTSAM(base)   (TRNG_RTTOTSAM_REG(base))
/*@}*/

/*
 * Constants & macros for individual TRNG_RTTOTSAM bitfields
 */

/*!
 * @name Register TRNG_RTTOTSAM, field TOT_SAM[19:0] (RO)
 *
 * Total Samples. During Entropy generation, the total number of raw samples is
 * counted. This count is useful in determining how often a sample is used during
 * Von Neumann sampling. The count may be read through this register, if
 * true[PRGM] bit is 0. Note that if true[PRGM] bit is 1, this register address is used
 * to access the Sparse Bit Limit in register true, as defined in the previous
 * section.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTTOTSAM_TOT_SAM field. */
#define TRNG_RD_RTTOTSAM_TOT_SAM(base) ((TRNG_RTTOTSAM_REG(base) & TRNG_RTTOTSAM_TOT_SAM_MASK) >> TRNG_RTTOTSAM_TOT_SAM_SHIFT)
#define TRNG_BRD_RTTOTSAM_TOT_SAM(base) (TRNG_RD_RTTOTSAM_TOT_SAM(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTSBLIM - RNG Sparse Bit Limit Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTSBLIM - RNG Sparse Bit Limit Register (RW)
 *
 * Reset value: 0x0000003FU
 *
 * The RNG Sparse Bit Limit Register is used when Von Neumann sampling is
 * selected during Entropy Generation. It defines the maximum number of consecutive Von
 * Neumann samples which may be discarded before an error is generated. Note
 * that this address (0xBASE_0614) is used as true only if true[PRGM] is 1. If
 * true[PRGM] is 0, this address is used as true readback register.
 */
/*!
 * @name Constants and macros for entire TRNG_RTSBLIM register
 */
/*@{*/
#define TRNG_RD_RTSBLIM(base)    (TRNG_RTSBLIM_REG(base))
#define TRNG_WR_RTSBLIM(base, value) (TRNG_RTSBLIM_REG(base) = (value))
#define TRNG_RMW_RTSBLIM(base, mask, value) (TRNG_WR_RTSBLIM(base, (TRNG_RD_RTSBLIM(base) & ~(mask)) | (value)))
#define TRNG_SET_RTSBLIM(base, value) (BME_OR32(&TRNG_RTSBLIM_REG(base), (uint32_t)(value)))
#define TRNG_CLR_RTSBLIM(base, value) (BME_AND32(&TRNG_RTSBLIM_REG(base), (uint32_t)(~(value))))
#define TRNG_TOG_RTSBLIM(base, value) (BME_XOR32(&TRNG_RTSBLIM_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual TRNG_RTSBLIM bitfields
 */

/*!
 * @name Register TRNG_RTSBLIM, field SB_LIM[9:0] (RW)
 *
 * Sparse Bit Limit. During Von Neumann sampling (if enabled by true[SAMP_MODE],
 * samples are discarded if two consecutive raw samples are both 0 or both 1. If
 * this discarding occurs for a long period of time, it indicates that there is
 * insufficient Entropy. The Sparse Bit Limit defines the maximum number of
 * consecutive samples that may be discarded before an error is generated. This field
 * is writable only if true[PRGM] bit is 1. This register is cleared to 03hF by
 * writing the true[RST_DEF] bit to 1. Note that if true[PRGM] bit is 0, this
 * register address is used to read the Total Samples count in register true, as
 * defined in the following section.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSBLIM_SB_LIM field. */
#define TRNG_RD_RTSBLIM_SB_LIM(base) ((TRNG_RTSBLIM_REG(base) & TRNG_RTSBLIM_SB_LIM_MASK) >> TRNG_RTSBLIM_SB_LIM_SHIFT)
#define TRNG_BRD_RTSBLIM_SB_LIM(base) (TRNG_RD_RTSBLIM_SB_LIM(base))

/*! @brief Set the SB_LIM field to a new value. */
#define TRNG_WR_RTSBLIM_SB_LIM(base, value) (TRNG_RMW_RTSBLIM(base, TRNG_RTSBLIM_SB_LIM_MASK, TRNG_RTSBLIM_SB_LIM(value)))
#define TRNG_BWR_RTSBLIM_SB_LIM(base, value) (TRNG_WR_RTSBLIM_SB_LIM(base, value))
/*@}*/

