pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * TRNG_RTFRQMIN - RNG Frequency Count Minimum Limit Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTFRQMIN - RNG Frequency Count Minimum Limit Register (RW)
 *
 * Reset value: 0x00000640U
 *
 * The RNG Frequency Count Minimum Limit Register defines the minimum allowable
 * count taken by the Entropy sample counter during each Entropy sample. During
 * any sample period, if the count is less than this programmed minimum, a
 * Frequency Count Fail is flagged in true[FCT_FAIL] and an error is generated.
 */
/*!
 * @name Constants and macros for entire TRNG_RTFRQMIN register
 */
/*@{*/
#define TRNG_RD_RTFRQMIN(base)   (TRNG_RTFRQMIN_REG(base))
#define TRNG_WR_RTFRQMIN(base, value) (TRNG_RTFRQMIN_REG(base) = (value))
#define TRNG_RMW_RTFRQMIN(base, mask, value) (TRNG_WR_RTFRQMIN(base, (TRNG_RD_RTFRQMIN(base) & ~(mask)) | (value)))
#define TRNG_SET_RTFRQMIN(base, value) (BME_OR32(&TRNG_RTFRQMIN_REG(base), (uint32_t)(value)))
#define TRNG_CLR_RTFRQMIN(base, value) (BME_AND32(&TRNG_RTFRQMIN_REG(base), (uint32_t)(~(value))))
#define TRNG_TOG_RTFRQMIN(base, value) (BME_XOR32(&TRNG_RTFRQMIN_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual TRNG_RTFRQMIN bitfields
 */

/*!
 * @name Register TRNG_RTFRQMIN, field FRQ_MIN[21:0] (RW)
 *
 * Frequency Count Minimum Limit. Defines the minimum allowable count taken
 * during each entropy sample. This field is writable only if true[PRGM] bit is 1.
 * This field will read zeroes if true[PRGM] = 0. This field is cleared to 0000h64
 * by writing the true[RST_DEF] bit to 1.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTFRQMIN_FRQ_MIN field. */
#define TRNG_RD_RTFRQMIN_FRQ_MIN(base) ((TRNG_RTFRQMIN_REG(base) & TRNG_RTFRQMIN_FRQ_MIN_MASK) >> TRNG_RTFRQMIN_FRQ_MIN_SHIFT)
#define TRNG_BRD_RTFRQMIN_FRQ_MIN(base) (TRNG_RD_RTFRQMIN_FRQ_MIN(base))

/*! @brief Set the FRQ_MIN field to a new value. */
#define TRNG_WR_RTFRQMIN_FRQ_MIN(base, value) (TRNG_RMW_RTFRQMIN(base, TRNG_RTFRQMIN_FRQ_MIN_MASK, TRNG_RTFRQMIN_FRQ_MIN(value)))
#define TRNG_BWR_RTFRQMIN_FRQ_MIN(base, value) (TRNG_WR_RTFRQMIN_FRQ_MIN(base, value))
/*@}*/

/*******************************************************************************
 * TRNG_RTFRQCNT - RNG Frequency Count Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTFRQCNT - RNG Frequency Count Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG Frequency Count Register is a read-only register used to read the
 * frequency counter within the TRNG entropy generator. It will read all zeroes
 * unless true[TRNG_ACC] = 1. Note that this offset (0xBASE_061C) is used as true if
 * true[PRGM] is 1. If true[PRGM] is 0, this offset is used as true readback
 * register, as described here.
 */
/*!
 * @name Constants and macros for entire TRNG_RTFRQCNT register
 */
/*@{*/
#define TRNG_RD_RTFRQCNT(base)   (TRNG_RTFRQCNT_REG(base))
/*@}*/

/*
 * Constants & macros for individual TRNG_RTFRQCNT bitfields
 */

/*!
 * @name Register TRNG_RTFRQCNT, field FRQ_CT[21:0] (RO)
 *
 * Frequency Count. If true[TRNG_ACC] = 1, reads a sample frequency count taken
 * during entropy generation. Requires true[PRGM] = 0. Note that if true[PRGM]
 * bit is 1, this register address is used to access the Poker Test Maximum Limit
 * in register true, as defined in the previous section.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTFRQCNT_FRQ_CT field. */
#define TRNG_RD_RTFRQCNT_FRQ_CT(base) ((TRNG_RTFRQCNT_REG(base) & TRNG_RTFRQCNT_FRQ_CT_MASK) >> TRNG_RTFRQCNT_FRQ_CT_SHIFT)
#define TRNG_BRD_RTFRQCNT_FRQ_CT(base) (TRNG_RD_RTFRQCNT_FRQ_CT(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTFRQMAX - RNG Frequency Count Maximum Limit Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTFRQMAX - RNG Frequency Count Maximum Limit Register (RW)
 *
 * Reset value: 0x00006400U
 *
 * The RNG Frequency Count Maximum Limit Register defines the maximum allowable
 * count taken by the Entropy sample counter during each Entropy sample. During
 * any sample period, if the count is greater than this programmed maximum, a
 * Frequency Count Fail is flagged in true[FCT_FAIL] and an error is generated. Note
 * that this address (061C) is used as true only if true[PRGM] is 1. If
 * true[PRGM] is 0, this address is used as true readback register.
 */
/*!
 * @name Constants and macros for entire TRNG_RTFRQMAX register
 */
/*@{*/
#define TRNG_RD_RTFRQMAX(base)   (TRNG_RTFRQMAX_REG(base))
#define TRNG_WR_RTFRQMAX(base, value) (TRNG_RTFRQMAX_REG(base) = (value))
#define TRNG_RMW_RTFRQMAX(base, mask, value) (TRNG_WR_RTFRQMAX(base, (TRNG_RD_RTFRQMAX(base) & ~(mask)) | (value)))
#define TRNG_SET_RTFRQMAX(base, value) (BME_OR32(&TRNG_RTFRQMAX_REG(base), (uint32_t)(value)))
#define TRNG_CLR_RTFRQMAX(base, value) (BME_AND32(&TRNG_RTFRQMAX_REG(base), (uint32_t)(~(value))))
#define TRNG_TOG_RTFRQMAX(base, value) (BME_XOR32(&TRNG_RTFRQMAX_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual TRNG_RTFRQMAX bitfields
 */

/*!
 * @name Register TRNG_RTFRQMAX, field FRQ_MAX[21:0] (RW)
 *
 * Frequency Counter Maximum Limit. Defines the maximum allowable count taken
 * during each entropy sample. This field is writable only if true[PRGM] bit is 1.
 * This register is cleared to 000640h by writing the true[RST_DEF] bit to 1.
 * Note that if true[PRGM] bit is 0, this register address is used to read the
 * Frequency Count result in register true, as defined in the following section.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTFRQMAX_FRQ_MAX field. */
#define TRNG_RD_RTFRQMAX_FRQ_MAX(base) ((TRNG_RTFRQMAX_REG(base) & TRNG_RTFRQMAX_FRQ_MAX_MASK) >> TRNG_RTFRQMAX_FRQ_MAX_SHIFT)
#define TRNG_BRD_RTFRQMAX_FRQ_MAX(base) (TRNG_RD_RTFRQMAX_FRQ_MAX(base))

/*! @brief Set the FRQ_MAX field to a new value. */
#define TRNG_WR_RTFRQMAX_FRQ_MAX(base, value) (TRNG_RMW_RTFRQMAX(base, TRNG_RTFRQMAX_FRQ_MAX_MASK, TRNG_RTFRQMAX_FRQ_MAX(value)))
#define TRNG_BWR_RTFRQMAX_FRQ_MAX(base, value) (TRNG_WR_RTFRQMAX_FRQ_MAX(base, value))
/*@}*/

