pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * TRNG_RTSCMC - RNG Statistical Check Monobit Count Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTSCMC - RNG Statistical Check Monobit Count Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG Statistical Check Monobit Count Register is a read-only register used
 * to read the final monobit count after entropy generation. This counter starts
 * with the value in true[MONO_MAX], and is decremented each time a one is
 * sampled. Note that this offset (0xBASE_0620) is used as true if true[PRGM] is 1. If
 * true[PRGM] is 0, this offset is used as true readback register, as described
 * here.
 */
/*!
 * @name Constants and macros for entire TRNG_RTSCMC register
 */
/*@{*/
#define TRNG_RD_RTSCMC(base)     (TRNG_RTSCMC_REG(base))
/*@}*/

/*
 * Constants & macros for individual TRNG_RTSCMC bitfields
 */

/*!
 * @name Register TRNG_RTSCMC, field MONO_CT[15:0] (RO)
 *
 * Monobit Count. Reads the final Monobit count after entropy generation.
 * Requires true[PRGM] = 0. Note that if true[PRGM] bit is 1, this register address is
 * used to access the Statistical Check Monobit Limit in register true, as
 * defined in the previous section.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCMC_MONO_CT field. */
#define TRNG_RD_RTSCMC_MONO_CT(base) ((TRNG_RTSCMC_REG(base) & TRNG_RTSCMC_MONO_CT_MASK) >> TRNG_RTSCMC_MONO_CT_SHIFT)
#define TRNG_BRD_RTSCMC_MONO_CT(base) (TRNG_RD_RTSCMC_MONO_CT(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTSCML - RNG Statistical Check Monobit Limit Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTSCML - RNG Statistical Check Monobit Limit Register (RW)
 *
 * Reset value: 0x010C0568U
 *
 * The RNG Statistical Check Monobit Limit Register defines the allowable
 * maximum and minimum number of ones/zero detected during entropy generation. To pass
 * the test, the number of ones/zeroes generated must be less than the programmed
 * maximum value, and the number of ones/zeroes generated must be greater than
 * (maximum - range). If this test fails, the Retry Counter in true will be
 * decremented, and a retry will occur if the Retry Count has not reached zero. If the
 * Retry Count has reached zero, an error will be generated. Note that this
 * offset (0xBASE_0620) is used as true only if true[PRGM] is 1. If true[PRGM] is 0,
 * this offset is used as true readback register.
 */
/*!
 * @name Constants and macros for entire TRNG_RTSCML register
 */
/*@{*/
#define TRNG_RD_RTSCML(base)     (TRNG_RTSCML_REG(base))
#define TRNG_WR_RTSCML(base, value) (TRNG_RTSCML_REG(base) = (value))
#define TRNG_RMW_RTSCML(base, mask, value) (TRNG_WR_RTSCML(base, (TRNG_RD_RTSCML(base) & ~(mask)) | (value)))
#define TRNG_SET_RTSCML(base, value) (BME_OR32(&TRNG_RTSCML_REG(base), (uint32_t)(value)))
#define TRNG_CLR_RTSCML(base, value) (BME_AND32(&TRNG_RTSCML_REG(base), (uint32_t)(~(value))))
#define TRNG_TOG_RTSCML(base, value) (BME_XOR32(&TRNG_RTSCML_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual TRNG_RTSCML bitfields
 */

/*!
 * @name Register TRNG_RTSCML, field MONO_MAX[15:0] (RW)
 *
 * Monobit Maximum Limit. Defines the maximum allowable count taken during
 * entropy generation. The number of ones/zeroes detected during entropy generation
 * must be less than MONO_MAX, else a retry or error will occur. This register is
 * cleared to 00056Bh (decimal 1387) by writing the true[RST_DEF] bit to 1.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCML_MONO_MAX field. */
#define TRNG_RD_RTSCML_MONO_MAX(base) ((TRNG_RTSCML_REG(base) & TRNG_RTSCML_MONO_MAX_MASK) >> TRNG_RTSCML_MONO_MAX_SHIFT)
#define TRNG_BRD_RTSCML_MONO_MAX(base) (TRNG_RD_RTSCML_MONO_MAX(base))

/*! @brief Set the MONO_MAX field to a new value. */
#define TRNG_WR_RTSCML_MONO_MAX(base, value) (TRNG_RMW_RTSCML(base, TRNG_RTSCML_MONO_MAX_MASK, TRNG_RTSCML_MONO_MAX(value)))
#define TRNG_BWR_RTSCML_MONO_MAX(base, value) (TRNG_WR_RTSCML_MONO_MAX(base, value))
/*@}*/

/*!
 * @name Register TRNG_RTSCML, field MONO_RNG[31:16] (RW)
 *
 * Monobit Range. The number of ones/zeroes detected during entropy generation
 * must be greater than MONO_MAX - MONO_RNG, else a retry or error will occur.
 * This register is cleared to 000112h (decimal 274) by writing the true[RST_DEF]
 * bit to 1.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCML_MONO_RNG field. */
#define TRNG_RD_RTSCML_MONO_RNG(base) ((TRNG_RTSCML_REG(base) & TRNG_RTSCML_MONO_RNG_MASK) >> TRNG_RTSCML_MONO_RNG_SHIFT)
#define TRNG_BRD_RTSCML_MONO_RNG(base) (TRNG_RD_RTSCML_MONO_RNG(base))

/*! @brief Set the MONO_RNG field to a new value. */
#define TRNG_WR_RTSCML_MONO_RNG(base, value) (TRNG_RMW_RTSCML(base, TRNG_RTSCML_MONO_RNG_MASK, TRNG_RTSCML_MONO_RNG(value)))
#define TRNG_BWR_RTSCML_MONO_RNG(base, value) (TRNG_WR_RTSCML_MONO_RNG(base, value))
/*@}*/

/*******************************************************************************
 * TRNG_RTSCR1C - RNG Statistical Check Run Length 1 Count Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTSCR1C - RNG Statistical Check Run Length 1 Count Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG Statistical Check Run Length 1 Counters Register is a read-only
 * register used to read the final Run Length 1 counts after entropy generation. These
 * counters start with the value in true1L[RUN1_MAX]. The R1_1_CT decrements
 * each time a single one is sampled (preceded by a zero and followed by a zero).
 * The R1_0_CT decrements each time a single zero is sampled (preceded by a one and
 * followed by a one). Note that this offset (0xBASE_0624) is used as true1L if
 * true[PRGM] is 1. If true[PRGM] is 0, this offset is used as true1C readback
 * register, as described here.
 */
/*!
 * @name Constants and macros for entire TRNG_RTSCR1C register
 */
/*@{*/
#define TRNG_RD_RTSCR1C(base)    (TRNG_RTSCR1C_REG(base))
/*@}*/

