pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * Constants & macros for individual TRNG_RTSCR1C bitfields
 */

/*!
 * @name Register TRNG_RTSCR1C, field R1_0_CT[14:0] (RO)
 *
 * Runs of Zero, Length 1 Count. Reads the final Runs of Zeroes, length 1 count
 * after entropy generation. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCR1C_R1_0_CT field. */
#define TRNG_RD_RTSCR1C_R1_0_CT(base) ((TRNG_RTSCR1C_REG(base) & TRNG_RTSCR1C_R1_0_CT_MASK) >> TRNG_RTSCR1C_R1_0_CT_SHIFT)
#define TRNG_BRD_RTSCR1C_R1_0_CT(base) (TRNG_RD_RTSCR1C_R1_0_CT(base))
/*@}*/

/*!
 * @name Register TRNG_RTSCR1C, field R1_1_CT[30:16] (RO)
 *
 * Runs of One, Length 1 Count. Reads the final Runs of Ones, length 1 count
 * after entropy generation. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCR1C_R1_1_CT field. */
#define TRNG_RD_RTSCR1C_R1_1_CT(base) ((TRNG_RTSCR1C_REG(base) & TRNG_RTSCR1C_R1_1_CT_MASK) >> TRNG_RTSCR1C_R1_1_CT_SHIFT)
#define TRNG_BRD_RTSCR1C_R1_1_CT(base) (TRNG_RD_RTSCR1C_R1_1_CT(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTSCR1L - RNG Statistical Check Run Length 1 Limit Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTSCR1L - RNG Statistical Check Run Length 1 Limit Register (RW)
 *
 * Reset value: 0x00B20195U
 *
 * The RNG Statistical Check Run Length 1 Limit Register defines the allowable
 * maximum and minimum number of runs of length 1 detected during entropy
 * generation. To pass the test, the number of runs of length 1 (for samples of both 0
 * and 1) must be less than the programmed maximum value, and the number of runs of
 * length 1 must be greater than (maximum - range). If this test fails, the
 * Retry Counter in true will be decremented, and a retry will occur if the Retry
 * Count has not reached zero. If the Retry Count has reached zero, an error will be
 * generated. Note that this address (0xBASE_0624) is used as true1L only if
 * true[PRGM] is 1. If true[PRGM] is 0, this address is used as true1C readback
 * register.
 */
/*!
 * @name Constants and macros for entire TRNG_RTSCR1L register
 */
/*@{*/
#define TRNG_RD_RTSCR1L(base)    (TRNG_RTSCR1L_REG(base))
#define TRNG_WR_RTSCR1L(base, value) (TRNG_RTSCR1L_REG(base) = (value))
#define TRNG_RMW_RTSCR1L(base, mask, value) (TRNG_WR_RTSCR1L(base, (TRNG_RD_RTSCR1L(base) & ~(mask)) | (value)))
#define TRNG_SET_RTSCR1L(base, value) (BME_OR32(&TRNG_RTSCR1L_REG(base), (uint32_t)(value)))
#define TRNG_CLR_RTSCR1L(base, value) (BME_AND32(&TRNG_RTSCR1L_REG(base), (uint32_t)(~(value))))
#define TRNG_TOG_RTSCR1L(base, value) (BME_XOR32(&TRNG_RTSCR1L_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual TRNG_RTSCR1L bitfields
 */

/*!
 * @name Register TRNG_RTSCR1L, field RUN1_MAX[14:0] (RW)
 *
 * Run Length 1 Maximum Limit. Defines the maximum allowable runs of length 1
 * (for both 0 and 1) detected during entropy generation. The number of runs of
 * length 1 detected during entropy generation must be less than RUN1_MAX, else a
 * retry or error will occur. This register is cleared to 01E5h (decimal 485) by
 * writing the true[RST_DEF] bit to 1.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCR1L_RUN1_MAX field. */
#define TRNG_RD_RTSCR1L_RUN1_MAX(base) ((TRNG_RTSCR1L_REG(base) & TRNG_RTSCR1L_RUN1_MAX_MASK) >> TRNG_RTSCR1L_RUN1_MAX_SHIFT)
#define TRNG_BRD_RTSCR1L_RUN1_MAX(base) (TRNG_RD_RTSCR1L_RUN1_MAX(base))

/*! @brief Set the RUN1_MAX field to a new value. */
#define TRNG_WR_RTSCR1L_RUN1_MAX(base, value) (TRNG_RMW_RTSCR1L(base, TRNG_RTSCR1L_RUN1_MAX_MASK, TRNG_RTSCR1L_RUN1_MAX(value)))
#define TRNG_BWR_RTSCR1L_RUN1_MAX(base, value) (TRNG_WR_RTSCR1L_RUN1_MAX(base, value))
/*@}*/

/*!
 * @name Register TRNG_RTSCR1L, field RUN1_RNG[30:16] (RW)
 *
 * Run Length 1 Range. The number of runs of length 1 (for both 0 and 1)
 * detected during entropy generation must be greater than RUN1_MAX - RUN1_RNG, else a
 * retry or error will occur. This register is cleared to 0102h (decimal 258) by
 * writing the true[RST_DEF] bit to 1.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCR1L_RUN1_RNG field. */
#define TRNG_RD_RTSCR1L_RUN1_RNG(base) ((TRNG_RTSCR1L_REG(base) & TRNG_RTSCR1L_RUN1_RNG_MASK) >> TRNG_RTSCR1L_RUN1_RNG_SHIFT)
#define TRNG_BRD_RTSCR1L_RUN1_RNG(base) (TRNG_RD_RTSCR1L_RUN1_RNG(base))

/*! @brief Set the RUN1_RNG field to a new value. */
#define TRNG_WR_RTSCR1L_RUN1_RNG(base, value) (TRNG_RMW_RTSCR1L(base, TRNG_RTSCR1L_RUN1_RNG_MASK, TRNG_RTSCR1L_RUN1_RNG(value)))
#define TRNG_BWR_RTSCR1L_RUN1_RNG(base, value) (TRNG_WR_RTSCR1L_RUN1_RNG(base, value))
/*@}*/

/*******************************************************************************
 * TRNG_RTSCR2L - RNG Statistical Check Run Length 2 Limit Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTSCR2L - RNG Statistical Check Run Length 2 Limit Register (RW)
 *
 * Reset value: 0x007A00DCU
 *
 * The RNG Statistical Check Run Length 2 Limit Register defines the allowable
 * maximum and minimum number of runs of length 2 detected during entropy
 * generation. To pass the test, the number of runs of length 2 (for samples of both 0
 * and 1) must be less than the programmed maximum value, and the number of runs of
 * length 2 must be greater than (maximum - range). If this test fails, the
 * Retry Counter in true will be decremented, and a retry will occur if the Retry
 * Count has not reached zero. If the Retry Count has reached zero, an error will be
 * generated. Note that this address (0xBASE_0628) is used as true2L only if
 * true[PRGM] is 1. If true[PRGM] is 0, this address is used as true2C readback
 * register.
 */
/*!
 * @name Constants and macros for entire TRNG_RTSCR2L register
 */
/*@{*/
#define TRNG_RD_RTSCR2L(base)    (TRNG_RTSCR2L_REG(base))
#define TRNG_WR_RTSCR2L(base, value) (TRNG_RTSCR2L_REG(base) = (value))
#define TRNG_RMW_RTSCR2L(base, mask, value) (TRNG_WR_RTSCR2L(base, (TRNG_RD_RTSCR2L(base) & ~(mask)) | (value)))
#define TRNG_SET_RTSCR2L(base, value) (BME_OR32(&TRNG_RTSCR2L_REG(base), (uint32_t)(value)))
#define TRNG_CLR_RTSCR2L(base, value) (BME_AND32(&TRNG_RTSCR2L_REG(base), (uint32_t)(~(value))))
#define TRNG_TOG_RTSCR2L(base, value) (BME_XOR32(&TRNG_RTSCR2L_REG(base), (uint32_t)(value)))
/*@}*/

