pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * Constants & macros for individual TRNG_RTSCR2L bitfields
 */

/*!
 * @name Register TRNG_RTSCR2L, field RUN2_MAX[13:0] (RW)
 *
 * Run Length 2 Maximum Limit. Defines the maximum allowable runs of length 2
 * (for both 0 and 1) detected during entropy generation. The number of runs of
 * length 2 detected during entropy generation must be less than RUN2_MAX, else a
 * retry or error will occur. This register is cleared to 00DCh (decimal 220) by
 * writing the true[RST_DEF] bit to 1.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCR2L_RUN2_MAX field. */
#define TRNG_RD_RTSCR2L_RUN2_MAX(base) ((TRNG_RTSCR2L_REG(base) & TRNG_RTSCR2L_RUN2_MAX_MASK) >> TRNG_RTSCR2L_RUN2_MAX_SHIFT)
#define TRNG_BRD_RTSCR2L_RUN2_MAX(base) (TRNG_RD_RTSCR2L_RUN2_MAX(base))

/*! @brief Set the RUN2_MAX field to a new value. */
#define TRNG_WR_RTSCR2L_RUN2_MAX(base, value) (TRNG_RMW_RTSCR2L(base, TRNG_RTSCR2L_RUN2_MAX_MASK, TRNG_RTSCR2L_RUN2_MAX(value)))
#define TRNG_BWR_RTSCR2L_RUN2_MAX(base, value) (TRNG_WR_RTSCR2L_RUN2_MAX(base, value))
/*@}*/

/*!
 * @name Register TRNG_RTSCR2L, field RUN2_RNG[29:16] (RW)
 *
 * Run Length 2 Range. The number of runs of length 2 (for both 0 and 1)
 * detected during entropy generation must be greater than RUN2_MAX - RUN2_RNG, else a
 * retry or error will occur. This register is cleared to 007Ah (decimal 122) by
 * writing the true[RST_DEF] bit to 1.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCR2L_RUN2_RNG field. */
#define TRNG_RD_RTSCR2L_RUN2_RNG(base) ((TRNG_RTSCR2L_REG(base) & TRNG_RTSCR2L_RUN2_RNG_MASK) >> TRNG_RTSCR2L_RUN2_RNG_SHIFT)
#define TRNG_BRD_RTSCR2L_RUN2_RNG(base) (TRNG_RD_RTSCR2L_RUN2_RNG(base))

/*! @brief Set the RUN2_RNG field to a new value. */
#define TRNG_WR_RTSCR2L_RUN2_RNG(base, value) (TRNG_RMW_RTSCR2L(base, TRNG_RTSCR2L_RUN2_RNG_MASK, TRNG_RTSCR2L_RUN2_RNG(value)))
#define TRNG_BWR_RTSCR2L_RUN2_RNG(base, value) (TRNG_WR_RTSCR2L_RUN2_RNG(base, value))
/*@}*/

/*******************************************************************************
 * TRNG_RTSCR2C - RNG Statistical Check Run Length 2 Count Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTSCR2C - RNG Statistical Check Run Length 2 Count Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG Statistical Check Run Length 2 Counters Register is a read-only
 * register used to read the final Run Length 2 counts after entropy generation. These
 * counters start with the value in true2L[RUN2_MAX]. The R2_1_CT decrements
 * each time two consecutive ones are sampled (preceded by a zero and followed by a
 * zero). The R2_0_CT decrements each time two consecutive zeroes are sampled
 * (preceded by a one and followed by a one). Note that this offset (0xBASE_0628) is
 * used as true2L if true[PRGM] is 1. If true[PRGM] is 0, this offset is used as
 * true2C readback register, as described here.
 */
/*!
 * @name Constants and macros for entire TRNG_RTSCR2C register
 */
/*@{*/
#define TRNG_RD_RTSCR2C(base)    (TRNG_RTSCR2C_REG(base))
/*@}*/

/*
 * Constants & macros for individual TRNG_RTSCR2C bitfields
 */

/*!
 * @name Register TRNG_RTSCR2C, field R2_0_CT[13:0] (RO)
 *
 * Runs of Zero, Length 2 Count. Reads the final Runs of Zeroes, length 2 count
 * after entropy generation. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCR2C_R2_0_CT field. */
#define TRNG_RD_RTSCR2C_R2_0_CT(base) ((TRNG_RTSCR2C_REG(base) & TRNG_RTSCR2C_R2_0_CT_MASK) >> TRNG_RTSCR2C_R2_0_CT_SHIFT)
#define TRNG_BRD_RTSCR2C_R2_0_CT(base) (TRNG_RD_RTSCR2C_R2_0_CT(base))
/*@}*/

/*!
 * @name Register TRNG_RTSCR2C, field R2_1_CT[29:16] (RO)
 *
 * Runs of One, Length 2 Count. Reads the final Runs of Ones, length 2 count
 * after entropy generation. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCR2C_R2_1_CT field. */
#define TRNG_RD_RTSCR2C_R2_1_CT(base) ((TRNG_RTSCR2C_REG(base) & TRNG_RTSCR2C_R2_1_CT_MASK) >> TRNG_RTSCR2C_R2_1_CT_SHIFT)
#define TRNG_BRD_RTSCR2C_R2_1_CT(base) (TRNG_RD_RTSCR2C_R2_1_CT(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTSCR3C - RNG Statistical Check Run Length 3 Count Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTSCR3C - RNG Statistical Check Run Length 3 Count Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG Statistical Check Run Length 3 Counters Register is a read-only
 * register used to read the final Run Length 3 counts after entropy generation. These
 * counters start with the value in true3L[RUN3_MAX]. The R3_1_CT decrements
 * each time three consecutive ones are sampled (preceded by a zero and followed by
 * a zero). The R3_0_CT decrements each time three consecutive zeroes are sampled
 * (preceded by a one and followed by a one). Note that this offset
 * (0xBASE_062C) is used as true3L if true[PRGM] is 1. If true[PRGM] is 0, this offset is
 * used as true3C readback register, as described here.
 */
/*!
 * @name Constants and macros for entire TRNG_RTSCR3C register
 */
/*@{*/
#define TRNG_RD_RTSCR3C(base)    (TRNG_RTSCR3C_REG(base))
/*@}*/

/*
 * Constants & macros for individual TRNG_RTSCR3C bitfields
 */

/*!
 * @name Register TRNG_RTSCR3C, field R3_0_CT[12:0] (RO)
 *
 * Runs of Zeroes, Length 3 Count. Reads the final Runs of Zeroes, length 3
 * count after entropy generation. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCR3C_R3_0_CT field. */
#define TRNG_RD_RTSCR3C_R3_0_CT(base) ((TRNG_RTSCR3C_REG(base) & TRNG_RTSCR3C_R3_0_CT_MASK) >> TRNG_RTSCR3C_R3_0_CT_SHIFT)
#define TRNG_BRD_RTSCR3C_R3_0_CT(base) (TRNG_RD_RTSCR3C_R3_0_CT(base))
/*@}*/

/*!
 * @name Register TRNG_RTSCR3C, field R3_1_CT[28:16] (RO)
 *
 * Runs of Ones, Length 3 Count. Reads the final Runs of Ones, length 3 count
 * after entropy generation. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCR3C_R3_1_CT field. */
#define TRNG_RD_RTSCR3C_R3_1_CT(base) ((TRNG_RTSCR3C_REG(base) & TRNG_RTSCR3C_R3_1_CT_MASK) >> TRNG_RTSCR3C_R3_1_CT_SHIFT)
#define TRNG_BRD_RTSCR3C_R3_1_CT(base) (TRNG_RD_RTSCR3C_R3_1_CT(base))
/*@}*/

