pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * TRNG_RTSCR3L - RNG Statistical Check Run Length 3 Limit Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTSCR3L - RNG Statistical Check Run Length 3 Limit Register (RW)
 *
 * Reset value: 0x0058007DU
 *
 * The RNG Statistical Check Run Length 3 Limit Register defines the allowable
 * maximum and minimum number of runs of length 3 detected during entropy
 * generation. To pass the test, the number of runs of length 3 (for samples of both 0
 * and 1) must be less than the programmed maximum value, and the number of runs of
 * length 3 must be greater than (maximum - range). If this test fails, the
 * Retry Counter in true will be decremented, and a retry will occur if the Retry
 * Count has not reached zero. If the Retry Count has reached zero, an error will be
 * generated. Note that this address (0xBASE_062C) is used as true3L only if
 * true[PRGM] is 1. If true[PRGM] is 0, this address is used as true3C readback
 * register.
 */
/*!
 * @name Constants and macros for entire TRNG_RTSCR3L register
 */
/*@{*/
#define TRNG_RD_RTSCR3L(base)    (TRNG_RTSCR3L_REG(base))
#define TRNG_WR_RTSCR3L(base, value) (TRNG_RTSCR3L_REG(base) = (value))
#define TRNG_RMW_RTSCR3L(base, mask, value) (TRNG_WR_RTSCR3L(base, (TRNG_RD_RTSCR3L(base) & ~(mask)) | (value)))
#define TRNG_SET_RTSCR3L(base, value) (BME_OR32(&TRNG_RTSCR3L_REG(base), (uint32_t)(value)))
#define TRNG_CLR_RTSCR3L(base, value) (BME_AND32(&TRNG_RTSCR3L_REG(base), (uint32_t)(~(value))))
#define TRNG_TOG_RTSCR3L(base, value) (BME_XOR32(&TRNG_RTSCR3L_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual TRNG_RTSCR3L bitfields
 */

/*!
 * @name Register TRNG_RTSCR3L, field RUN3_MAX[12:0] (RW)
 *
 * Run Length 3 Maximum Limit. Defines the maximum allowable runs of length 3
 * (for both 0 and 1) detected during entropy generation. The number of runs of
 * length 3 detected during entropy generation must be less than RUN3_MAX, else a
 * retry or error will occur. This register is cleared to 007Dh (decimal 125) by
 * writing the true[RST_DEF] bit to 1.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCR3L_RUN3_MAX field. */
#define TRNG_RD_RTSCR3L_RUN3_MAX(base) ((TRNG_RTSCR3L_REG(base) & TRNG_RTSCR3L_RUN3_MAX_MASK) >> TRNG_RTSCR3L_RUN3_MAX_SHIFT)
#define TRNG_BRD_RTSCR3L_RUN3_MAX(base) (TRNG_RD_RTSCR3L_RUN3_MAX(base))

/*! @brief Set the RUN3_MAX field to a new value. */
#define TRNG_WR_RTSCR3L_RUN3_MAX(base, value) (TRNG_RMW_RTSCR3L(base, TRNG_RTSCR3L_RUN3_MAX_MASK, TRNG_RTSCR3L_RUN3_MAX(value)))
#define TRNG_BWR_RTSCR3L_RUN3_MAX(base, value) (TRNG_WR_RTSCR3L_RUN3_MAX(base, value))
/*@}*/

/*!
 * @name Register TRNG_RTSCR3L, field RUN3_RNG[28:16] (RW)
 *
 * Run Length 3 Range. The number of runs of length 3 (for both 0 and 1)
 * detected during entropy generation must be greater than RUN3_MAX - RUN3_RNG, else a
 * retry or error will occur. This register is cleared to 0058h (decimal 88) by
 * writing the true[RST_DEF] bit to 1.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCR3L_RUN3_RNG field. */
#define TRNG_RD_RTSCR3L_RUN3_RNG(base) ((TRNG_RTSCR3L_REG(base) & TRNG_RTSCR3L_RUN3_RNG_MASK) >> TRNG_RTSCR3L_RUN3_RNG_SHIFT)
#define TRNG_BRD_RTSCR3L_RUN3_RNG(base) (TRNG_RD_RTSCR3L_RUN3_RNG(base))

/*! @brief Set the RUN3_RNG field to a new value. */
#define TRNG_WR_RTSCR3L_RUN3_RNG(base, value) (TRNG_RMW_RTSCR3L(base, TRNG_RTSCR3L_RUN3_RNG_MASK, TRNG_RTSCR3L_RUN3_RNG(value)))
#define TRNG_BWR_RTSCR3L_RUN3_RNG(base, value) (TRNG_WR_RTSCR3L_RUN3_RNG(base, value))
/*@}*/

/*******************************************************************************
 * TRNG_RTSCR4C - RNG Statistical Check Run Length 4 Count Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTSCR4C - RNG Statistical Check Run Length 4 Count Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG Statistical Check Run Length 4 Counters Register is a read-only
 * register used to read the final Run Length 4 counts after entropy generation. These
 * counters start with the value in true4L[RUN4_MAX]. The R4_1_CT decrements
 * each time four consecutive ones are sampled (preceded by a zero and followed by a
 * zero). The R4_0_CT decrements each time four consecutive zeroes are sampled
 * (preceded by a one and followed by a one). Note that this offset (0xBASE_0630)
 * is used as true4L if true[PRGM] is 1. If true[PRGM] is 0, this offset is used
 * as true4C readback register, as described here.
 */
/*!
 * @name Constants and macros for entire TRNG_RTSCR4C register
 */
/*@{*/
#define TRNG_RD_RTSCR4C(base)    (TRNG_RTSCR4C_REG(base))
/*@}*/

/*
 * Constants & macros for individual TRNG_RTSCR4C bitfields
 */

/*!
 * @name Register TRNG_RTSCR4C, field R4_0_CT[11:0] (RO)
 *
 * Runs of Zero, Length 4 Count. Reads the final Runs of Ones, length 4 count
 * after entropy generation. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCR4C_R4_0_CT field. */
#define TRNG_RD_RTSCR4C_R4_0_CT(base) ((TRNG_RTSCR4C_REG(base) & TRNG_RTSCR4C_R4_0_CT_MASK) >> TRNG_RTSCR4C_R4_0_CT_SHIFT)
#define TRNG_BRD_RTSCR4C_R4_0_CT(base) (TRNG_RD_RTSCR4C_R4_0_CT(base))
/*@}*/

/*!
 * @name Register TRNG_RTSCR4C, field R4_1_CT[27:16] (RO)
 *
 * Runs of One, Length 4 Count. Reads the final Runs of Ones, length 4 count
 * after entropy generation. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCR4C_R4_1_CT field. */
#define TRNG_RD_RTSCR4C_R4_1_CT(base) ((TRNG_RTSCR4C_REG(base) & TRNG_RTSCR4C_R4_1_CT_MASK) >> TRNG_RTSCR4C_R4_1_CT_SHIFT)
#define TRNG_BRD_RTSCR4C_R4_1_CT(base) (TRNG_RD_RTSCR4C_R4_1_CT(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTSCR4L - RNG Statistical Check Run Length 4 Limit Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTSCR4L - RNG Statistical Check Run Length 4 Limit Register (RW)
 *
 * Reset value: 0x0040004BU
 *
 * The RNG Statistical Check Run Length 4 Limit Register defines the allowable
 * maximum and minimum number of runs of length 4 detected during entropy
 * generation. To pass the test, the number of runs of length 4 (for samples of both 0
 * and 1) must be less than the programmed maximum value, and the number of runs of
 * length 4 must be greater than (maximum - range). If this test fails, the
 * Retry Counter in true will be decremented, and a retry will occur if the Retry
 * Count has not reached zero. If the Retry Count has reached zero, an error will be
 * generated. Note that this address (0xBASE_0630) is used as true4L only if
 * true[PRGM] is 1. If true[PRGM] is 0, this address is used as true4C readback
 * register.
 */
/*!
 * @name Constants and macros for entire TRNG_RTSCR4L register
 */
/*@{*/
#define TRNG_RD_RTSCR4L(base)    (TRNG_RTSCR4L_REG(base))
#define TRNG_WR_RTSCR4L(base, value) (TRNG_RTSCR4L_REG(base) = (value))
#define TRNG_RMW_RTSCR4L(base, mask, value) (TRNG_WR_RTSCR4L(base, (TRNG_RD_RTSCR4L(base) & ~(mask)) | (value)))
#define TRNG_SET_RTSCR4L(base, value) (BME_OR32(&TRNG_RTSCR4L_REG(base), (uint32_t)(value)))
#define TRNG_CLR_RTSCR4L(base, value) (BME_AND32(&TRNG_RTSCR4L_REG(base), (uint32_t)(~(value))))
#define TRNG_TOG_RTSCR4L(base, value) (BME_XOR32(&TRNG_RTSCR4L_REG(base), (uint32_t)(value)))
/*@}*/

