pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * Constants & macros for individual TRNG_RTSCR4L bitfields
 */

/*!
 * @name Register TRNG_RTSCR4L, field RUN4_MAX[11:0] (RW)
 *
 * Run Length 4 Maximum Limit. Defines the maximum allowable runs of length 4
 * (for both 0 and 1) detected during entropy generation. The number of runs of
 * length 4 detected during entropy generation must be less than RUN4_MAX, else a
 * retry or error will occur. This register is cleared to 004Bh (decimal 75) by
 * writing the true[RST_DEF] bit to 1.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCR4L_RUN4_MAX field. */
#define TRNG_RD_RTSCR4L_RUN4_MAX(base) ((TRNG_RTSCR4L_REG(base) & TRNG_RTSCR4L_RUN4_MAX_MASK) >> TRNG_RTSCR4L_RUN4_MAX_SHIFT)
#define TRNG_BRD_RTSCR4L_RUN4_MAX(base) (TRNG_RD_RTSCR4L_RUN4_MAX(base))

/*! @brief Set the RUN4_MAX field to a new value. */
#define TRNG_WR_RTSCR4L_RUN4_MAX(base, value) (TRNG_RMW_RTSCR4L(base, TRNG_RTSCR4L_RUN4_MAX_MASK, TRNG_RTSCR4L_RUN4_MAX(value)))
#define TRNG_BWR_RTSCR4L_RUN4_MAX(base, value) (TRNG_WR_RTSCR4L_RUN4_MAX(base, value))
/*@}*/

/*!
 * @name Register TRNG_RTSCR4L, field RUN4_RNG[27:16] (RW)
 *
 * Run Length 4 Range. The number of runs of length 4 (for both 0 and 1)
 * detected during entropy generation must be greater than RUN4_MAX - RUN4_RNG, else a
 * retry or error will occur. This register is cleared to 0040h (decimal 64) by
 * writing the true[RST_DEF] bit to 1.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCR4L_RUN4_RNG field. */
#define TRNG_RD_RTSCR4L_RUN4_RNG(base) ((TRNG_RTSCR4L_REG(base) & TRNG_RTSCR4L_RUN4_RNG_MASK) >> TRNG_RTSCR4L_RUN4_RNG_SHIFT)
#define TRNG_BRD_RTSCR4L_RUN4_RNG(base) (TRNG_RD_RTSCR4L_RUN4_RNG(base))

/*! @brief Set the RUN4_RNG field to a new value. */
#define TRNG_WR_RTSCR4L_RUN4_RNG(base, value) (TRNG_RMW_RTSCR4L(base, TRNG_RTSCR4L_RUN4_RNG_MASK, TRNG_RTSCR4L_RUN4_RNG(value)))
#define TRNG_BWR_RTSCR4L_RUN4_RNG(base, value) (TRNG_WR_RTSCR4L_RUN4_RNG(base, value))
/*@}*/

/*******************************************************************************
 * TRNG_RTSCR5L - RNG Statistical Check Run Length 5 Limit Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTSCR5L - RNG Statistical Check Run Length 5 Limit Register (RW)
 *
 * Reset value: 0x002E002FU
 *
 * The RNG Statistical Check Run Length 5 Limit Register defines the allowable
 * maximum and minimum number of runs of length 5 detected during entropy
 * generation. To pass the test, the number of runs of length 5 (for samples of both 0
 * and 1) must be less than the programmed maximum value, and the number of runs of
 * length 5 must be greater than (maximum - range). If this test fails, the
 * Retry Counter in true will be decremented, and a retry will occur if the Retry
 * Count has not reached zero. If the Retry Count has reached zero, an error will be
 * generated. Note that this address (0xBASE_0634) is used as true5L only if
 * true[PRGM] is 1. If true[PRGM] is 0, this address is used as true5C readback
 * register.
 */
/*!
 * @name Constants and macros for entire TRNG_RTSCR5L register
 */
/*@{*/
#define TRNG_RD_RTSCR5L(base)    (TRNG_RTSCR5L_REG(base))
#define TRNG_WR_RTSCR5L(base, value) (TRNG_RTSCR5L_REG(base) = (value))
#define TRNG_RMW_RTSCR5L(base, mask, value) (TRNG_WR_RTSCR5L(base, (TRNG_RD_RTSCR5L(base) & ~(mask)) | (value)))
#define TRNG_SET_RTSCR5L(base, value) (BME_OR32(&TRNG_RTSCR5L_REG(base), (uint32_t)(value)))
#define TRNG_CLR_RTSCR5L(base, value) (BME_AND32(&TRNG_RTSCR5L_REG(base), (uint32_t)(~(value))))
#define TRNG_TOG_RTSCR5L(base, value) (BME_XOR32(&TRNG_RTSCR5L_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual TRNG_RTSCR5L bitfields
 */

/*!
 * @name Register TRNG_RTSCR5L, field RUN5_MAX[10:0] (RW)
 *
 * Run Length 5 Maximum Limit. Defines the maximum allowable runs of length 5
 * (for both 0 and 1) detected during entropy generation. The number of runs of
 * length 5 detected during entropy generation must be less than RUN5_MAX, else a
 * retry or error will occur. This register is cleared to 002Fh (decimal 47) by
 * writing the true[RST_DEF] bit to 1.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCR5L_RUN5_MAX field. */
#define TRNG_RD_RTSCR5L_RUN5_MAX(base) ((TRNG_RTSCR5L_REG(base) & TRNG_RTSCR5L_RUN5_MAX_MASK) >> TRNG_RTSCR5L_RUN5_MAX_SHIFT)
#define TRNG_BRD_RTSCR5L_RUN5_MAX(base) (TRNG_RD_RTSCR5L_RUN5_MAX(base))

/*! @brief Set the RUN5_MAX field to a new value. */
#define TRNG_WR_RTSCR5L_RUN5_MAX(base, value) (TRNG_RMW_RTSCR5L(base, TRNG_RTSCR5L_RUN5_MAX_MASK, TRNG_RTSCR5L_RUN5_MAX(value)))
#define TRNG_BWR_RTSCR5L_RUN5_MAX(base, value) (TRNG_WR_RTSCR5L_RUN5_MAX(base, value))
/*@}*/

/*!
 * @name Register TRNG_RTSCR5L, field RUN5_RNG[26:16] (RW)
 *
 * Run Length 5 Range. The number of runs of length 5 (for both 0 and 1)
 * detected during entropy generation must be greater than RUN5_MAX - RUN5_RNG, else a
 * retry or error will occur. This register is cleared to 002Eh (decimal 46) by
 * writing the true[RST_DEF] bit to 1.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCR5L_RUN5_RNG field. */
#define TRNG_RD_RTSCR5L_RUN5_RNG(base) ((TRNG_RTSCR5L_REG(base) & TRNG_RTSCR5L_RUN5_RNG_MASK) >> TRNG_RTSCR5L_RUN5_RNG_SHIFT)
#define TRNG_BRD_RTSCR5L_RUN5_RNG(base) (TRNG_RD_RTSCR5L_RUN5_RNG(base))

/*! @brief Set the RUN5_RNG field to a new value. */
#define TRNG_WR_RTSCR5L_RUN5_RNG(base, value) (TRNG_RMW_RTSCR5L(base, TRNG_RTSCR5L_RUN5_RNG_MASK, TRNG_RTSCR5L_RUN5_RNG(value)))
#define TRNG_BWR_RTSCR5L_RUN5_RNG(base, value) (TRNG_WR_RTSCR5L_RUN5_RNG(base, value))
/*@}*/

/*******************************************************************************
 * TRNG_RTSCR5C - RNG Statistical Check Run Length 5 Count Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTSCR5C - RNG Statistical Check Run Length 5 Count Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG Statistical Check Run Length 5 Counters Register is a read-only
 * register used to read the final Run Length 5 counts after entropy generation. These
 * counters start with the value in true5L[RUN5_MAX]. The R5_1_CT decrements
 * each time five consecutive ones are sampled (preceded by a zero and followed by a
 * zero). The R5_0_CT decrements each time five consecutive zeroes are sampled
 * (preceded by a one and followed by a one). Note that this offset (0xBASE_0634)
 * is used as true5L if true[PRGM] is 1. If true[PRGM] is 0, this offset is used
 * as true5C readback register, as described here.
 */
/*!
 * @name Constants and macros for entire TRNG_RTSCR5C register
 */
/*@{*/
#define TRNG_RD_RTSCR5C(base)    (TRNG_RTSCR5C_REG(base))
/*@}*/

