pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * Constants & macros for individual TRNG_RTSCR5C bitfields
 */

/*!
 * @name Register TRNG_RTSCR5C, field R5_0_CT[10:0] (RO)
 *
 * Runs of Zero, Length 5 Count. Reads the final Runs of Ones, length 5 count
 * after entropy generation. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCR5C_R5_0_CT field. */
#define TRNG_RD_RTSCR5C_R5_0_CT(base) ((TRNG_RTSCR5C_REG(base) & TRNG_RTSCR5C_R5_0_CT_MASK) >> TRNG_RTSCR5C_R5_0_CT_SHIFT)
#define TRNG_BRD_RTSCR5C_R5_0_CT(base) (TRNG_RD_RTSCR5C_R5_0_CT(base))
/*@}*/

/*!
 * @name Register TRNG_RTSCR5C, field R5_1_CT[26:16] (RO)
 *
 * Runs of One, Length 5 Count. Reads the final Runs of Ones, length 5 count
 * after entropy generation. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCR5C_R5_1_CT field. */
#define TRNG_RD_RTSCR5C_R5_1_CT(base) ((TRNG_RTSCR5C_REG(base) & TRNG_RTSCR5C_R5_1_CT_MASK) >> TRNG_RTSCR5C_R5_1_CT_SHIFT)
#define TRNG_BRD_RTSCR5C_R5_1_CT(base) (TRNG_RD_RTSCR5C_R5_1_CT(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTSCR6PC - RNG Statistical Check Run Length 6+ Count Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTSCR6PC - RNG Statistical Check Run Length 6+ Count Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG Statistical Check Run Length 6+ Counters Register is a read-only
 * register used to read the final Run Length 6+ counts after entropy generation.
 * These counters start with the value in true6PL[RUN6P_MAX]. The R6P_1_CT
 * decrements each time six or more consecutive ones are sampled (preceded by a zero and
 * followed by a zero). The R6P_0_CT decrements each time six or more consecutive
 * zeroes are sampled (preceded by a one and followed by a one). Note that this
 * offset (0xBASE_0638) is used as true6PL if true[PRGM] is 1. If true[PRGM] is 0,
 * this offset is used as true6PC readback register, as described here.
 */
/*!
 * @name Constants and macros for entire TRNG_RTSCR6PC register
 */
/*@{*/
#define TRNG_RD_RTSCR6PC(base)   (TRNG_RTSCR6PC_REG(base))
/*@}*/

/*
 * Constants & macros for individual TRNG_RTSCR6PC bitfields
 */

/*!
 * @name Register TRNG_RTSCR6PC, field R6P_0_CT[10:0] (RO)
 *
 * Runs of Zero, Length 6+ Count. Reads the final Runs of Ones, length 6+ count
 * after entropy generation. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCR6PC_R6P_0_CT field. */
#define TRNG_RD_RTSCR6PC_R6P_0_CT(base) ((TRNG_RTSCR6PC_REG(base) & TRNG_RTSCR6PC_R6P_0_CT_MASK) >> TRNG_RTSCR6PC_R6P_0_CT_SHIFT)
#define TRNG_BRD_RTSCR6PC_R6P_0_CT(base) (TRNG_RD_RTSCR6PC_R6P_0_CT(base))
/*@}*/

/*!
 * @name Register TRNG_RTSCR6PC, field R6P_1_CT[26:16] (RO)
 *
 * Runs of One, Length 6+ Count. Reads the final Runs of Ones, length 6+ count
 * after entropy generation. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCR6PC_R6P_1_CT field. */
#define TRNG_RD_RTSCR6PC_R6P_1_CT(base) ((TRNG_RTSCR6PC_REG(base) & TRNG_RTSCR6PC_R6P_1_CT_MASK) >> TRNG_RTSCR6PC_R6P_1_CT_SHIFT)
#define TRNG_BRD_RTSCR6PC_R6P_1_CT(base) (TRNG_RD_RTSCR6PC_R6P_1_CT(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTSCR6PL - RNG Statistical Check Run Length 6+ Limit Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTSCR6PL - RNG Statistical Check Run Length 6+ Limit Register (RW)
 *
 * Reset value: 0x002E002FU
 *
 * The RNG Statistical Check Run Length 6+ Limit Register defines the allowable
 * maximum and minimum number of runs of length 6 or more detected during entropy
 * generation. To pass the test, the number of runs of length 6 or more (for
 * samples of both 0 and 1) must be less than the programmed maximum value, and the
 * number of runs of length 6 or more must be greater than (maximum - range). If
 * this test fails, the Retry Counter in true will be decremented, and a retry
 * will occur if the Retry Count has not reached zero. If the Retry Count has
 * reached zero, an error will be generated. Note that this offset (0xBASE_0638) is
 * used as true6PL only if true[PRGM] is 1. If true[PRGM] is 0, this offset is used
 * as true6PC readback register.
 */
/*!
 * @name Constants and macros for entire TRNG_RTSCR6PL register
 */
/*@{*/
#define TRNG_RD_RTSCR6PL(base)   (TRNG_RTSCR6PL_REG(base))
#define TRNG_WR_RTSCR6PL(base, value) (TRNG_RTSCR6PL_REG(base) = (value))
#define TRNG_RMW_RTSCR6PL(base, mask, value) (TRNG_WR_RTSCR6PL(base, (TRNG_RD_RTSCR6PL(base) & ~(mask)) | (value)))
#define TRNG_SET_RTSCR6PL(base, value) (BME_OR32(&TRNG_RTSCR6PL_REG(base), (uint32_t)(value)))
#define TRNG_CLR_RTSCR6PL(base, value) (BME_AND32(&TRNG_RTSCR6PL_REG(base), (uint32_t)(~(value))))
#define TRNG_TOG_RTSCR6PL(base, value) (BME_XOR32(&TRNG_RTSCR6PL_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual TRNG_RTSCR6PL bitfields
 */

/*!
 * @name Register TRNG_RTSCR6PL, field RUN6P_MAX[10:0] (RW)
 *
 * Run Length 6+ Maximum Limit. Defines the maximum allowable runs of length 6
 * or more (for both 0 and 1) detected during entropy generation. The number of
 * runs of length 6 or more detected during entropy generation must be less than
 * RUN6P_MAX, else a retry or error will occur. This register is cleared to 002Fh
 * (decimal 47) by writing the true[RST_DEF] bit to 1.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCR6PL_RUN6P_MAX field. */
#define TRNG_RD_RTSCR6PL_RUN6P_MAX(base) ((TRNG_RTSCR6PL_REG(base) & TRNG_RTSCR6PL_RUN6P_MAX_MASK) >> TRNG_RTSCR6PL_RUN6P_MAX_SHIFT)
#define TRNG_BRD_RTSCR6PL_RUN6P_MAX(base) (TRNG_RD_RTSCR6PL_RUN6P_MAX(base))

/*! @brief Set the RUN6P_MAX field to a new value. */
#define TRNG_WR_RTSCR6PL_RUN6P_MAX(base, value) (TRNG_RMW_RTSCR6PL(base, TRNG_RTSCR6PL_RUN6P_MAX_MASK, TRNG_RTSCR6PL_RUN6P_MAX(value)))
#define TRNG_BWR_RTSCR6PL_RUN6P_MAX(base, value) (TRNG_WR_RTSCR6PL_RUN6P_MAX(base, value))
/*@}*/

/*!
 * @name Register TRNG_RTSCR6PL, field RUN6P_RNG[26:16] (RW)
 *
 * Run Length 6+ Range. The number of runs of length 6 or more (for both 0 and
 * 1) detected during entropy generation must be greater than RUN6P_MAX -
 * RUN6P_RNG, else a retry or error will occur. This register is cleared to 002Eh
 * (decimal 46) by writing the true[RST_DEF] bit to 1.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSCR6PL_RUN6P_RNG field. */
#define TRNG_RD_RTSCR6PL_RUN6P_RNG(base) ((TRNG_RTSCR6PL_REG(base) & TRNG_RTSCR6PL_RUN6P_RNG_MASK) >> TRNG_RTSCR6PL_RUN6P_RNG_SHIFT)
#define TRNG_BRD_RTSCR6PL_RUN6P_RNG(base) (TRNG_RD_RTSCR6PL_RUN6P_RNG(base))

/*! @brief Set the RUN6P_RNG field to a new value. */
#define TRNG_WR_RTSCR6PL_RUN6P_RNG(base, value) (TRNG_RMW_RTSCR6PL(base, TRNG_RTSCR6PL_RUN6P_RNG_MASK, TRNG_RTSCR6PL_RUN6P_RNG(value)))
#define TRNG_BWR_RTSCR6PL_RUN6P_RNG(base, value) (TRNG_WR_RTSCR6PL_RUN6P_RNG(base, value))
/*@}*/

