pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * TRNG_RTSTATUS - RNG Status Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTSTATUS - RNG Status Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * Various statistical tests are run as a normal part of the TRNG's entropy
 * generation process. The least-significant 16 bits of the true register reflect the
 * result of each of these tests. The status of these bits will be valid when
 * the TRNG has finished its entropy generation process. Software can determine
 * when this occurs by polling the ENT_VAL bit in the RNG Miscellaneous Control
 * Register. Note that there is a very small probability that a statistical test will
 * fail even though the TRNG is operating properly. If this happens the TRNG
 * will automatically retry the entire entropy generation process, including running
 * all the statistical tests. The value in RETRY_CT is decremented each time an
 * entropy generation retry occurs. If a statistical check fails when the retry
 * count is nonzero, a retry is initiated. But if a statistical check fails when
 * the retry count is zero, an error is generated by the RNG. By default RETRY_CT
 * is initialized to 1, but software can increase the retry count by writing to
 * the RTY_CT field in the true register. All 0s will be returned if this register
 * address is read while the RNG is in Program Mode (see PRGM field in true
 * register. If this register is read while the RNG is in Run Mode the value returned
 * will be formatted as follows.
 */
/*!
 * @name Constants and macros for entire TRNG_RTSTATUS register
 */
/*@{*/
#define TRNG_RD_RTSTATUS(base)   (TRNG_RTSTATUS_REG(base))
/*@}*/

/*
 * Constants & macros for individual TRNG_RTSTATUS bitfields
 */

/*!
 * @name Register TRNG_RTSTATUS, field TF1BR0[0] (RO)
 *
 * Test Fail, 1-Bit Run, Sampling 0s. If TF1BR0=1, the 1-Bit Run, Sampling 0s
 * Test has failed.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSTATUS_TF1BR0 field. */
#define TRNG_RD_RTSTATUS_TF1BR0(base) ((TRNG_RTSTATUS_REG(base) & TRNG_RTSTATUS_TF1BR0_MASK) >> TRNG_RTSTATUS_TF1BR0_SHIFT)
#define TRNG_BRD_RTSTATUS_TF1BR0(base) (BME_UBFX32(&TRNG_RTSTATUS_REG(base), TRNG_RTSTATUS_TF1BR0_SHIFT, TRNG_RTSTATUS_TF1BR0_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTSTATUS, field TF1BR1[1] (RO)
 *
 * Test Fail, 1-Bit Run, Sampling 1s. If TF1BR1=1, the 1-Bit Run, Sampling 1s
 * Test has failed.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSTATUS_TF1BR1 field. */
#define TRNG_RD_RTSTATUS_TF1BR1(base) ((TRNG_RTSTATUS_REG(base) & TRNG_RTSTATUS_TF1BR1_MASK) >> TRNG_RTSTATUS_TF1BR1_SHIFT)
#define TRNG_BRD_RTSTATUS_TF1BR1(base) (BME_UBFX32(&TRNG_RTSTATUS_REG(base), TRNG_RTSTATUS_TF1BR1_SHIFT, TRNG_RTSTATUS_TF1BR1_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTSTATUS, field TF2BR0[2] (RO)
 *
 * Test Fail, 2-Bit Run, Sampling 0s. If TF2BR0=1, the 2-Bit Run, Sampling 0s
 * Test has failed.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSTATUS_TF2BR0 field. */
#define TRNG_RD_RTSTATUS_TF2BR0(base) ((TRNG_RTSTATUS_REG(base) & TRNG_RTSTATUS_TF2BR0_MASK) >> TRNG_RTSTATUS_TF2BR0_SHIFT)
#define TRNG_BRD_RTSTATUS_TF2BR0(base) (BME_UBFX32(&TRNG_RTSTATUS_REG(base), TRNG_RTSTATUS_TF2BR0_SHIFT, TRNG_RTSTATUS_TF2BR0_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTSTATUS, field TF2BR1[3] (RO)
 *
 * Test Fail, 2-Bit Run, Sampling 1s. If TF2BR1=1, the 2-Bit Run, Sampling 1s
 * Test has failed.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSTATUS_TF2BR1 field. */
#define TRNG_RD_RTSTATUS_TF2BR1(base) ((TRNG_RTSTATUS_REG(base) & TRNG_RTSTATUS_TF2BR1_MASK) >> TRNG_RTSTATUS_TF2BR1_SHIFT)
#define TRNG_BRD_RTSTATUS_TF2BR1(base) (BME_UBFX32(&TRNG_RTSTATUS_REG(base), TRNG_RTSTATUS_TF2BR1_SHIFT, TRNG_RTSTATUS_TF2BR1_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTSTATUS, field TF3BR0[4] (RO)
 *
 * Test Fail, 3-Bit Run, Sampling 0s. If TF3BR0=1, the 3-Bit Run, Sampling 0s
 * Test has failed.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSTATUS_TF3BR0 field. */
#define TRNG_RD_RTSTATUS_TF3BR0(base) ((TRNG_RTSTATUS_REG(base) & TRNG_RTSTATUS_TF3BR0_MASK) >> TRNG_RTSTATUS_TF3BR0_SHIFT)
#define TRNG_BRD_RTSTATUS_TF3BR0(base) (BME_UBFX32(&TRNG_RTSTATUS_REG(base), TRNG_RTSTATUS_TF3BR0_SHIFT, TRNG_RTSTATUS_TF3BR0_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTSTATUS, field TF3BR1[5] (RO)
 *
 * Test Fail, 3-Bit Run, Sampling 1s. If TF3BR1=1, the 3-Bit Run, Sampling 1s
 * Test has failed.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSTATUS_TF3BR1 field. */
#define TRNG_RD_RTSTATUS_TF3BR1(base) ((TRNG_RTSTATUS_REG(base) & TRNG_RTSTATUS_TF3BR1_MASK) >> TRNG_RTSTATUS_TF3BR1_SHIFT)
#define TRNG_BRD_RTSTATUS_TF3BR1(base) (BME_UBFX32(&TRNG_RTSTATUS_REG(base), TRNG_RTSTATUS_TF3BR1_SHIFT, TRNG_RTSTATUS_TF3BR1_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTSTATUS, field TF4BR0[6] (RO)
 *
 * Test Fail, 4-Bit Run, Sampling 0s. If TF4BR0=1, the 4-Bit Run, Sampling 0s
 * Test has failed.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSTATUS_TF4BR0 field. */
#define TRNG_RD_RTSTATUS_TF4BR0(base) ((TRNG_RTSTATUS_REG(base) & TRNG_RTSTATUS_TF4BR0_MASK) >> TRNG_RTSTATUS_TF4BR0_SHIFT)
#define TRNG_BRD_RTSTATUS_TF4BR0(base) (BME_UBFX32(&TRNG_RTSTATUS_REG(base), TRNG_RTSTATUS_TF4BR0_SHIFT, TRNG_RTSTATUS_TF4BR0_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTSTATUS, field TF4BR1[7] (RO)
 *
 * Test Fail, 4-Bit Run, Sampling 1s. If TF4BR1=1, the 4-Bit Run, Sampling 1s
 * Test has failed.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSTATUS_TF4BR1 field. */
#define TRNG_RD_RTSTATUS_TF4BR1(base) ((TRNG_RTSTATUS_REG(base) & TRNG_RTSTATUS_TF4BR1_MASK) >> TRNG_RTSTATUS_TF4BR1_SHIFT)
#define TRNG_BRD_RTSTATUS_TF4BR1(base) (BME_UBFX32(&TRNG_RTSTATUS_REG(base), TRNG_RTSTATUS_TF4BR1_SHIFT, TRNG_RTSTATUS_TF4BR1_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTSTATUS, field TF5BR0[8] (RO)
 *
 * Test Fail, 5-Bit Run, Sampling 0s. If TF5BR0=1, the 5-Bit Run, Sampling 0s
 * Test has failed.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSTATUS_TF5BR0 field. */
#define TRNG_RD_RTSTATUS_TF5BR0(base) ((TRNG_RTSTATUS_REG(base) & TRNG_RTSTATUS_TF5BR0_MASK) >> TRNG_RTSTATUS_TF5BR0_SHIFT)
#define TRNG_BRD_RTSTATUS_TF5BR0(base) (BME_UBFX32(&TRNG_RTSTATUS_REG(base), TRNG_RTSTATUS_TF5BR0_SHIFT, TRNG_RTSTATUS_TF5BR0_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTSTATUS, field TF5BR1[9] (RO)
 *
 * Test Fail, 5-Bit Run, Sampling 1s. If TF5BR1=1, the 5-Bit Run, Sampling 1s
 * Test has failed.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSTATUS_TF5BR1 field. */
#define TRNG_RD_RTSTATUS_TF5BR1(base) ((TRNG_RTSTATUS_REG(base) & TRNG_RTSTATUS_TF5BR1_MASK) >> TRNG_RTSTATUS_TF5BR1_SHIFT)
#define TRNG_BRD_RTSTATUS_TF5BR1(base) (BME_UBFX32(&TRNG_RTSTATUS_REG(base), TRNG_RTSTATUS_TF5BR1_SHIFT, TRNG_RTSTATUS_TF5BR1_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTSTATUS, field TF6PBR0[10] (RO)
 *
 * Test Fail, 6 Plus Bit Run, Sampling 0s. If TF6PBR0=1, the 6 Plus Bit Run,
 * Sampling 0s Test has failed.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSTATUS_TF6PBR0 field. */
#define TRNG_RD_RTSTATUS_TF6PBR0(base) ((TRNG_RTSTATUS_REG(base) & TRNG_RTSTATUS_TF6PBR0_MASK) >> TRNG_RTSTATUS_TF6PBR0_SHIFT)
#define TRNG_BRD_RTSTATUS_TF6PBR0(base) (BME_UBFX32(&TRNG_RTSTATUS_REG(base), TRNG_RTSTATUS_TF6PBR0_SHIFT, TRNG_RTSTATUS_TF6PBR0_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTSTATUS, field TF6PBR1[11] (RO)
 *
 * Test Fail, 6 Plus Bit Run, Sampling 1s. If TF6PBR1=1, the 6 Plus Bit Run,
 * Sampling 1s Test has failed.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSTATUS_TF6PBR1 field. */
#define TRNG_RD_RTSTATUS_TF6PBR1(base) ((TRNG_RTSTATUS_REG(base) & TRNG_RTSTATUS_TF6PBR1_MASK) >> TRNG_RTSTATUS_TF6PBR1_SHIFT)
#define TRNG_BRD_RTSTATUS_TF6PBR1(base) (BME_UBFX32(&TRNG_RTSTATUS_REG(base), TRNG_RTSTATUS_TF6PBR1_SHIFT, TRNG_RTSTATUS_TF6PBR1_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTSTATUS, field TFSB[12] (RO)
 *
 * Test Fail, Sparse Bit. If TFSB=1, the Sparse Bit Test has failed.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSTATUS_TFSB field. */
#define TRNG_RD_RTSTATUS_TFSB(base) ((TRNG_RTSTATUS_REG(base) & TRNG_RTSTATUS_TFSB_MASK) >> TRNG_RTSTATUS_TFSB_SHIFT)
#define TRNG_BRD_RTSTATUS_TFSB(base) (BME_UBFX32(&TRNG_RTSTATUS_REG(base), TRNG_RTSTATUS_TFSB_SHIFT, TRNG_RTSTATUS_TFSB_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTSTATUS, field TFLR[13] (RO)
 *
 * Test Fail, Long Run. If TFLR=1, the Long Run Test has failed.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSTATUS_TFLR field. */
#define TRNG_RD_RTSTATUS_TFLR(base) ((TRNG_RTSTATUS_REG(base) & TRNG_RTSTATUS_TFLR_MASK) >> TRNG_RTSTATUS_TFLR_SHIFT)
#define TRNG_BRD_RTSTATUS_TFLR(base) (BME_UBFX32(&TRNG_RTSTATUS_REG(base), TRNG_RTSTATUS_TFLR_SHIFT, TRNG_RTSTATUS_TFLR_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTSTATUS, field TFP[14] (RO)
 *
 * Test Fail, Poker. If TFP=1, the Poker Test has failed.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSTATUS_TFP field. */
#define TRNG_RD_RTSTATUS_TFP(base) ((TRNG_RTSTATUS_REG(base) & TRNG_RTSTATUS_TFP_MASK) >> TRNG_RTSTATUS_TFP_SHIFT)
#define TRNG_BRD_RTSTATUS_TFP(base) (BME_UBFX32(&TRNG_RTSTATUS_REG(base), TRNG_RTSTATUS_TFP_SHIFT, TRNG_RTSTATUS_TFP_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTSTATUS, field TFMB[15] (RO)
 *
 * Test Fail, Mono Bit. If TFMB=1, the Mono Bit Test has failed.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSTATUS_TFMB field. */
#define TRNG_RD_RTSTATUS_TFMB(base) ((TRNG_RTSTATUS_REG(base) & TRNG_RTSTATUS_TFMB_MASK) >> TRNG_RTSTATUS_TFMB_SHIFT)
#define TRNG_BRD_RTSTATUS_TFMB(base) (BME_UBFX32(&TRNG_RTSTATUS_REG(base), TRNG_RTSTATUS_TFMB_SHIFT, TRNG_RTSTATUS_TFMB_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_RTSTATUS, field RETRY_CT[19:16] (RO)
 *
 * RETRY COUNT. This represents the current number of entropy generation retries
 * left before a statistical text failure will cause the RNG to generate an
 * error condition.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTSTATUS_RETRY_CT field. */
#define TRNG_RD_RTSTATUS_RETRY_CT(base) ((TRNG_RTSTATUS_REG(base) & TRNG_RTSTATUS_RETRY_CT_MASK) >> TRNG_RTSTATUS_RETRY_CT_SHIFT)
#define TRNG_BRD_RTSTATUS_RETRY_CT(base) (BME_UBFX32(&TRNG_RTSTATUS_REG(base), TRNG_RTSTATUS_RETRY_CT_SHIFT, TRNG_RTSTATUS_RETRY_CT_WIDTH))
/*@}*/

