pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * TRNG_RTENT0 - RNG TRNG Entropy Read Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTENT0 - RNG TRNG Entropy Read Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG TRNG can be programmed to generate an entropy value that is readable
 * via the SkyBlue bus. To do this, set the true[TRNG_ACC] bit to 1. Once the
 * entropy value has been generated, the true[ENT_VAL] bit will be set to 1. At this
 * point, true0 through true15 may be read to retrieve the 512-bit entropy
 * value. Note that once true15 is read, the entropy value will be cleared and a new
 * value will begin generation, so it is important that true15 be read last. These
 * registers are readable only when true[PRGM] = 0 (Run Mode), true[TRNG_ACC] =
 * 1 (TRNG access mode) and true[ENT_VAL] = 1, otherwise zeroes will be read.
 */
/*!
 * @name Constants and macros for entire TRNG_RTENT0 register
 */
/*@{*/
#define TRNG_RD_RTENT0(base)     (TRNG_RTENT0_REG(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTENT1 - RNG TRNG Entropy Read Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTENT1 - RNG TRNG Entropy Read Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG TRNG can be programmed to generate an entropy value that is readable
 * via the SkyBlue bus. To do this, set the true[TRNG_ACC] bit to 1. Once the
 * entropy value has been generated, the true[ENT_VAL] bit will be set to 1. At this
 * point, true0 through true15 may be read to retrieve the 512-bit entropy
 * value. Note that once true15 is read, the entropy value will be cleared and a new
 * value will begin generation, so it is important that true15 be read last. These
 * registers are readable only when true[PRGM] = 0 (Run Mode), true[TRNG_ACC] =
 * 1 (TRNG access mode) and true[ENT_VAL] = 1, otherwise zeroes will be read.
 */
/*!
 * @name Constants and macros for entire TRNG_RTENT1 register
 */
/*@{*/
#define TRNG_RD_RTENT1(base)     (TRNG_RTENT1_REG(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTENT2 - RNG TRNG Entropy Read Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTENT2 - RNG TRNG Entropy Read Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG TRNG can be programmed to generate an entropy value that is readable
 * via the SkyBlue bus. To do this, set the true[TRNG_ACC] bit to 1. Once the
 * entropy value has been generated, the true[ENT_VAL] bit will be set to 1. At this
 * point, true0 through true15 may be read to retrieve the 512-bit entropy
 * value. Note that once true15 is read, the entropy value will be cleared and a new
 * value will begin generation, so it is important that true15 be read last. These
 * registers are readable only when true[PRGM] = 0 (Run Mode), true[TRNG_ACC] =
 * 1 (TRNG access mode) and true[ENT_VAL] = 1, otherwise zeroes will be read.
 */
/*!
 * @name Constants and macros for entire TRNG_RTENT2 register
 */
/*@{*/
#define TRNG_RD_RTENT2(base)     (TRNG_RTENT2_REG(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTENT3 - RNG TRNG Entropy Read Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTENT3 - RNG TRNG Entropy Read Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG TRNG can be programmed to generate an entropy value that is readable
 * via the SkyBlue bus. To do this, set the true[TRNG_ACC] bit to 1. Once the
 * entropy value has been generated, the true[ENT_VAL] bit will be set to 1. At this
 * point, true0 through true15 may be read to retrieve the 512-bit entropy
 * value. Note that once true15 is read, the entropy value will be cleared and a new
 * value will begin generation, so it is important that true15 be read last. These
 * registers are readable only when true[PRGM] = 0 (Run Mode), true[TRNG_ACC] =
 * 1 (TRNG access mode) and true[ENT_VAL] = 1, otherwise zeroes will be read.
 */
/*!
 * @name Constants and macros for entire TRNG_RTENT3 register
 */
/*@{*/
#define TRNG_RD_RTENT3(base)     (TRNG_RTENT3_REG(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTENT4 - RNG TRNG Entropy Read Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTENT4 - RNG TRNG Entropy Read Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG TRNG can be programmed to generate an entropy value that is readable
 * via the SkyBlue bus. To do this, set the true[TRNG_ACC] bit to 1. Once the
 * entropy value has been generated, the true[ENT_VAL] bit will be set to 1. At this
 * point, true0 through true15 may be read to retrieve the 512-bit entropy
 * value. Note that once true15 is read, the entropy value will be cleared and a new
 * value will begin generation, so it is important that true15 be read last. These
 * registers are readable only when true[PRGM] = 0 (Run Mode), true[TRNG_ACC] =
 * 1 (TRNG access mode) and true[ENT_VAL] = 1, otherwise zeroes will be read.
 */
/*!
 * @name Constants and macros for entire TRNG_RTENT4 register
 */
/*@{*/
#define TRNG_RD_RTENT4(base)     (TRNG_RTENT4_REG(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTENT5 - RNG TRNG Entropy Read Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTENT5 - RNG TRNG Entropy Read Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG TRNG can be programmed to generate an entropy value that is readable
 * via the SkyBlue bus. To do this, set the true[TRNG_ACC] bit to 1. Once the
 * entropy value has been generated, the true[ENT_VAL] bit will be set to 1. At this
 * point, true0 through true15 may be read to retrieve the 512-bit entropy
 * value. Note that once true15 is read, the entropy value will be cleared and a new
 * value will begin generation, so it is important that true15 be read last. These
 * registers are readable only when true[PRGM] = 0 (Run Mode), true[TRNG_ACC] =
 * 1 (TRNG access mode) and true[ENT_VAL] = 1, otherwise zeroes will be read.
 */
/*!
 * @name Constants and macros for entire TRNG_RTENT5 register
 */
/*@{*/
#define TRNG_RD_RTENT5(base)     (TRNG_RTENT5_REG(base))
/*@}*/

