pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * TRNG_RTENT6 - RNG TRNG Entropy Read Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTENT6 - RNG TRNG Entropy Read Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG TRNG can be programmed to generate an entropy value that is readable
 * via the SkyBlue bus. To do this, set the true[TRNG_ACC] bit to 1. Once the
 * entropy value has been generated, the true[ENT_VAL] bit will be set to 1. At this
 * point, true0 through true15 may be read to retrieve the 512-bit entropy
 * value. Note that once true15 is read, the entropy value will be cleared and a new
 * value will begin generation, so it is important that true15 be read last. These
 * registers are readable only when true[PRGM] = 0 (Run Mode), true[TRNG_ACC] =
 * 1 (TRNG access mode) and true[ENT_VAL] = 1, otherwise zeroes will be read.
 */
/*!
 * @name Constants and macros for entire TRNG_RTENT6 register
 */
/*@{*/
#define TRNG_RD_RTENT6(base)     (TRNG_RTENT6_REG(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTENT7 - RNG TRNG Entropy Read Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTENT7 - RNG TRNG Entropy Read Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG TRNG can be programmed to generate an entropy value that is readable
 * via the SkyBlue bus. To do this, set the true[TRNG_ACC] bit to 1. Once the
 * entropy value has been generated, the true[ENT_VAL] bit will be set to 1. At this
 * point, true0 through true15 may be read to retrieve the 512-bit entropy
 * value. Note that once true15 is read, the entropy value will be cleared and a new
 * value will begin generation, so it is important that true15 be read last. These
 * registers are readable only when true[PRGM] = 0 (Run Mode), true[TRNG_ACC] =
 * 1 (TRNG access mode) and true[ENT_VAL] = 1, otherwise zeroes will be read.
 */
/*!
 * @name Constants and macros for entire TRNG_RTENT7 register
 */
/*@{*/
#define TRNG_RD_RTENT7(base)     (TRNG_RTENT7_REG(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTENT8 - RNG TRNG Entropy Read Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTENT8 - RNG TRNG Entropy Read Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG TRNG can be programmed to generate an entropy value that is readable
 * via the SkyBlue bus. To do this, set the true[TRNG_ACC] bit to 1. Once the
 * entropy value has been generated, the true[ENT_VAL] bit will be set to 1. At this
 * point, true0 through true15 may be read to retrieve the 512-bit entropy
 * value. Note that once true15 is read, the entropy value will be cleared and a new
 * value will begin generation, so it is important that true15 be read last. These
 * registers are readable only when true[PRGM] = 0 (Run Mode), true[TRNG_ACC] =
 * 1 (TRNG access mode) and true[ENT_VAL] = 1, otherwise zeroes will be read.
 */
/*!
 * @name Constants and macros for entire TRNG_RTENT8 register
 */
/*@{*/
#define TRNG_RD_RTENT8(base)     (TRNG_RTENT8_REG(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTENT9 - RNG TRNG Entropy Read Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTENT9 - RNG TRNG Entropy Read Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG TRNG can be programmed to generate an entropy value that is readable
 * via the SkyBlue bus. To do this, set the true[TRNG_ACC] bit to 1. Once the
 * entropy value has been generated, the true[ENT_VAL] bit will be set to 1. At this
 * point, true0 through true15 may be read to retrieve the 512-bit entropy
 * value. Note that once true15 is read, the entropy value will be cleared and a new
 * value will begin generation, so it is important that true15 be read last. These
 * registers are readable only when true[PRGM] = 0 (Run Mode), true[TRNG_ACC] =
 * 1 (TRNG access mode) and true[ENT_VAL] = 1, otherwise zeroes will be read.
 */
/*!
 * @name Constants and macros for entire TRNG_RTENT9 register
 */
/*@{*/
#define TRNG_RD_RTENT9(base)     (TRNG_RTENT9_REG(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTENT10 - RNG TRNG Entropy Read Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTENT10 - RNG TRNG Entropy Read Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG TRNG can be programmed to generate an entropy value that is readable
 * via the SkyBlue bus. To do this, set the true[TRNG_ACC] bit to 1. Once the
 * entropy value has been generated, the true[ENT_VAL] bit will be set to 1. At this
 * point, true0 through true15 may be read to retrieve the 512-bit entropy
 * value. Note that once true15 is read, the entropy value will be cleared and a new
 * value will begin generation, so it is important that true15 be read last. These
 * registers are readable only when true[PRGM] = 0 (Run Mode), true[TRNG_ACC] =
 * 1 (TRNG access mode) and true[ENT_VAL] = 1, otherwise zeroes will be read.
 */
/*!
 * @name Constants and macros for entire TRNG_RTENT10 register
 */
/*@{*/
#define TRNG_RD_RTENT10(base)    (TRNG_RTENT10_REG(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTENT11 - RNG TRNG Entropy Read Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTENT11 - RNG TRNG Entropy Read Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG TRNG can be programmed to generate an entropy value that is readable
 * via the SkyBlue bus. To do this, set the true[TRNG_ACC] bit to 1. Once the
 * entropy value has been generated, the true[ENT_VAL] bit will be set to 1. At this
 * point, true0 through true15 may be read to retrieve the 512-bit entropy
 * value. Note that once true15 is read, the entropy value will be cleared and a new
 * value will begin generation, so it is important that true15 be read last. These
 * registers are readable only when true[PRGM] = 0 (Run Mode), true[TRNG_ACC] =
 * 1 (TRNG access mode) and true[ENT_VAL] = 1, otherwise zeroes will be read.
 */
/*!
 * @name Constants and macros for entire TRNG_RTENT11 register
 */
/*@{*/
#define TRNG_RD_RTENT11(base)    (TRNG_RTENT11_REG(base))
/*@}*/

