pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * TRNG_RTENT12 - RNG TRNG Entropy Read Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTENT12 - RNG TRNG Entropy Read Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG TRNG can be programmed to generate an entropy value that is readable
 * via the SkyBlue bus. To do this, set the true[TRNG_ACC] bit to 1. Once the
 * entropy value has been generated, the true[ENT_VAL] bit will be set to 1. At this
 * point, true0 through true15 may be read to retrieve the 512-bit entropy
 * value. Note that once true15 is read, the entropy value will be cleared and a new
 * value will begin generation, so it is important that true15 be read last. These
 * registers are readable only when true[PRGM] = 0 (Run Mode), true[TRNG_ACC] =
 * 1 (TRNG access mode) and true[ENT_VAL] = 1, otherwise zeroes will be read.
 */
/*!
 * @name Constants and macros for entire TRNG_RTENT12 register
 */
/*@{*/
#define TRNG_RD_RTENT12(base)    (TRNG_RTENT12_REG(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTENT13 - RNG TRNG Entropy Read Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTENT13 - RNG TRNG Entropy Read Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG TRNG can be programmed to generate an entropy value that is readable
 * via the SkyBlue bus. To do this, set the true[TRNG_ACC] bit to 1. Once the
 * entropy value has been generated, the true[ENT_VAL] bit will be set to 1. At this
 * point, true0 through true15 may be read to retrieve the 512-bit entropy
 * value. Note that once true15 is read, the entropy value will be cleared and a new
 * value will begin generation, so it is important that true15 be read last. These
 * registers are readable only when true[PRGM] = 0 (Run Mode), true[TRNG_ACC] =
 * 1 (TRNG access mode) and true[ENT_VAL] = 1, otherwise zeroes will be read.
 */
/*!
 * @name Constants and macros for entire TRNG_RTENT13 register
 */
/*@{*/
#define TRNG_RD_RTENT13(base)    (TRNG_RTENT13_REG(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTENT14 - RNG TRNG Entropy Read Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTENT14 - RNG TRNG Entropy Read Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG TRNG can be programmed to generate an entropy value that is readable
 * via the SkyBlue bus. To do this, set the true[TRNG_ACC] bit to 1. Once the
 * entropy value has been generated, the true[ENT_VAL] bit will be set to 1. At this
 * point, true0 through true15 may be read to retrieve the 512-bit entropy
 * value. Note that once true15 is read, the entropy value will be cleared and a new
 * value will begin generation, so it is important that true15 be read last. These
 * registers are readable only when true[PRGM] = 0 (Run Mode), true[TRNG_ACC] =
 * 1 (TRNG access mode) and true[ENT_VAL] = 1, otherwise zeroes will be read.
 */
/*!
 * @name Constants and macros for entire TRNG_RTENT14 register
 */
/*@{*/
#define TRNG_RD_RTENT14(base)    (TRNG_RTENT14_REG(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTENT15 - RNG TRNG Entropy Read Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTENT15 - RNG TRNG Entropy Read Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG TRNG can be programmed to generate an entropy value that is readable
 * via the SkyBlue bus. To do this, set the true[TRNG_ACC] bit to 1. Once the
 * entropy value has been generated, the true[ENT_VAL] bit will be set to 1. At this
 * point, true0 through true15 may be read to retrieve the 512-bit entropy
 * value. Note that once true15 is read, the entropy value will be cleared and a new
 * value will begin generation, so it is important that true15 be read last. These
 * registers are readable only when true[PRGM] = 0 (Run Mode), true[TRNG_ACC] =
 * 1 (TRNG access mode) and true[ENT_VAL] = 1, otherwise zeroes will be read.
 */
/*!
 * @name Constants and macros for entire TRNG_RTENT15 register
 */
/*@{*/
#define TRNG_RD_RTENT15(base)    (TRNG_RTENT15_REG(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTPKRCNT10 - RNG Statistical Check Poker Count 1 and 0 Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTPKRCNT10 - RNG Statistical Check Poker Count 1 and 0 Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG Statistical Check Poker Count 1 and 0 Register is a read-only
 * register used to read the final Poker test counts of 1h and 0h patterns. The Poker 0h
 * Count increments each time a nibble of sample data is found to be 0h. The
 * Poker 1h Count increments each time a nibble of sample data is found to be 1h.
 * Note that this register is readable only if true[PRGM] is 0, otherwise zeroes
 * will be read.
 */
/*!
 * @name Constants and macros for entire TRNG_RTPKRCNT10 register
 */
/*@{*/
#define TRNG_RD_RTPKRCNT10(base) (TRNG_RTPKRCNT10_REG(base))
/*@}*/

/*
 * Constants & macros for individual TRNG_RTPKRCNT10 bitfields
 */

/*!
 * @name Register TRNG_RTPKRCNT10, field PKR_0_CT[15:0] (RO)
 *
 * Poker 0h Count. Total number of nibbles of sample data which were found to be
 * 0h. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTPKRCNT10_PKR_0_CT field. */
#define TRNG_RD_RTPKRCNT10_PKR_0_CT(base) ((TRNG_RTPKRCNT10_REG(base) & TRNG_RTPKRCNT10_PKR_0_CT_MASK) >> TRNG_RTPKRCNT10_PKR_0_CT_SHIFT)
#define TRNG_BRD_RTPKRCNT10_PKR_0_CT(base) (TRNG_RD_RTPKRCNT10_PKR_0_CT(base))
/*@}*/

/*!
 * @name Register TRNG_RTPKRCNT10, field PKR_1_CT[31:16] (RO)
 *
 * Poker 1h Count. Total number of nibbles of sample data which were found to be
 * 1h. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTPKRCNT10_PKR_1_CT field. */
#define TRNG_RD_RTPKRCNT10_PKR_1_CT(base) ((TRNG_RTPKRCNT10_REG(base) & TRNG_RTPKRCNT10_PKR_1_CT_MASK) >> TRNG_RTPKRCNT10_PKR_1_CT_SHIFT)
#define TRNG_BRD_RTPKRCNT10_PKR_1_CT(base) (TRNG_RD_RTPKRCNT10_PKR_1_CT(base))
/*@}*/

