pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * TRNG_RTPKRCNT32 - RNG Statistical Check Poker Count 3 and 2 Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTPKRCNT32 - RNG Statistical Check Poker Count 3 and 2 Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG Statistical Check Poker Count 3 and 2 Register is a read-only
 * register used to read the final Poker test counts of 3h and 2h patterns. The Poker 2h
 * Count increments each time a nibble of sample data is found to be 2h. The
 * Poker 3h Count increments each time a nibble of sample data is found to be 3h.
 * Note that this register is readable only if true[PRGM] is 0, otherwise zeroes
 * will be read.
 */
/*!
 * @name Constants and macros for entire TRNG_RTPKRCNT32 register
 */
/*@{*/
#define TRNG_RD_RTPKRCNT32(base) (TRNG_RTPKRCNT32_REG(base))
/*@}*/

/*
 * Constants & macros for individual TRNG_RTPKRCNT32 bitfields
 */

/*!
 * @name Register TRNG_RTPKRCNT32, field PKR_2_CT[15:0] (RO)
 *
 * Poker 2h Count. Total number of nibbles of sample data which were found to be
 * 2h. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTPKRCNT32_PKR_2_CT field. */
#define TRNG_RD_RTPKRCNT32_PKR_2_CT(base) ((TRNG_RTPKRCNT32_REG(base) & TRNG_RTPKRCNT32_PKR_2_CT_MASK) >> TRNG_RTPKRCNT32_PKR_2_CT_SHIFT)
#define TRNG_BRD_RTPKRCNT32_PKR_2_CT(base) (TRNG_RD_RTPKRCNT32_PKR_2_CT(base))
/*@}*/

/*!
 * @name Register TRNG_RTPKRCNT32, field PKR_3_CT[31:16] (RO)
 *
 * Poker 3h Count. Total number of nibbles of sample data which were found to be
 * 3h. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTPKRCNT32_PKR_3_CT field. */
#define TRNG_RD_RTPKRCNT32_PKR_3_CT(base) ((TRNG_RTPKRCNT32_REG(base) & TRNG_RTPKRCNT32_PKR_3_CT_MASK) >> TRNG_RTPKRCNT32_PKR_3_CT_SHIFT)
#define TRNG_BRD_RTPKRCNT32_PKR_3_CT(base) (TRNG_RD_RTPKRCNT32_PKR_3_CT(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTPKRCNT54 - RNG Statistical Check Poker Count 5 and 4 Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTPKRCNT54 - RNG Statistical Check Poker Count 5 and 4 Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG Statistical Check Poker Count 5 and 4 Register is a read-only
 * register used to read the final Poker test counts of 5h and 4h patterns. The Poker 4h
 * Count increments each time a nibble of sample data is found to be 4h. The
 * Poker 5h Count increments each time a nibble of sample data is found to be 5h.
 * Note that this register is readable only if true[PRGM] is 0, otherwise zeroes
 * will be read.
 */
/*!
 * @name Constants and macros for entire TRNG_RTPKRCNT54 register
 */
/*@{*/
#define TRNG_RD_RTPKRCNT54(base) (TRNG_RTPKRCNT54_REG(base))
/*@}*/

/*
 * Constants & macros for individual TRNG_RTPKRCNT54 bitfields
 */

/*!
 * @name Register TRNG_RTPKRCNT54, field PKR_4_CT[15:0] (RO)
 *
 * Poker 4h Count. Total number of nibbles of sample data which were found to be
 * 4h. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTPKRCNT54_PKR_4_CT field. */
#define TRNG_RD_RTPKRCNT54_PKR_4_CT(base) ((TRNG_RTPKRCNT54_REG(base) & TRNG_RTPKRCNT54_PKR_4_CT_MASK) >> TRNG_RTPKRCNT54_PKR_4_CT_SHIFT)
#define TRNG_BRD_RTPKRCNT54_PKR_4_CT(base) (TRNG_RD_RTPKRCNT54_PKR_4_CT(base))
/*@}*/

/*!
 * @name Register TRNG_RTPKRCNT54, field PKR_5_CT[31:16] (RO)
 *
 * Poker 5h Count. Total number of nibbles of sample data which were found to be
 * 5h. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTPKRCNT54_PKR_5_CT field. */
#define TRNG_RD_RTPKRCNT54_PKR_5_CT(base) ((TRNG_RTPKRCNT54_REG(base) & TRNG_RTPKRCNT54_PKR_5_CT_MASK) >> TRNG_RTPKRCNT54_PKR_5_CT_SHIFT)
#define TRNG_BRD_RTPKRCNT54_PKR_5_CT(base) (TRNG_RD_RTPKRCNT54_PKR_5_CT(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTPKRCNT76 - RNG Statistical Check Poker Count 7 and 6 Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTPKRCNT76 - RNG Statistical Check Poker Count 7 and 6 Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG Statistical Check Poker Count 7 and 6 Register is a read-only
 * register used to read the final Poker test counts of 7h and 6h patterns. The Poker 6h
 * Count increments each time a nibble of sample data is found to be 6h. The
 * Poker 7h Count increments each time a nibble of sample data is found to be 7h.
 * Note that this register is readable only if true[PRGM] is 0, otherwise zeroes
 * will be read.
 */
/*!
 * @name Constants and macros for entire TRNG_RTPKRCNT76 register
 */
/*@{*/
#define TRNG_RD_RTPKRCNT76(base) (TRNG_RTPKRCNT76_REG(base))
/*@}*/

/*
 * Constants & macros for individual TRNG_RTPKRCNT76 bitfields
 */

/*!
 * @name Register TRNG_RTPKRCNT76, field PKR_6_CT[15:0] (RO)
 *
 * Poker 6h Count. Total number of nibbles of sample data which were found to be
 * 6h. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTPKRCNT76_PKR_6_CT field. */
#define TRNG_RD_RTPKRCNT76_PKR_6_CT(base) ((TRNG_RTPKRCNT76_REG(base) & TRNG_RTPKRCNT76_PKR_6_CT_MASK) >> TRNG_RTPKRCNT76_PKR_6_CT_SHIFT)
#define TRNG_BRD_RTPKRCNT76_PKR_6_CT(base) (TRNG_RD_RTPKRCNT76_PKR_6_CT(base))
/*@}*/

/*!
 * @name Register TRNG_RTPKRCNT76, field PKR_7_CT[31:16] (RO)
 *
 * Poker 7h Count. Total number of nibbles of sample data which were found to be
 * 7h. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTPKRCNT76_PKR_7_CT field. */
#define TRNG_RD_RTPKRCNT76_PKR_7_CT(base) ((TRNG_RTPKRCNT76_REG(base) & TRNG_RTPKRCNT76_PKR_7_CT_MASK) >> TRNG_RTPKRCNT76_PKR_7_CT_SHIFT)
#define TRNG_BRD_RTPKRCNT76_PKR_7_CT(base) (TRNG_RD_RTPKRCNT76_PKR_7_CT(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTPKRCNT98 - RNG Statistical Check Poker Count 9 and 8 Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTPKRCNT98 - RNG Statistical Check Poker Count 9 and 8 Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG Statistical Check Poker Count 9 and 8 Register is a read-only
 * register used to read the final Poker test counts of 9h and 8h patterns. The Poker 8h
 * Count increments each time a nibble of sample data is found to be 8h. The
 * Poker 9h Count increments each time a nibble of sample data is found to be 9h.
 * Note that this register is readable only if true[PRGM] is 0, otherwise zeroes
 * will be read.
 */
/*!
 * @name Constants and macros for entire TRNG_RTPKRCNT98 register
 */
/*@{*/
#define TRNG_RD_RTPKRCNT98(base) (TRNG_RTPKRCNT98_REG(base))
/*@}*/

