pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * Constants & macros for individual TRNG_RTPKRCNT98 bitfields
 */

/*!
 * @name Register TRNG_RTPKRCNT98, field PKR_8_CT[15:0] (RO)
 *
 * Poker 8h Count. Total number of nibbles of sample data which were found to be
 * 8h. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTPKRCNT98_PKR_8_CT field. */
#define TRNG_RD_RTPKRCNT98_PKR_8_CT(base) ((TRNG_RTPKRCNT98_REG(base) & TRNG_RTPKRCNT98_PKR_8_CT_MASK) >> TRNG_RTPKRCNT98_PKR_8_CT_SHIFT)
#define TRNG_BRD_RTPKRCNT98_PKR_8_CT(base) (TRNG_RD_RTPKRCNT98_PKR_8_CT(base))
/*@}*/

/*!
 * @name Register TRNG_RTPKRCNT98, field PKR_9_CT[31:16] (RO)
 *
 * Poker 9h Count. Total number of nibbles of sample data which were found to be
 * 9h. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTPKRCNT98_PKR_9_CT field. */
#define TRNG_RD_RTPKRCNT98_PKR_9_CT(base) ((TRNG_RTPKRCNT98_REG(base) & TRNG_RTPKRCNT98_PKR_9_CT_MASK) >> TRNG_RTPKRCNT98_PKR_9_CT_SHIFT)
#define TRNG_BRD_RTPKRCNT98_PKR_9_CT(base) (TRNG_RD_RTPKRCNT98_PKR_9_CT(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTPKRCNTBA - RNG Statistical Check Poker Count B and A Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTPKRCNTBA - RNG Statistical Check Poker Count B and A Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG Statistical Check Poker Count B and A Register is a read-only
 * register used to read the final Poker test counts of Bh and Ah patterns. The Poker Ah
 * Count increments each time a nibble of sample data is found to be Ah. The
 * Poker Bh Count increments each time a nibble of sample data is found to be Bh.
 * Note that this register is readable only if true[PRGM] is 0, otherwise zeroes
 * will be read.
 */
/*!
 * @name Constants and macros for entire TRNG_RTPKRCNTBA register
 */
/*@{*/
#define TRNG_RD_RTPKRCNTBA(base) (TRNG_RTPKRCNTBA_REG(base))
/*@}*/

/*
 * Constants & macros for individual TRNG_RTPKRCNTBA bitfields
 */

/*!
 * @name Register TRNG_RTPKRCNTBA, field PKR_A_CT[15:0] (RO)
 *
 * Poker Ah Count. Total number of nibbles of sample data which were found to be
 * Ah. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTPKRCNTBA_PKR_A_CT field. */
#define TRNG_RD_RTPKRCNTBA_PKR_A_CT(base) ((TRNG_RTPKRCNTBA_REG(base) & TRNG_RTPKRCNTBA_PKR_A_CT_MASK) >> TRNG_RTPKRCNTBA_PKR_A_CT_SHIFT)
#define TRNG_BRD_RTPKRCNTBA_PKR_A_CT(base) (TRNG_RD_RTPKRCNTBA_PKR_A_CT(base))
/*@}*/

/*!
 * @name Register TRNG_RTPKRCNTBA, field PKR_B_CT[31:16] (RO)
 *
 * Poker Bh Count. Total number of nibbles of sample data which were found to be
 * Bh. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTPKRCNTBA_PKR_B_CT field. */
#define TRNG_RD_RTPKRCNTBA_PKR_B_CT(base) ((TRNG_RTPKRCNTBA_REG(base) & TRNG_RTPKRCNTBA_PKR_B_CT_MASK) >> TRNG_RTPKRCNTBA_PKR_B_CT_SHIFT)
#define TRNG_BRD_RTPKRCNTBA_PKR_B_CT(base) (TRNG_RD_RTPKRCNTBA_PKR_B_CT(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTPKRCNTDC - RNG Statistical Check Poker Count D and C Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTPKRCNTDC - RNG Statistical Check Poker Count D and C Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG Statistical Check Poker Count D and C Register is a read-only
 * register used to read the final Poker test counts of Dh and Ch patterns. The Poker Ch
 * Count increments each time a nibble of sample data is found to be Ch. The
 * Poker Dh Count increments each time a nibble of sample data is found to be Dh.
 * Note that this register is readable only if true[PRGM] is 0, otherwise zeroes
 * will be read.
 */
/*!
 * @name Constants and macros for entire TRNG_RTPKRCNTDC register
 */
/*@{*/
#define TRNG_RD_RTPKRCNTDC(base) (TRNG_RTPKRCNTDC_REG(base))
/*@}*/

/*
 * Constants & macros for individual TRNG_RTPKRCNTDC bitfields
 */

/*!
 * @name Register TRNG_RTPKRCNTDC, field PKR_C_CT[15:0] (RO)
 *
 * Poker Ch Count. Total number of nibbles of sample data which were found to be
 * Ch. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTPKRCNTDC_PKR_C_CT field. */
#define TRNG_RD_RTPKRCNTDC_PKR_C_CT(base) ((TRNG_RTPKRCNTDC_REG(base) & TRNG_RTPKRCNTDC_PKR_C_CT_MASK) >> TRNG_RTPKRCNTDC_PKR_C_CT_SHIFT)
#define TRNG_BRD_RTPKRCNTDC_PKR_C_CT(base) (TRNG_RD_RTPKRCNTDC_PKR_C_CT(base))
/*@}*/

/*!
 * @name Register TRNG_RTPKRCNTDC, field PKR_D_CT[31:16] (RO)
 *
 * Poker Dh Count. Total number of nibbles of sample data which were found to be
 * Dh. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTPKRCNTDC_PKR_D_CT field. */
#define TRNG_RD_RTPKRCNTDC_PKR_D_CT(base) ((TRNG_RTPKRCNTDC_REG(base) & TRNG_RTPKRCNTDC_PKR_D_CT_MASK) >> TRNG_RTPKRCNTDC_PKR_D_CT_SHIFT)
#define TRNG_BRD_RTPKRCNTDC_PKR_D_CT(base) (TRNG_RD_RTPKRCNTDC_PKR_D_CT(base))
/*@}*/

/*******************************************************************************
 * TRNG_RTPKRCNTFE - RNG Statistical Check Poker Count F and E Register
 ******************************************************************************/

/*!
 * @brief TRNG_RTPKRCNTFE - RNG Statistical Check Poker Count F and E Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The RNG Statistical Check Poker Count F and E Register is a read-only
 * register used to read the final Poker test counts of Fh and Eh patterns. The Poker Eh
 * Count increments each time a nibble of sample data is found to be Eh. The
 * Poker Fh Count increments each time a nibble of sample data is found to be Fh.
 * Note that this register is readable only if true[PRGM] is 0, otherwise zeroes
 * will be read.
 */
/*!
 * @name Constants and macros for entire TRNG_RTPKRCNTFE register
 */
/*@{*/
#define TRNG_RD_RTPKRCNTFE(base) (TRNG_RTPKRCNTFE_REG(base))
/*@}*/

/*
 * Constants & macros for individual TRNG_RTPKRCNTFE bitfields
 */

/*!
 * @name Register TRNG_RTPKRCNTFE, field PKR_E_CT[15:0] (RO)
 *
 * Poker Eh Count. Total number of nibbles of sample data which were found to be
 * Eh. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTPKRCNTFE_PKR_E_CT field. */
#define TRNG_RD_RTPKRCNTFE_PKR_E_CT(base) ((TRNG_RTPKRCNTFE_REG(base) & TRNG_RTPKRCNTFE_PKR_E_CT_MASK) >> TRNG_RTPKRCNTFE_PKR_E_CT_SHIFT)
#define TRNG_BRD_RTPKRCNTFE_PKR_E_CT(base) (TRNG_RD_RTPKRCNTFE_PKR_E_CT(base))
/*@}*/

/*!
 * @name Register TRNG_RTPKRCNTFE, field PKR_F_CT[31:16] (RO)
 *
 * Poker Fh Count. Total number of nibbles of sample data which were found to be
 * Fh. Requires true[PRGM] = 0.
 */
/*@{*/
/*! @brief Read current value of the TRNG_RTPKRCNTFE_PKR_F_CT field. */
#define TRNG_RD_RTPKRCNTFE_PKR_F_CT(base) ((TRNG_RTPKRCNTFE_REG(base) & TRNG_RTPKRCNTFE_PKR_F_CT_MASK) >> TRNG_RTPKRCNTFE_PKR_F_CT_SHIFT)
#define TRNG_BRD_RTPKRCNTFE_PKR_F_CT(base) (TRNG_RD_RTPKRCNTFE_PKR_F_CT(base))
/*@}*/

