pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * TRNG_SA_TRNG_SEC_CFG - RNG Security Configuration Register
 ******************************************************************************/

/*!
 * @brief TRNG_SA_TRNG_SEC_CFG - RNG Security Configuration Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The RNG Security Configuration Register is a read/write register used to
 * control the test mode, programmability and state modes of the RNG. Many bits are
 * place holders for this version. More configurability will be added here. Clears
 * on asynchronous reset. For SA-TRNG releases before 2014/July/01, offsets 0xA0
 * to 0xAC used to be 0xB0 to 0xBC respectively. So, update newer tests that use
 * these registers, if hard coded.
 */
/*!
 * @name Constants and macros for entire TRNG_SA_TRNG_SEC_CFG register
 */
/*@{*/
#define TRNG_RD_SA_TRNG_SEC_CFG(base) (TRNG_SA_TRNG_SEC_CFG_REG(base))
#define TRNG_WR_SA_TRNG_SEC_CFG(base, value) (TRNG_SA_TRNG_SEC_CFG_REG(base) = (value))
#define TRNG_RMW_SA_TRNG_SEC_CFG(base, mask, value) (TRNG_WR_SA_TRNG_SEC_CFG(base, (TRNG_RD_SA_TRNG_SEC_CFG(base) & ~(mask)) | (value)))
#define TRNG_SET_SA_TRNG_SEC_CFG(base, value) (BME_OR32(&TRNG_SA_TRNG_SEC_CFG_REG(base), (uint32_t)(value)))
#define TRNG_CLR_SA_TRNG_SEC_CFG(base, value) (BME_AND32(&TRNG_SA_TRNG_SEC_CFG_REG(base), (uint32_t)(~(value))))
#define TRNG_TOG_SA_TRNG_SEC_CFG(base, value) (BME_XOR32(&TRNG_SA_TRNG_SEC_CFG_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual TRNG_SA_TRNG_SEC_CFG bitfields
 */

/*!
 * @name Register TRNG_SA_TRNG_SEC_CFG, field SH0[0] (RW)
 *
 * Reserved. DRNG specific, not applicable to this version.
 *
 * Values:
 * - 0b0 - See DRNG version.
 * - 0b1 - See DRNG version.
 */
/*@{*/
/*! @brief Read current value of the TRNG_SA_TRNG_SEC_CFG_SH0 field. */
#define TRNG_RD_SA_TRNG_SEC_CFG_SH0(base) ((TRNG_SA_TRNG_SEC_CFG_REG(base) & TRNG_SA_TRNG_SEC_CFG_SH0_MASK) >> TRNG_SA_TRNG_SEC_CFG_SH0_SHIFT)
#define TRNG_BRD_SA_TRNG_SEC_CFG_SH0(base) (BME_UBFX32(&TRNG_SA_TRNG_SEC_CFG_REG(base), TRNG_SA_TRNG_SEC_CFG_SH0_SHIFT, TRNG_SA_TRNG_SEC_CFG_SH0_WIDTH))

/*! @brief Set the SH0 field to a new value. */
#define TRNG_WR_SA_TRNG_SEC_CFG_SH0(base, value) (TRNG_RMW_SA_TRNG_SEC_CFG(base, TRNG_SA_TRNG_SEC_CFG_SH0_MASK, TRNG_SA_TRNG_SEC_CFG_SH0(value)))
#define TRNG_BWR_SA_TRNG_SEC_CFG_SH0(base, value) (BME_BFI32(&TRNG_SA_TRNG_SEC_CFG_REG(base), ((uint32_t)(value) << TRNG_SA_TRNG_SEC_CFG_SH0_SHIFT), TRNG_SA_TRNG_SEC_CFG_SH0_SHIFT, TRNG_SA_TRNG_SEC_CFG_SH0_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_SA_TRNG_SEC_CFG, field NO_PRGM[1] (RW)
 *
 * If set the TRNG registers cannot be programmed. That is, regardless of the
 * TRNG access mode in the SA-TRNG Miscellaneous Control Register.
 *
 * Values:
 * - 0b0 - Programability of registers controlled only by the RNG Miscellaneous
 *     Control Register's access mode bit.
 * - 0b1 - Overides RNG Miscellaneous Control Register access mode and prevents
 *     TRNG register programming.
 */
/*@{*/
/*! @brief Read current value of the TRNG_SA_TRNG_SEC_CFG_NO_PRGM field. */
#define TRNG_RD_SA_TRNG_SEC_CFG_NO_PRGM(base) ((TRNG_SA_TRNG_SEC_CFG_REG(base) & TRNG_SA_TRNG_SEC_CFG_NO_PRGM_MASK) >> TRNG_SA_TRNG_SEC_CFG_NO_PRGM_SHIFT)
#define TRNG_BRD_SA_TRNG_SEC_CFG_NO_PRGM(base) (BME_UBFX32(&TRNG_SA_TRNG_SEC_CFG_REG(base), TRNG_SA_TRNG_SEC_CFG_NO_PRGM_SHIFT, TRNG_SA_TRNG_SEC_CFG_NO_PRGM_WIDTH))

/*! @brief Set the NO_PRGM field to a new value. */
#define TRNG_WR_SA_TRNG_SEC_CFG_NO_PRGM(base, value) (TRNG_RMW_SA_TRNG_SEC_CFG(base, TRNG_SA_TRNG_SEC_CFG_NO_PRGM_MASK, TRNG_SA_TRNG_SEC_CFG_NO_PRGM(value)))
#define TRNG_BWR_SA_TRNG_SEC_CFG_NO_PRGM(base, value) (BME_BFI32(&TRNG_SA_TRNG_SEC_CFG_REG(base), ((uint32_t)(value) << TRNG_SA_TRNG_SEC_CFG_NO_PRGM_SHIFT), TRNG_SA_TRNG_SEC_CFG_NO_PRGM_SHIFT, TRNG_SA_TRNG_SEC_CFG_NO_PRGM_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_SA_TRNG_SEC_CFG, field SK_VAL[2] (RW)
 *
 * Reserved. DRNG-specific, not applicable to this version.
 *
 * Values:
 * - 0b0 - See DRNG version.
 * - 0b1 - See DRNG version.
 */
/*@{*/
/*! @brief Read current value of the TRNG_SA_TRNG_SEC_CFG_SK_VAL field. */
#define TRNG_RD_SA_TRNG_SEC_CFG_SK_VAL(base) ((TRNG_SA_TRNG_SEC_CFG_REG(base) & TRNG_SA_TRNG_SEC_CFG_SK_VAL_MASK) >> TRNG_SA_TRNG_SEC_CFG_SK_VAL_SHIFT)
#define TRNG_BRD_SA_TRNG_SEC_CFG_SK_VAL(base) (BME_UBFX32(&TRNG_SA_TRNG_SEC_CFG_REG(base), TRNG_SA_TRNG_SEC_CFG_SK_VAL_SHIFT, TRNG_SA_TRNG_SEC_CFG_SK_VAL_WIDTH))

/*! @brief Set the SK_VAL field to a new value. */
#define TRNG_WR_SA_TRNG_SEC_CFG_SK_VAL(base, value) (TRNG_RMW_SA_TRNG_SEC_CFG(base, TRNG_SA_TRNG_SEC_CFG_SK_VAL_MASK, TRNG_SA_TRNG_SEC_CFG_SK_VAL(value)))
#define TRNG_BWR_SA_TRNG_SEC_CFG_SK_VAL(base, value) (BME_BFI32(&TRNG_SA_TRNG_SEC_CFG_REG(base), ((uint32_t)(value) << TRNG_SA_TRNG_SEC_CFG_SK_VAL_SHIFT), TRNG_SA_TRNG_SEC_CFG_SK_VAL_SHIFT, TRNG_SA_TRNG_SEC_CFG_SK_VAL_WIDTH))
/*@}*/

/*******************************************************************************
 * TRNG_SA_TRNG_INT_CTRL - RNG Interrupt Control Register
 ******************************************************************************/

/*!
 * @brief TRNG_SA_TRNG_INT_CTRL - RNG Interrupt Control Register (RW)
 *
 * Reset value: 0xFFFFFFFFU
 *
 * The RNG Interrupt Control Register is a read/write register used to control
 * the status for the (currently) three important interrupts that are generated by
 * the TRNG. See true register description above. Each interrupt can be cleared
 * by de-asserting the corresponding bit in the true register. Only a new
 * interrupt will reassert the corresponding bit in the status register. Even if the
 * interrupt is cleared or masked, interrupt status information can be read from the
 * true register.
 */
/*!
 * @name Constants and macros for entire TRNG_SA_TRNG_INT_CTRL register
 */
/*@{*/
#define TRNG_RD_SA_TRNG_INT_CTRL(base) (TRNG_SA_TRNG_INT_CTRL_REG(base))
#define TRNG_WR_SA_TRNG_INT_CTRL(base, value) (TRNG_SA_TRNG_INT_CTRL_REG(base) = (value))
#define TRNG_RMW_SA_TRNG_INT_CTRL(base, mask, value) (TRNG_WR_SA_TRNG_INT_CTRL(base, (TRNG_RD_SA_TRNG_INT_CTRL(base) & ~(mask)) | (value)))
#define TRNG_SET_SA_TRNG_INT_CTRL(base, value) (BME_OR32(&TRNG_SA_TRNG_INT_CTRL_REG(base), (uint32_t)(value)))
#define TRNG_CLR_SA_TRNG_INT_CTRL(base, value) (BME_AND32(&TRNG_SA_TRNG_INT_CTRL_REG(base), (uint32_t)(~(value))))
#define TRNG_TOG_SA_TRNG_INT_CTRL(base, value) (BME_XOR32(&TRNG_SA_TRNG_INT_CTRL_REG(base), (uint32_t)(value)))
/*@}*/

