pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * Constants & macros for individual TRNG_SA_TRNG_INT_CTRL bitfields
 */

/*!
 * @name Register TRNG_SA_TRNG_INT_CTRL, field HW_ERR[0] (RW)
 *
 * Bit position that can be cleared if corresponding bit of true has been
 * asserted.
 *
 * Values:
 * - 0b0 - Corresponding bit of true cleared.
 * - 0b1 - Corresponding bit of true active.
 */
/*@{*/
/*! @brief Read current value of the TRNG_SA_TRNG_INT_CTRL_HW_ERR field. */
#define TRNG_RD_SA_TRNG_INT_CTRL_HW_ERR(base) ((TRNG_SA_TRNG_INT_CTRL_REG(base) & TRNG_SA_TRNG_INT_CTRL_HW_ERR_MASK) >> TRNG_SA_TRNG_INT_CTRL_HW_ERR_SHIFT)
#define TRNG_BRD_SA_TRNG_INT_CTRL_HW_ERR(base) (BME_UBFX32(&TRNG_SA_TRNG_INT_CTRL_REG(base), TRNG_SA_TRNG_INT_CTRL_HW_ERR_SHIFT, TRNG_SA_TRNG_INT_CTRL_HW_ERR_WIDTH))

/*! @brief Set the HW_ERR field to a new value. */
#define TRNG_WR_SA_TRNG_INT_CTRL_HW_ERR(base, value) (TRNG_RMW_SA_TRNG_INT_CTRL(base, TRNG_SA_TRNG_INT_CTRL_HW_ERR_MASK, TRNG_SA_TRNG_INT_CTRL_HW_ERR(value)))
#define TRNG_BWR_SA_TRNG_INT_CTRL_HW_ERR(base, value) (BME_BFI32(&TRNG_SA_TRNG_INT_CTRL_REG(base), ((uint32_t)(value) << TRNG_SA_TRNG_INT_CTRL_HW_ERR_SHIFT), TRNG_SA_TRNG_INT_CTRL_HW_ERR_SHIFT, TRNG_SA_TRNG_INT_CTRL_HW_ERR_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_SA_TRNG_INT_CTRL, field ENT_VAL[1] (RW)
 *
 * Same behavior as bit 0 above.
 *
 * Values:
 * - 0b0 - Same behavior as bit 0 above.
 * - 0b1 - Same behavior as bit 0 above.
 */
/*@{*/
/*! @brief Read current value of the TRNG_SA_TRNG_INT_CTRL_ENT_VAL field. */
#define TRNG_RD_SA_TRNG_INT_CTRL_ENT_VAL(base) ((TRNG_SA_TRNG_INT_CTRL_REG(base) & TRNG_SA_TRNG_INT_CTRL_ENT_VAL_MASK) >> TRNG_SA_TRNG_INT_CTRL_ENT_VAL_SHIFT)
#define TRNG_BRD_SA_TRNG_INT_CTRL_ENT_VAL(base) (BME_UBFX32(&TRNG_SA_TRNG_INT_CTRL_REG(base), TRNG_SA_TRNG_INT_CTRL_ENT_VAL_SHIFT, TRNG_SA_TRNG_INT_CTRL_ENT_VAL_WIDTH))

/*! @brief Set the ENT_VAL field to a new value. */
#define TRNG_WR_SA_TRNG_INT_CTRL_ENT_VAL(base, value) (TRNG_RMW_SA_TRNG_INT_CTRL(base, TRNG_SA_TRNG_INT_CTRL_ENT_VAL_MASK, TRNG_SA_TRNG_INT_CTRL_ENT_VAL(value)))
#define TRNG_BWR_SA_TRNG_INT_CTRL_ENT_VAL(base, value) (BME_BFI32(&TRNG_SA_TRNG_INT_CTRL_REG(base), ((uint32_t)(value) << TRNG_SA_TRNG_INT_CTRL_ENT_VAL_SHIFT), TRNG_SA_TRNG_INT_CTRL_ENT_VAL_SHIFT, TRNG_SA_TRNG_INT_CTRL_ENT_VAL_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_SA_TRNG_INT_CTRL, field FRQ_CT_FAIL[2] (RW)
 *
 * Same behavior as bit 0 above.
 *
 * Values:
 * - 0b0 - Same behavior as bit 0 above.
 * - 0b1 - Same behavior as bit 0 above.
 */
/*@{*/
/*! @brief Read current value of the TRNG_SA_TRNG_INT_CTRL_FRQ_CT_FAIL field. */
#define TRNG_RD_SA_TRNG_INT_CTRL_FRQ_CT_FAIL(base) ((TRNG_SA_TRNG_INT_CTRL_REG(base) & TRNG_SA_TRNG_INT_CTRL_FRQ_CT_FAIL_MASK) >> TRNG_SA_TRNG_INT_CTRL_FRQ_CT_FAIL_SHIFT)
#define TRNG_BRD_SA_TRNG_INT_CTRL_FRQ_CT_FAIL(base) (BME_UBFX32(&TRNG_SA_TRNG_INT_CTRL_REG(base), TRNG_SA_TRNG_INT_CTRL_FRQ_CT_FAIL_SHIFT, TRNG_SA_TRNG_INT_CTRL_FRQ_CT_FAIL_WIDTH))

/*! @brief Set the FRQ_CT_FAIL field to a new value. */
#define TRNG_WR_SA_TRNG_INT_CTRL_FRQ_CT_FAIL(base, value) (TRNG_RMW_SA_TRNG_INT_CTRL(base, TRNG_SA_TRNG_INT_CTRL_FRQ_CT_FAIL_MASK, TRNG_SA_TRNG_INT_CTRL_FRQ_CT_FAIL(value)))
#define TRNG_BWR_SA_TRNG_INT_CTRL_FRQ_CT_FAIL(base, value) (BME_BFI32(&TRNG_SA_TRNG_INT_CTRL_REG(base), ((uint32_t)(value) << TRNG_SA_TRNG_INT_CTRL_FRQ_CT_FAIL_SHIFT), TRNG_SA_TRNG_INT_CTRL_FRQ_CT_FAIL_SHIFT, TRNG_SA_TRNG_INT_CTRL_FRQ_CT_FAIL_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_SA_TRNG_INT_CTRL, field UNUSED[31:3] (RW)
 *
 * Reserved but writeable.
 */
/*@{*/
/*! @brief Read current value of the TRNG_SA_TRNG_INT_CTRL_UNUSED field. */
#define TRNG_RD_SA_TRNG_INT_CTRL_UNUSED(base) ((TRNG_SA_TRNG_INT_CTRL_REG(base) & TRNG_SA_TRNG_INT_CTRL_UNUSED_MASK) >> TRNG_SA_TRNG_INT_CTRL_UNUSED_SHIFT)
#define TRNG_BRD_SA_TRNG_INT_CTRL_UNUSED(base) (TRNG_RD_SA_TRNG_INT_CTRL_UNUSED(base))

/*! @brief Set the UNUSED field to a new value. */
#define TRNG_WR_SA_TRNG_INT_CTRL_UNUSED(base, value) (TRNG_RMW_SA_TRNG_INT_CTRL(base, TRNG_SA_TRNG_INT_CTRL_UNUSED_MASK, TRNG_SA_TRNG_INT_CTRL_UNUSED(value)))
#define TRNG_BWR_SA_TRNG_INT_CTRL_UNUSED(base, value) (TRNG_WR_SA_TRNG_INT_CTRL_UNUSED(base, value))
/*@}*/

/*******************************************************************************
 * TRNG_SA_TRNG_INT_MASK - RNG Mask Register
 ******************************************************************************/

/*!
 * @brief TRNG_SA_TRNG_INT_MASK - RNG Mask Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The RNG Interrupt Mask Register is a read/write register used to disable/mask
 * the status reporting of the (currently) three important interrupts that are
 * generated by the TRNG. See true register description above. Each interrupt can
 * be masked/disabled by de-asserting the corresponding bit in the true register.
 * Only setting this bit high will re-enable the interrupt in the status
 * register. Even if the interrupt is cleared or masked, interrupt status information
 * can be read from the true register.
 */
/*!
 * @name Constants and macros for entire TRNG_SA_TRNG_INT_MASK register
 */
/*@{*/
#define TRNG_RD_SA_TRNG_INT_MASK(base) (TRNG_SA_TRNG_INT_MASK_REG(base))
#define TRNG_WR_SA_TRNG_INT_MASK(base, value) (TRNG_SA_TRNG_INT_MASK_REG(base) = (value))
#define TRNG_RMW_SA_TRNG_INT_MASK(base, mask, value) (TRNG_WR_SA_TRNG_INT_MASK(base, (TRNG_RD_SA_TRNG_INT_MASK(base) & ~(mask)) | (value)))
#define TRNG_SET_SA_TRNG_INT_MASK(base, value) (BME_OR32(&TRNG_SA_TRNG_INT_MASK_REG(base), (uint32_t)(value)))
#define TRNG_CLR_SA_TRNG_INT_MASK(base, value) (BME_AND32(&TRNG_SA_TRNG_INT_MASK_REG(base), (uint32_t)(~(value))))
#define TRNG_TOG_SA_TRNG_INT_MASK(base, value) (BME_XOR32(&TRNG_SA_TRNG_INT_MASK_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual TRNG_SA_TRNG_INT_MASK bitfields
 */

/*!
 * @name Register TRNG_SA_TRNG_INT_MASK, field HW_ERR[0] (RW)
 *
 * Bit position that can be cleared if corresponding bit of true has been
 * asserted.
 *
 * Values:
 * - 0b0 - Corresponding interrupt of true is masked.
 * - 0b1 - Corresponding bit of true is active.
 */
/*@{*/
/*! @brief Read current value of the TRNG_SA_TRNG_INT_MASK_HW_ERR field. */
#define TRNG_RD_SA_TRNG_INT_MASK_HW_ERR(base) ((TRNG_SA_TRNG_INT_MASK_REG(base) & TRNG_SA_TRNG_INT_MASK_HW_ERR_MASK) >> TRNG_SA_TRNG_INT_MASK_HW_ERR_SHIFT)
#define TRNG_BRD_SA_TRNG_INT_MASK_HW_ERR(base) (BME_UBFX32(&TRNG_SA_TRNG_INT_MASK_REG(base), TRNG_SA_TRNG_INT_MASK_HW_ERR_SHIFT, TRNG_SA_TRNG_INT_MASK_HW_ERR_WIDTH))

/*! @brief Set the HW_ERR field to a new value. */
#define TRNG_WR_SA_TRNG_INT_MASK_HW_ERR(base, value) (TRNG_RMW_SA_TRNG_INT_MASK(base, TRNG_SA_TRNG_INT_MASK_HW_ERR_MASK, TRNG_SA_TRNG_INT_MASK_HW_ERR(value)))
#define TRNG_BWR_SA_TRNG_INT_MASK_HW_ERR(base, value) (BME_BFI32(&TRNG_SA_TRNG_INT_MASK_REG(base), ((uint32_t)(value) << TRNG_SA_TRNG_INT_MASK_HW_ERR_SHIFT), TRNG_SA_TRNG_INT_MASK_HW_ERR_SHIFT, TRNG_SA_TRNG_INT_MASK_HW_ERR_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_SA_TRNG_INT_MASK, field ENT_VAL[1] (RW)
 *
 * Same behavior as bit 0 above.
 *
 * Values:
 * - 0b0 - Same behavior as bit 0 above.
 * - 0b1 - Same behavior as bit 0 above.
 */
/*@{*/
/*! @brief Read current value of the TRNG_SA_TRNG_INT_MASK_ENT_VAL field. */
#define TRNG_RD_SA_TRNG_INT_MASK_ENT_VAL(base) ((TRNG_SA_TRNG_INT_MASK_REG(base) & TRNG_SA_TRNG_INT_MASK_ENT_VAL_MASK) >> TRNG_SA_TRNG_INT_MASK_ENT_VAL_SHIFT)
#define TRNG_BRD_SA_TRNG_INT_MASK_ENT_VAL(base) (BME_UBFX32(&TRNG_SA_TRNG_INT_MASK_REG(base), TRNG_SA_TRNG_INT_MASK_ENT_VAL_SHIFT, TRNG_SA_TRNG_INT_MASK_ENT_VAL_WIDTH))

/*! @brief Set the ENT_VAL field to a new value. */
#define TRNG_WR_SA_TRNG_INT_MASK_ENT_VAL(base, value) (TRNG_RMW_SA_TRNG_INT_MASK(base, TRNG_SA_TRNG_INT_MASK_ENT_VAL_MASK, TRNG_SA_TRNG_INT_MASK_ENT_VAL(value)))
#define TRNG_BWR_SA_TRNG_INT_MASK_ENT_VAL(base, value) (BME_BFI32(&TRNG_SA_TRNG_INT_MASK_REG(base), ((uint32_t)(value) << TRNG_SA_TRNG_INT_MASK_ENT_VAL_SHIFT), TRNG_SA_TRNG_INT_MASK_ENT_VAL_SHIFT, TRNG_SA_TRNG_INT_MASK_ENT_VAL_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_SA_TRNG_INT_MASK, field FRQ_CT_FAIL[2] (RW)
 *
 * Same behavior as bit 0 above.
 *
 * Values:
 * - 0b0 - Same behavior as bit 0 above.
 * - 0b1 - Same behavior as bit 0 above.
 */
/*@{*/
/*! @brief Read current value of the TRNG_SA_TRNG_INT_MASK_FRQ_CT_FAIL field. */
#define TRNG_RD_SA_TRNG_INT_MASK_FRQ_CT_FAIL(base) ((TRNG_SA_TRNG_INT_MASK_REG(base) & TRNG_SA_TRNG_INT_MASK_FRQ_CT_FAIL_MASK) >> TRNG_SA_TRNG_INT_MASK_FRQ_CT_FAIL_SHIFT)
#define TRNG_BRD_SA_TRNG_INT_MASK_FRQ_CT_FAIL(base) (BME_UBFX32(&TRNG_SA_TRNG_INT_MASK_REG(base), TRNG_SA_TRNG_INT_MASK_FRQ_CT_FAIL_SHIFT, TRNG_SA_TRNG_INT_MASK_FRQ_CT_FAIL_WIDTH))

/*! @brief Set the FRQ_CT_FAIL field to a new value. */
#define TRNG_WR_SA_TRNG_INT_MASK_FRQ_CT_FAIL(base, value) (TRNG_RMW_SA_TRNG_INT_MASK(base, TRNG_SA_TRNG_INT_MASK_FRQ_CT_FAIL_MASK, TRNG_SA_TRNG_INT_MASK_FRQ_CT_FAIL(value)))
#define TRNG_BWR_SA_TRNG_INT_MASK_FRQ_CT_FAIL(base, value) (BME_BFI32(&TRNG_SA_TRNG_INT_MASK_REG(base), ((uint32_t)(value) << TRNG_SA_TRNG_INT_MASK_FRQ_CT_FAIL_SHIFT), TRNG_SA_TRNG_INT_MASK_FRQ_CT_FAIL_SHIFT, TRNG_SA_TRNG_INT_MASK_FRQ_CT_FAIL_WIDTH))
/*@}*/

