pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * TRNG_SA_TRNG_INT_STATUS - RNG Interrupt Status Register
 ******************************************************************************/

/*!
 * @brief TRNG_SA_TRNG_INT_STATUS - RNG Interrupt Status Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The RNG Interrupt Status Register is a read register used to control and
 * provide status for the (currently) three important interrupts that are generated
 * by the TRNG. The ipi_rng_int_b interrupt signals that RNG has either generated
 * a Frequency Count Fail, Entropy Valid or Error Interrupt. The cause of the
 * interrupt can be decoded by checking the least significant bits of the true
 * register. Each interrupt can be temporarily cleared by de-asserting the
 * corresponding bit in the true register. To mask the interrupts, clear the corresponding
 * bits in the true register. The description of each of the 3 interrupts is
 * defined in the Block Guide under the true register description. Even if the
 * interrupt is cleared or masked, interrupt status information can be read from the
 * true register.
 */
/*!
 * @name Constants and macros for entire TRNG_SA_TRNG_INT_STATUS register
 */
/*@{*/
#define TRNG_RD_SA_TRNG_INT_STATUS(base) (TRNG_SA_TRNG_INT_STATUS_REG(base))
#define TRNG_WR_SA_TRNG_INT_STATUS(base, value) (TRNG_SA_TRNG_INT_STATUS_REG(base) = (value))
#define TRNG_RMW_SA_TRNG_INT_STATUS(base, mask, value) (TRNG_WR_SA_TRNG_INT_STATUS(base, (TRNG_RD_SA_TRNG_INT_STATUS(base) & ~(mask)) | (value)))
#define TRNG_SET_SA_TRNG_INT_STATUS(base, value) (BME_OR32(&TRNG_SA_TRNG_INT_STATUS_REG(base), (uint32_t)(value)))
#define TRNG_CLR_SA_TRNG_INT_STATUS(base, value) (BME_AND32(&TRNG_SA_TRNG_INT_STATUS_REG(base), (uint32_t)(~(value))))
#define TRNG_TOG_SA_TRNG_INT_STATUS(base, value) (BME_XOR32(&TRNG_SA_TRNG_INT_STATUS_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual TRNG_SA_TRNG_INT_STATUS bitfields
 */

/*!
 * @name Register TRNG_SA_TRNG_INT_STATUS, field HW_ERR[0] (RO)
 *
 * Read: Error status. 1 = error detected. 0 = no error. Any HW error in the
 * TRNG will trigger this interrupt.
 *
 * Values:
 * - 0b0 - no error
 * - 0b1 - error detected.
 */
/*@{*/
/*! @brief Read current value of the TRNG_SA_TRNG_INT_STATUS_HW_ERR field. */
#define TRNG_RD_SA_TRNG_INT_STATUS_HW_ERR(base) ((TRNG_SA_TRNG_INT_STATUS_REG(base) & TRNG_SA_TRNG_INT_STATUS_HW_ERR_MASK) >> TRNG_SA_TRNG_INT_STATUS_HW_ERR_SHIFT)
#define TRNG_BRD_SA_TRNG_INT_STATUS_HW_ERR(base) (BME_UBFX32(&TRNG_SA_TRNG_INT_STATUS_REG(base), TRNG_SA_TRNG_INT_STATUS_HW_ERR_SHIFT, TRNG_SA_TRNG_INT_STATUS_HW_ERR_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_SA_TRNG_INT_STATUS, field ENT_VAL[1] (RO)
 *
 * Read only: Entropy Valid. Will assert only if TRNG ACC bit is set, and then
 * after an entropy value is generated. Will be cleared when true15 is read.
 * (true0 through true14 should be read before reading true15).
 *
 * Values:
 * - 0b0 - Busy generation entropy. Any value read is invalid.
 * - 0b1 - TRNG can be stopped and entropy is valid if read.
 */
/*@{*/
/*! @brief Read current value of the TRNG_SA_TRNG_INT_STATUS_ENT_VAL field. */
#define TRNG_RD_SA_TRNG_INT_STATUS_ENT_VAL(base) ((TRNG_SA_TRNG_INT_STATUS_REG(base) & TRNG_SA_TRNG_INT_STATUS_ENT_VAL_MASK) >> TRNG_SA_TRNG_INT_STATUS_ENT_VAL_SHIFT)
#define TRNG_BRD_SA_TRNG_INT_STATUS_ENT_VAL(base) (BME_UBFX32(&TRNG_SA_TRNG_INT_STATUS_REG(base), TRNG_SA_TRNG_INT_STATUS_ENT_VAL_SHIFT, TRNG_SA_TRNG_INT_STATUS_ENT_VAL_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_SA_TRNG_INT_STATUS, field FRQ_CT_FAIL[2] (RW)
 *
 * Read only: Frequency Count Fail. The frequency counter has detected a
 * failure. This may be due to improper programming of the true and/or true registers,
 * or a hardware failure in the ring oscillator.
 *
 * Values:
 * - 0b0 - No hardware nor self test frequency errors.
 * - 0b1 - The frequency counter has detected a failure.
 */
/*@{*/
/*! @brief Read current value of the TRNG_SA_TRNG_INT_STATUS_FRQ_CT_FAIL field. */
#define TRNG_RD_SA_TRNG_INT_STATUS_FRQ_CT_FAIL(base) ((TRNG_SA_TRNG_INT_STATUS_REG(base) & TRNG_SA_TRNG_INT_STATUS_FRQ_CT_FAIL_MASK) >> TRNG_SA_TRNG_INT_STATUS_FRQ_CT_FAIL_SHIFT)
#define TRNG_BRD_SA_TRNG_INT_STATUS_FRQ_CT_FAIL(base) (BME_UBFX32(&TRNG_SA_TRNG_INT_STATUS_REG(base), TRNG_SA_TRNG_INT_STATUS_FRQ_CT_FAIL_SHIFT, TRNG_SA_TRNG_INT_STATUS_FRQ_CT_FAIL_WIDTH))

/*! @brief Set the FRQ_CT_FAIL field to a new value. */
#define TRNG_WR_SA_TRNG_INT_STATUS_FRQ_CT_FAIL(base, value) (TRNG_RMW_SA_TRNG_INT_STATUS(base, TRNG_SA_TRNG_INT_STATUS_FRQ_CT_FAIL_MASK, TRNG_SA_TRNG_INT_STATUS_FRQ_CT_FAIL(value)))
#define TRNG_BWR_SA_TRNG_INT_STATUS_FRQ_CT_FAIL(base, value) (BME_BFI32(&TRNG_SA_TRNG_INT_STATUS_REG(base), ((uint32_t)(value) << TRNG_SA_TRNG_INT_STATUS_FRQ_CT_FAIL_SHIFT), TRNG_SA_TRNG_INT_STATUS_FRQ_CT_FAIL_SHIFT, TRNG_SA_TRNG_INT_STATUS_FRQ_CT_FAIL_WIDTH))
/*@}*/

/*******************************************************************************
 * TRNG_SA_TRNG_VID1 - RNG Version ID Register (MS)
 ******************************************************************************/

/*!
 * @brief TRNG_SA_TRNG_VID1 - RNG Version ID Register (MS) (RO)
 *
 * Reset value: 0x00300100U
 *
 * The RNG Version ID Register is a read only register used to identify the
 * version of the TRNG in use. This register as well as true should both be read to
 * verify the expected version.
 */
/*!
 * @name Constants and macros for entire TRNG_SA_TRNG_VID1 register
 */
/*@{*/
#define TRNG_RD_SA_TRNG_VID1(base) (TRNG_SA_TRNG_VID1_REG(base))
/*@}*/

/*
 * Constants & macros for individual TRNG_SA_TRNG_VID1 bitfields
 */

/*!
 * @name Register TRNG_SA_TRNG_VID1, field RNG_MIN_REV[7:0] (RO)
 *
 * Shows the Freescale IP's Minor revision of the TRNG.
 *
 * Values:
 * - 0b00000000 - Minor revision number for TRNG.
 */
/*@{*/
/*! @brief Read current value of the TRNG_SA_TRNG_VID1_RNG_MIN_REV field. */
#define TRNG_RD_SA_TRNG_VID1_RNG_MIN_REV(base) ((TRNG_SA_TRNG_VID1_REG(base) & TRNG_SA_TRNG_VID1_RNG_MIN_REV_MASK) >> TRNG_SA_TRNG_VID1_RNG_MIN_REV_SHIFT)
#define TRNG_BRD_SA_TRNG_VID1_RNG_MIN_REV(base) (BME_UBFX32(&TRNG_SA_TRNG_VID1_REG(base), TRNG_SA_TRNG_VID1_RNG_MIN_REV_SHIFT, TRNG_SA_TRNG_VID1_RNG_MIN_REV_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_SA_TRNG_VID1, field RNG_MAJ_REV[15:8] (RO)
 *
 * Shows the Freescale IP's Major revision of the TRNG.
 *
 * Values:
 * - 0b00000001 - Major revision number for TRNG.
 */
/*@{*/
/*! @brief Read current value of the TRNG_SA_TRNG_VID1_RNG_MAJ_REV field. */
#define TRNG_RD_SA_TRNG_VID1_RNG_MAJ_REV(base) ((TRNG_SA_TRNG_VID1_REG(base) & TRNG_SA_TRNG_VID1_RNG_MAJ_REV_MASK) >> TRNG_SA_TRNG_VID1_RNG_MAJ_REV_SHIFT)
#define TRNG_BRD_SA_TRNG_VID1_RNG_MAJ_REV(base) (BME_UBFX32(&TRNG_SA_TRNG_VID1_REG(base), TRNG_SA_TRNG_VID1_RNG_MAJ_REV_SHIFT, TRNG_SA_TRNG_VID1_RNG_MAJ_REV_WIDTH))
/*@}*/

/*!
 * @name Register TRNG_SA_TRNG_VID1, field RNG_IP_ID[31:16] (RO)
 *
 * Shows the Freescale IP ID.
 */
/*@{*/
/*! @brief Read current value of the TRNG_SA_TRNG_VID1_RNG_IP_ID field. */
#define TRNG_RD_SA_TRNG_VID1_RNG_IP_ID(base) ((TRNG_SA_TRNG_VID1_REG(base) & TRNG_SA_TRNG_VID1_RNG_IP_ID_MASK) >> TRNG_SA_TRNG_VID1_RNG_IP_ID_SHIFT)
#define TRNG_BRD_SA_TRNG_VID1_RNG_IP_ID(base) (TRNG_RD_SA_TRNG_VID1_RNG_IP_ID(base))
/*@}*/

