pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * MKL28Z7 TSTMR
 *
 * Timestamp Timer
 *
 * Registers defined in this header file:
 * - TSTMR_L - Time Stamp Timer Register Low
 * - TSTMR_H - Time Stamp Timer Register High
 */

#define TSTMR_INSTANCE_COUNT (2U) /*!< Number of instances of the TSTMR module. */
#define TSTMR0_IDX (0U) /*!< Instance number for TSTMR0. */
#define TSTMR1_IDX (1U) /*!< Instance number for TSTMR1. */

/*******************************************************************************
 * TSTMR_L - Time Stamp Timer Register Low
 ******************************************************************************/

/*!
 * @brief TSTMR_L - Time Stamp Timer Register Low (RO)
 *
 * Reset value: 0x00000000U
 *
 * The Time Stamp Timer is a 56-bit clock cycle counter, reset by system reset.
 * It is readable by way of the TSTMRH and TSTMRL registers. Only 32-bit read
 * accesses are allowed. Any other access will generate a transfer error.
 */
/*!
 * @name Constants and macros for entire TSTMR_L register
 */
/*@{*/
#define TSTMR_RD_L(base)         (TSTMR_L_REG(base))
/*@}*/

/*******************************************************************************
 * TSTMR_H - Time Stamp Timer Register High
 ******************************************************************************/

/*!
 * @brief TSTMR_H - Time Stamp Timer Register High (RO)
 *
 * Reset value: 0x00000000U
 *
 * The Time Stamp Timer is a 56-bit clock cycle counter, reset by system reset.
 * It is readable by way of the TSTMR_H and TSTMR_L registers. Only 32-bit read
 * accesses are allowed. Any other access will generate a transfer error.
 */
/*!
 * @name Constants and macros for entire TSTMR_H register
 */
/*@{*/
#define TSTMR_RD_H(base)         (TSTMR_H_REG(base))
/*@}*/

/*
 * Constants & macros for individual TSTMR_H bitfields
 */

/*!
 * @name Register TSTMR_H, field VALUE[23:0] (RO)
 *
 * Upper 24 bits of the 56-bit time stamp value.. The software must read the
 * TSTMR_L first, followed by a read to TSTMR_H to retrieve the complete value. The
 * all-zero reset value may not be readable because the value will increment
 * before it can be read by the software.
 */
/*@{*/
/*! @brief Read current value of the TSTMR_H_VALUE field. */
#define TSTMR_RD_H_VALUE(base) ((TSTMR_H_REG(base) & TSTMR_H_VALUE_MASK) >> TSTMR_H_VALUE_SHIFT)
#define TSTMR_BRD_H_VALUE(base) (TSTMR_RD_H_VALUE(base))
/*@}*/

/*
 * MKL28Z7 USB
 *
 * Universal Serial Bus, OTG Capable Controller
 *
 * Registers defined in this header file:
 * - USB_PERID - Peripheral ID register
 * - USB_IDCOMP - Peripheral ID Complement register
 * - USB_REV - Peripheral Revision register
 * - USB_ADDINFO - Peripheral Additional Info register
 * - USB_OTGISTAT - OTG Interrupt Status register
 * - USB_OTGICR - OTG Interrupt Control register
 * - USB_OTGSTAT - OTG Status register
 * - USB_OTGCTL - OTG Control register
 * - USB_ISTAT - Interrupt Status register
 * - USB_INTEN - Interrupt Enable register
 * - USB_ERRSTAT - Error Interrupt Status register
 * - USB_ERREN - Error Interrupt Enable register
 * - USB_STAT - Status register
 * - USB_CTL - Control register
 * - USB_ADDR - Address register
 * - USB_BDTPAGE1 - BDT Page register 1
 * - USB_FRMNUML - Frame Number register Low
 * - USB_FRMNUMH - Frame Number register High
 * - USB_TOKEN - Token register
 * - USB_SOFTHLD - SOF Threshold register
 * - USB_BDTPAGE2 - BDT Page Register 2
 * - USB_BDTPAGE3 - BDT Page Register 3
 * - USB_ENDPT - Endpoint Control register
 * - USB_USBCTRL - USB Control register
 * - USB_OBSERVE - USB OTG Observe register
 * - USB_CONTROL - USB OTG Control register
 * - USB_USBTRC0 - USB Transceiver Control register 0
 * - USB_USBFRMADJUST - Frame Adjust Register
 * - USB_KEEP_ALIVE_CTRL - Keep Alive mode control
 * - USB_KEEP_ALIVE_WKCTRL - Keep Alive mode wakeup control
 * - USB_MISCCTRL - Miscellaneous Control register
 * - USB_CLK_RECOVER_CTRL - USB Clock recovery control
 * - USB_CLK_RECOVER_IRC_EN - IRC48M oscillator enable register
 * - USB_CLK_RECOVER_INT_EN - Clock recovery combined interrupt enable
 * - USB_CLK_RECOVER_INT_STATUS - Clock recovery separated interrupt status
 */

#define USB_INSTANCE_COUNT (1U) /*!< Number of instances of the USB module. */
#define USB0_IDX (0U) /*!< Instance number for USB0. */

/*******************************************************************************
 * USB_PERID - Peripheral ID register
 ******************************************************************************/

/*!
 * @brief USB_PERID - Peripheral ID register (RO)
 *
 * Reset value: 0x04U
 *
 * Reads back the value of 0x04. This value is defined for the USB peripheral.
 */
/*!
 * @name Constants and macros for entire USB_PERID register
 */
/*@{*/
#define USB_RD_PERID(base)       (USB_PERID_REG(base))
/*@}*/

/*
 * Constants & macros for individual USB_PERID bitfields
 */

/*!
 * @name Register USB_PERID, field ID[5:0] (RO)
 *
 * This field always reads 0x4h.
 */
/*@{*/
/*! @brief Read current value of the USB_PERID_ID field. */
#define USB_RD_PERID_ID(base) ((USB_PERID_REG(base) & USB_PERID_ID_MASK) >> USB_PERID_ID_SHIFT)
#define USB_BRD_PERID_ID(base) (BME_UBFX8(&USB_PERID_REG(base), USB_PERID_ID_SHIFT, USB_PERID_ID_WIDTH))
/*@}*/

/*******************************************************************************
 * USB_IDCOMP - Peripheral ID Complement register
 ******************************************************************************/

/*!
 * @brief USB_IDCOMP - Peripheral ID Complement register (RO)
 *
 * Reset value: 0xFBU
 *
 * Reads back the complement of the Peripheral ID register. For the USB
 * peripheral, the value is 0xFB.
 */
/*!
 * @name Constants and macros for entire USB_IDCOMP register
 */
/*@{*/
#define USB_RD_IDCOMP(base)      (USB_IDCOMP_REG(base))
/*@}*/

/*
 * Constants & macros for individual USB_IDCOMP bitfields
 */

/*!
 * @name Register USB_IDCOMP, field NID[5:0] (RO)
 *
 * Ones' complement of PERID[ID]. bits.
 */
/*@{*/
/*! @brief Read current value of the USB_IDCOMP_NID field. */
#define USB_RD_IDCOMP_NID(base) ((USB_IDCOMP_REG(base) & USB_IDCOMP_NID_MASK) >> USB_IDCOMP_NID_SHIFT)
#define USB_BRD_IDCOMP_NID(base) (BME_UBFX8(&USB_IDCOMP_REG(base), USB_IDCOMP_NID_SHIFT, USB_IDCOMP_NID_WIDTH))
/*@}*/

