pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the WAKE_INT_EN field to a new value. */
#define USB_WR_KEEP_ALIVE_CTRL_WAKE_INT_EN(base, value) (USB_RMW_KEEP_ALIVE_CTRL(base, USB_KEEP_ALIVE_CTRL_WAKE_INT_EN_MASK, USB_KEEP_ALIVE_CTRL_WAKE_INT_EN(value)))
#define USB_BWR_KEEP_ALIVE_CTRL_WAKE_INT_EN(base, value) (BME_BFI8(&USB_KEEP_ALIVE_CTRL_REG(base), ((uint8_t)(value) << USB_KEEP_ALIVE_CTRL_WAKE_INT_EN_SHIFT), USB_KEEP_ALIVE_CTRL_WAKE_INT_EN_SHIFT, USB_KEEP_ALIVE_CTRL_WAKE_INT_EN_WIDTH))
/*@}*/

/*!
 * @name Register USB_KEEP_ALIVE_CTRL, field WAKE_INT_STS[7] (RO)
 *
 * It will be set when KEEP_ALIVE mode is enabled. A SETUP token or software
 * assigned token is received. This interrupt will only be set when the token is
 * processed and USB state is IDLE. Reset to 0. software RW 1 to clear.
 */
/*@{*/
/*! @brief Read current value of the USB_KEEP_ALIVE_CTRL_WAKE_INT_STS field. */
#define USB_RD_KEEP_ALIVE_CTRL_WAKE_INT_STS(base) ((USB_KEEP_ALIVE_CTRL_REG(base) & USB_KEEP_ALIVE_CTRL_WAKE_INT_STS_MASK) >> USB_KEEP_ALIVE_CTRL_WAKE_INT_STS_SHIFT)
#define USB_BRD_KEEP_ALIVE_CTRL_WAKE_INT_STS(base) (BME_UBFX8(&USB_KEEP_ALIVE_CTRL_REG(base), USB_KEEP_ALIVE_CTRL_WAKE_INT_STS_SHIFT, USB_KEEP_ALIVE_CTRL_WAKE_INT_STS_WIDTH))
/*@}*/

/*******************************************************************************
 * USB_KEEP_ALIVE_WKCTRL - Keep Alive mode wakeup control
 ******************************************************************************/

/*!
 * @brief USB_KEEP_ALIVE_WKCTRL - Keep Alive mode wakeup control (RW)
 *
 * Reset value: 0x01U
 */
/*!
 * @name Constants and macros for entire USB_KEEP_ALIVE_WKCTRL register
 */
/*@{*/
#define USB_RD_KEEP_ALIVE_WKCTRL(base) (USB_KEEP_ALIVE_WKCTRL_REG(base))
#define USB_WR_KEEP_ALIVE_WKCTRL(base, value) (USB_KEEP_ALIVE_WKCTRL_REG(base) = (value))
#define USB_RMW_KEEP_ALIVE_WKCTRL(base, mask, value) (USB_WR_KEEP_ALIVE_WKCTRL(base, (USB_RD_KEEP_ALIVE_WKCTRL(base) & ~(mask)) | (value)))
#define USB_SET_KEEP_ALIVE_WKCTRL(base, value) (BME_OR8(&USB_KEEP_ALIVE_WKCTRL_REG(base), (uint8_t)(value)))
#define USB_CLR_KEEP_ALIVE_WKCTRL(base, value) (BME_AND8(&USB_KEEP_ALIVE_WKCTRL_REG(base), (uint8_t)(~(value))))
#define USB_TOG_KEEP_ALIVE_WKCTRL(base, value) (BME_XOR8(&USB_KEEP_ALIVE_WKCTRL_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual USB_KEEP_ALIVE_WKCTRL bitfields
 */

/*!
 * @name Register USB_KEEP_ALIVE_WKCTRL, field WAKE_ON_THIS[3:0] (RW)
 *
 * Software configure it to which token can wakeup usb during KEEP_ALIVE mode.
 * Reset to 4'b0001, software RW.
 *
 * Values:
 * - 0b0001 - Wake up on receiving OUT/SETUP token packet.
 * - 0b1101 - Wake up on receiving SETUP token packet.All other values are
 *     reserved.
 */
/*@{*/
/*! @brief Read current value of the USB_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS field. */
#define USB_RD_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS(base) ((USB_KEEP_ALIVE_WKCTRL_REG(base) & USB_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS_MASK) >> USB_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS_SHIFT)
#define USB_BRD_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS(base) (BME_UBFX8(&USB_KEEP_ALIVE_WKCTRL_REG(base), USB_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS_SHIFT, USB_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS_WIDTH))

/*! @brief Set the WAKE_ON_THIS field to a new value. */
#define USB_WR_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS(base, value) (USB_RMW_KEEP_ALIVE_WKCTRL(base, USB_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS_MASK, USB_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS(value)))
#define USB_BWR_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS(base, value) (BME_BFI8(&USB_KEEP_ALIVE_WKCTRL_REG(base), ((uint8_t)(value) << USB_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS_SHIFT), USB_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS_SHIFT, USB_KEEP_ALIVE_WKCTRL_WAKE_ON_THIS_WIDTH))
/*@}*/

/*!
 * @name Register USB_KEEP_ALIVE_WKCTRL, field WAKE_ENDPT[7:4] (RO)
 *
 * Indicates which endpoint causes the wakeup interrupt. Reset to 0, software
 * read only.
 */
/*@{*/
/*! @brief Read current value of the USB_KEEP_ALIVE_WKCTRL_WAKE_ENDPT field. */
#define USB_RD_KEEP_ALIVE_WKCTRL_WAKE_ENDPT(base) ((USB_KEEP_ALIVE_WKCTRL_REG(base) & USB_KEEP_ALIVE_WKCTRL_WAKE_ENDPT_MASK) >> USB_KEEP_ALIVE_WKCTRL_WAKE_ENDPT_SHIFT)
#define USB_BRD_KEEP_ALIVE_WKCTRL_WAKE_ENDPT(base) (BME_UBFX8(&USB_KEEP_ALIVE_WKCTRL_REG(base), USB_KEEP_ALIVE_WKCTRL_WAKE_ENDPT_SHIFT, USB_KEEP_ALIVE_WKCTRL_WAKE_ENDPT_WIDTH))
/*@}*/

/*******************************************************************************
 * USB_MISCCTRL - Miscellaneous Control register
 ******************************************************************************/

/*!
 * @brief USB_MISCCTRL - Miscellaneous Control register (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire USB_MISCCTRL register
 */
/*@{*/
#define USB_RD_MISCCTRL(base)    (USB_MISCCTRL_REG(base))
#define USB_WR_MISCCTRL(base, value) (USB_MISCCTRL_REG(base) = (value))
#define USB_RMW_MISCCTRL(base, mask, value) (USB_WR_MISCCTRL(base, (USB_RD_MISCCTRL(base) & ~(mask)) | (value)))
#define USB_SET_MISCCTRL(base, value) (BME_OR8(&USB_MISCCTRL_REG(base), (uint8_t)(value)))
#define USB_CLR_MISCCTRL(base, value) (BME_AND8(&USB_MISCCTRL_REG(base), (uint8_t)(~(value))))
#define USB_TOG_MISCCTRL(base, value) (BME_XOR8(&USB_MISCCTRL_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual USB_MISCCTRL bitfields
 */

/*!
 * @name Register USB_MISCCTRL, field SOFDYNTHLD[0] (RW)
 *
 * This field is only valid for Host mode, that is, CTL[HOSTMODEEN]=1.
 *
 * Values:
 * - 0b0 - SOF_TOK interrupt is set when byte times SOF threshold is reached.
 * - 0b1 - SOF_TOK interrupt is set when 8 byte times SOF threshold is reached
 *     or overstepped.
 */
/*@{*/
/*! @brief Read current value of the USB_MISCCTRL_SOFDYNTHLD field. */
#define USB_RD_MISCCTRL_SOFDYNTHLD(base) ((USB_MISCCTRL_REG(base) & USB_MISCCTRL_SOFDYNTHLD_MASK) >> USB_MISCCTRL_SOFDYNTHLD_SHIFT)
#define USB_BRD_MISCCTRL_SOFDYNTHLD(base) (BME_UBFX8(&USB_MISCCTRL_REG(base), USB_MISCCTRL_SOFDYNTHLD_SHIFT, USB_MISCCTRL_SOFDYNTHLD_WIDTH))

/*! @brief Set the SOFDYNTHLD field to a new value. */
#define USB_WR_MISCCTRL_SOFDYNTHLD(base, value) (USB_RMW_MISCCTRL(base, USB_MISCCTRL_SOFDYNTHLD_MASK, USB_MISCCTRL_SOFDYNTHLD(value)))
#define USB_BWR_MISCCTRL_SOFDYNTHLD(base, value) (BME_BFI8(&USB_MISCCTRL_REG(base), ((uint8_t)(value) << USB_MISCCTRL_SOFDYNTHLD_SHIFT), USB_MISCCTRL_SOFDYNTHLD_SHIFT, USB_MISCCTRL_SOFDYNTHLD_WIDTH))
/*@}*/

/*!
 * @name Register USB_MISCCTRL, field SOFBUSSET[1] (RW)
 *
 * This field is only valid for Host mode, that is, CTL[HOSTMODEEN]=1.
 *
 * Values:
 * - 0b0 - SOF_TOK interrupt is set according to SOF threshold value.
 * - 0b1 - SOF_TOK interrupt is set when SOF counter reaches 0.
 */
/*@{*/
/*! @brief Read current value of the USB_MISCCTRL_SOFBUSSET field. */
#define USB_RD_MISCCTRL_SOFBUSSET(base) ((USB_MISCCTRL_REG(base) & USB_MISCCTRL_SOFBUSSET_MASK) >> USB_MISCCTRL_SOFBUSSET_SHIFT)
#define USB_BRD_MISCCTRL_SOFBUSSET(base) (BME_UBFX8(&USB_MISCCTRL_REG(base), USB_MISCCTRL_SOFBUSSET_SHIFT, USB_MISCCTRL_SOFBUSSET_WIDTH))

/*! @brief Set the SOFBUSSET field to a new value. */
#define USB_WR_MISCCTRL_SOFBUSSET(base, value) (USB_RMW_MISCCTRL(base, USB_MISCCTRL_SOFBUSSET_MASK, USB_MISCCTRL_SOFBUSSET(value)))
#define USB_BWR_MISCCTRL_SOFBUSSET(base, value) (BME_BFI8(&USB_MISCCTRL_REG(base), ((uint8_t)(value) << USB_MISCCTRL_SOFBUSSET_SHIFT), USB_MISCCTRL_SOFBUSSET_SHIFT, USB_MISCCTRL_SOFBUSSET_WIDTH))
/*@}*/

/*!
 * @name Register USB_MISCCTRL, field OWNERRISODIS[2] (RW)
 *
 * This field is only valid for Peripheral mode, that is, CTL[HOSTMODEEN]=0.
 *
 * Values:
 * - 0b0 - OWN error detect for ISO IN / ISO OUT is not disabled.
 * - 0b1 - OWN error detect for ISO IN / ISO OUT is disabled.
 */
/*@{*/
/*! @brief Read current value of the USB_MISCCTRL_OWNERRISODIS field. */
#define USB_RD_MISCCTRL_OWNERRISODIS(base) ((USB_MISCCTRL_REG(base) & USB_MISCCTRL_OWNERRISODIS_MASK) >> USB_MISCCTRL_OWNERRISODIS_SHIFT)
#define USB_BRD_MISCCTRL_OWNERRISODIS(base) (BME_UBFX8(&USB_MISCCTRL_REG(base), USB_MISCCTRL_OWNERRISODIS_SHIFT, USB_MISCCTRL_OWNERRISODIS_WIDTH))

/*! @brief Set the OWNERRISODIS field to a new value. */
#define USB_WR_MISCCTRL_OWNERRISODIS(base, value) (USB_RMW_MISCCTRL(base, USB_MISCCTRL_OWNERRISODIS_MASK, USB_MISCCTRL_OWNERRISODIS(value)))
#define USB_BWR_MISCCTRL_OWNERRISODIS(base, value) (BME_BFI8(&USB_MISCCTRL_REG(base), ((uint8_t)(value) << USB_MISCCTRL_OWNERRISODIS_SHIFT), USB_MISCCTRL_OWNERRISODIS_SHIFT, USB_MISCCTRL_OWNERRISODIS_WIDTH))
/*@}*/

/*!
 * @name Register USB_MISCCTRL, field VREDG_EN[3] (RW)
 *
 * Values:
 * - 0b0 - VBUS rising edge interrupt disabled.
 * - 0b1 - VBUS rising edge interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the USB_MISCCTRL_VREDG_EN field. */
#define USB_RD_MISCCTRL_VREDG_EN(base) ((USB_MISCCTRL_REG(base) & USB_MISCCTRL_VREDG_EN_MASK) >> USB_MISCCTRL_VREDG_EN_SHIFT)
#define USB_BRD_MISCCTRL_VREDG_EN(base) (BME_UBFX8(&USB_MISCCTRL_REG(base), USB_MISCCTRL_VREDG_EN_SHIFT, USB_MISCCTRL_VREDG_EN_WIDTH))

/*! @brief Set the VREDG_EN field to a new value. */
#define USB_WR_MISCCTRL_VREDG_EN(base, value) (USB_RMW_MISCCTRL(base, USB_MISCCTRL_VREDG_EN_MASK, USB_MISCCTRL_VREDG_EN(value)))
#define USB_BWR_MISCCTRL_VREDG_EN(base, value) (BME_BFI8(&USB_MISCCTRL_REG(base), ((uint8_t)(value) << USB_MISCCTRL_VREDG_EN_SHIFT), USB_MISCCTRL_VREDG_EN_SHIFT, USB_MISCCTRL_VREDG_EN_WIDTH))
/*@}*/

/*!
 * @name Register USB_MISCCTRL, field VFEDG_EN[4] (RW)
 *
 * Values:
 * - 0b0 - VBUS falling edge interrupt disabled.
 * - 0b1 - VBUS falling edge interrupt enabled.
 */
/*@{*/
/*! @brief Read current value of the USB_MISCCTRL_VFEDG_EN field. */
#define USB_RD_MISCCTRL_VFEDG_EN(base) ((USB_MISCCTRL_REG(base) & USB_MISCCTRL_VFEDG_EN_MASK) >> USB_MISCCTRL_VFEDG_EN_SHIFT)
#define USB_BRD_MISCCTRL_VFEDG_EN(base) (BME_UBFX8(&USB_MISCCTRL_REG(base), USB_MISCCTRL_VFEDG_EN_SHIFT, USB_MISCCTRL_VFEDG_EN_WIDTH))

