pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * VREF_TRM1 - VREF Trim Register 1
 ******************************************************************************/

/*!
 * @brief VREF_TRM1 - VREF Trim Register 1 (RW)
 *
 * Reset value: 0x00U
 *
 * This register contains bits that contain the trim data for the bandgap
 * temperature inflection point.
 */
/*!
 * @name Constants and macros for entire VREF_TRM1 register
 */
/*@{*/
#define VREF_RD_TRM1(base)       (VREF_TRM1_REG(base))
#define VREF_WR_TRM1(base, value) (VREF_TRM1_REG(base) = (value))
#define VREF_RMW_TRM1(base, mask, value) (VREF_WR_TRM1(base, (VREF_RD_TRM1(base) & ~(mask)) | (value)))
#define VREF_SET_TRM1(base, value) (BME_OR8(&VREF_TRM1_REG(base), (uint8_t)(value)))
#define VREF_CLR_TRM1(base, value) (BME_AND8(&VREF_TRM1_REG(base), (uint8_t)(~(value))))
#define VREF_TOG_TRM1(base, value) (BME_XOR8(&VREF_TRM1_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual VREF_TRM1 bitfields
 */

/*!
 * @name Register VREF_TRM1, field BPLSB[3:0] (RW)
 *
 * These are bits for thin trimming bandgap temperature curvature. These bits
 * are active low and will shift the bandgap inflection point ~2 degree C. These
 * are test only bits, with trim value stored in IFR and loaded out of reset.
 */
/*@{*/
/*! @brief Read current value of the VREF_TRM1_BPLSB field. */
#define VREF_RD_TRM1_BPLSB(base) ((VREF_TRM1_REG(base) & VREF_TRM1_BPLSB_MASK) >> VREF_TRM1_BPLSB_SHIFT)
#define VREF_BRD_TRM1_BPLSB(base) (BME_UBFX8(&VREF_TRM1_REG(base), VREF_TRM1_BPLSB_SHIFT, VREF_TRM1_BPLSB_WIDTH))

/*! @brief Set the BPLSB field to a new value. */
#define VREF_WR_TRM1_BPLSB(base, value) (VREF_RMW_TRM1(base, VREF_TRM1_BPLSB_MASK, VREF_TRM1_BPLSB(value)))
#define VREF_BWR_TRM1_BPLSB(base, value) (BME_BFI8(&VREF_TRM1_REG(base), ((uint8_t)(value) << VREF_TRM1_BPLSB_SHIFT), VREF_TRM1_BPLSB_SHIFT, VREF_TRM1_BPLSB_WIDTH))
/*@}*/

/*!
 * @name Register VREF_TRM1, field BPMSB[7:5] (RW)
 *
 * These are bits for thin trimming bandgap temperature curvature. These bits
 * are active low and will shift the bandgap inflection point ~15 degree C/bit.
 * These are test only bits, with trim value stored in IFR and loaded out of reset.
 */
/*@{*/
/*! @brief Read current value of the VREF_TRM1_BPMSB field. */
#define VREF_RD_TRM1_BPMSB(base) ((VREF_TRM1_REG(base) & VREF_TRM1_BPMSB_MASK) >> VREF_TRM1_BPMSB_SHIFT)
#define VREF_BRD_TRM1_BPMSB(base) (BME_UBFX8(&VREF_TRM1_REG(base), VREF_TRM1_BPMSB_SHIFT, VREF_TRM1_BPMSB_WIDTH))

/*! @brief Set the BPMSB field to a new value. */
#define VREF_WR_TRM1_BPMSB(base, value) (VREF_RMW_TRM1(base, VREF_TRM1_BPMSB_MASK, VREF_TRM1_BPMSB(value)))
#define VREF_BWR_TRM1_BPMSB(base, value) (BME_BFI8(&VREF_TRM1_REG(base), ((uint8_t)(value) << VREF_TRM1_BPMSB_SHIFT), VREF_TRM1_BPMSB_SHIFT, VREF_TRM1_BPMSB_WIDTH))
/*@}*/

/*******************************************************************************
 * VREF_TRM2 - VREF Trim Register 2
 ******************************************************************************/

/*!
 * @brief VREF_TRM2 - VREF Trim Register 2 (RW)
 *
 * Reset value: 0x00U
 *
 * This register contains bits that contain the trim data for the buffered
 * Voltage Reference.
 */
/*!
 * @name Constants and macros for entire VREF_TRM2 register
 */
/*@{*/
#define VREF_RD_TRM2(base)       (VREF_TRM2_REG(base))
#define VREF_WR_TRM2(base, value) (VREF_TRM2_REG(base) = (value))
#define VREF_RMW_TRM2(base, mask, value) (VREF_WR_TRM2(base, (VREF_RD_TRM2(base) & ~(mask)) | (value)))
#define VREF_SET_TRM2(base, value) (BME_OR8(&VREF_TRM2_REG(base), (uint8_t)(value)))
#define VREF_CLR_TRM2(base, value) (BME_AND8(&VREF_TRM2_REG(base), (uint8_t)(~(value))))
#define VREF_TOG_TRM2(base, value) (BME_XOR8(&VREF_TRM2_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual VREF_TRM2 bitfields
 */

/*!
 * @name Register VREF_TRM2, field COMPLSB[2:0] (RW)
 *
 * These are bits for trimming the curvature used for the second-order
 * temperature compensation. These are test only bits, with trim value stored in IFR and
 * loaded out of reset.
 */
/*@{*/
/*! @brief Read current value of the VREF_TRM2_COMPLSB field. */
#define VREF_RD_TRM2_COMPLSB(base) ((VREF_TRM2_REG(base) & VREF_TRM2_COMPLSB_MASK) >> VREF_TRM2_COMPLSB_SHIFT)
#define VREF_BRD_TRM2_COMPLSB(base) (BME_UBFX8(&VREF_TRM2_REG(base), VREF_TRM2_COMPLSB_SHIFT, VREF_TRM2_COMPLSB_WIDTH))

/*! @brief Set the COMPLSB field to a new value. */
#define VREF_WR_TRM2_COMPLSB(base, value) (VREF_RMW_TRM2(base, VREF_TRM2_COMPLSB_MASK, VREF_TRM2_COMPLSB(value)))
#define VREF_BWR_TRM2_COMPLSB(base, value) (BME_BFI8(&VREF_TRM2_REG(base), ((uint8_t)(value) << VREF_TRM2_COMPLSB_SHIFT), VREF_TRM2_COMPLSB_SHIFT, VREF_TRM2_COMPLSB_WIDTH))
/*@}*/

/*!
 * @name Register VREF_TRM2, field COMPMSB[7:5] (RW)
 *
 * These are bits for trimming the curvature used for the second-order
 * temperature compensation. These are test only bits, with trim value stored in IFR and
 * loaded out of reset.
 */
/*@{*/
/*! @brief Read current value of the VREF_TRM2_COMPMSB field. */
#define VREF_RD_TRM2_COMPMSB(base) ((VREF_TRM2_REG(base) & VREF_TRM2_COMPMSB_MASK) >> VREF_TRM2_COMPMSB_SHIFT)
#define VREF_BRD_TRM2_COMPMSB(base) (BME_UBFX8(&VREF_TRM2_REG(base), VREF_TRM2_COMPMSB_SHIFT, VREF_TRM2_COMPMSB_WIDTH))

/*! @brief Set the COMPMSB field to a new value. */
#define VREF_WR_TRM2_COMPMSB(base, value) (VREF_RMW_TRM2(base, VREF_TRM2_COMPMSB_MASK, VREF_TRM2_COMPMSB(value)))
#define VREF_BWR_TRM2_COMPMSB(base, value) (BME_BFI8(&VREF_TRM2_REG(base), ((uint8_t)(value) << VREF_TRM2_COMPMSB_SHIFT), VREF_TRM2_COMPMSB_SHIFT, VREF_TRM2_COMPMSB_WIDTH))
/*@}*/

/*******************************************************************************
 * VREF_TRM3 - VREF Trim Register 3
 ******************************************************************************/

/*!
 * @brief VREF_TRM3 - VREF Trim Register 3 (RW)
 *
 * Reset value: 0x00U
 *
 * This register contains bits that contain the trim data for the V to I Voltage
 * Reference.
 */
/*!
 * @name Constants and macros for entire VREF_TRM3 register
 */
/*@{*/
#define VREF_RD_TRM3(base)       (VREF_TRM3_REG(base))
#define VREF_WR_TRM3(base, value) (VREF_TRM3_REG(base) = (value))
#define VREF_RMW_TRM3(base, mask, value) (VREF_WR_TRM3(base, (VREF_RD_TRM3(base) & ~(mask)) | (value)))
#define VREF_SET_TRM3(base, value) (BME_OR8(&VREF_TRM3_REG(base), (uint8_t)(value)))
#define VREF_CLR_TRM3(base, value) (BME_AND8(&VREF_TRM3_REG(base), (uint8_t)(~(value))))
#define VREF_TOG_TRM3(base, value) (BME_XOR8(&VREF_TRM3_REG(base), (uint8_t)(value)))
/*@}*/

