pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * Constants & macros for individual VREF_TRM3 bitfields
 */

/*!
 * @name Register VREF_TRM3, field CHOPOSCTRM[3:0] (RW)
 *
 * These bits trim the chop oscillator clock. The center frequency of the chop
 * oscillator is 72 kHz at the trim value of 4'b1000. The trim step size is 5%
 * time domain when chop oscillator is enabled.
 */
/*@{*/
/*! @brief Read current value of the VREF_TRM3_CHOPOSCTRM field. */
#define VREF_RD_TRM3_CHOPOSCTRM(base) ((VREF_TRM3_REG(base) & VREF_TRM3_CHOPOSCTRM_MASK) >> VREF_TRM3_CHOPOSCTRM_SHIFT)
#define VREF_BRD_TRM3_CHOPOSCTRM(base) (BME_UBFX8(&VREF_TRM3_REG(base), VREF_TRM3_CHOPOSCTRM_SHIFT, VREF_TRM3_CHOPOSCTRM_WIDTH))

/*! @brief Set the CHOPOSCTRM field to a new value. */
#define VREF_WR_TRM3_CHOPOSCTRM(base, value) (VREF_RMW_TRM3(base, VREF_TRM3_CHOPOSCTRM_MASK, VREF_TRM3_CHOPOSCTRM(value)))
#define VREF_BWR_TRM3_CHOPOSCTRM(base, value) (BME_BFI8(&VREF_TRM3_REG(base), ((uint8_t)(value) << VREF_TRM3_CHOPOSCTRM_SHIFT), VREF_TRM3_CHOPOSCTRM_SHIFT, VREF_TRM3_CHOPOSCTRM_WIDTH))
/*@}*/

/*
 * MKL28Z7 WDOG
 *
 * Watchdog timer
 *
 * Registers defined in this header file:
 * - WDOG_CS - Watchdog Control and Status Register
 * - WDOG_CNT - Watchdog Counter Register
 * - WDOG_TOVAL - Watchdog Timeout Value Register
 * - WDOG_WIN - Watchdog Window Register
 */

#define WDOG_INSTANCE_COUNT (1U) /*!< Number of instances of the WDOG module. */
#define WDOG0_IDX (0U) /*!< Instance number for WDOG0. */

/*******************************************************************************
 * WDOG_CS - Watchdog Control and Status Register
 ******************************************************************************/

/*!
 * @brief WDOG_CS - Watchdog Control and Status Register (RW)
 *
 * Reset value: 0x00002180U
 *
 * This section describes the function of Watchdog Control and Status Register.
 * TST is cleared (0:0) on POR only. Any other reset does not affect the value of
 * this field.
 */
/*!
 * @name Constants and macros for entire WDOG_CS register
 */
/*@{*/
#define WDOG_RD_CS(base)         (WDOG_CS_REG(base))
#define WDOG_WR_CS(base, value)  (WDOG_CS_REG(base) = (value))
#define WDOG_RMW_CS(base, mask, value) (WDOG_WR_CS(base, (WDOG_RD_CS(base) & ~(mask)) | (value)))
#define WDOG_SET_CS(base, value) (BME_OR32(&WDOG_CS_REG(base), (uint32_t)(value)))
#define WDOG_CLR_CS(base, value) (BME_AND32(&WDOG_CS_REG(base), (uint32_t)(~(value))))
#define WDOG_TOG_CS(base, value) (BME_XOR32(&WDOG_CS_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual WDOG_CS bitfields
 */

/*!
 * @name Register WDOG_CS, field STOP[0] (RW)
 *
 * This write-once bit enables the watchdog to operate when the chip is in stop
 * mode.
 *
 * Values:
 * - 0b0 - Watchdog disabled in chip stop mode.
 * - 0b1 - Watchdog enabled in chip stop mode.
 */
/*@{*/
/*! @brief Read current value of the WDOG_CS_STOP field. */
#define WDOG_RD_CS_STOP(base) ((WDOG_CS_REG(base) & WDOG_CS_STOP_MASK) >> WDOG_CS_STOP_SHIFT)
#define WDOG_BRD_CS_STOP(base) (BME_UBFX32(&WDOG_CS_REG(base), WDOG_CS_STOP_SHIFT, WDOG_CS_STOP_WIDTH))

/*! @brief Set the STOP field to a new value. */
#define WDOG_WR_CS_STOP(base, value) (WDOG_RMW_CS(base, (WDOG_CS_STOP_MASK | WDOG_CS_FLG_MASK), WDOG_CS_STOP(value)))
#define WDOG_BWR_CS_STOP(base, value) (BME_BFI32(&WDOG_CS_REG(base), ((uint32_t)(value) << WDOG_CS_STOP_SHIFT), WDOG_CS_STOP_SHIFT, WDOG_CS_STOP_WIDTH))
/*@}*/

/*!
 * @name Register WDOG_CS, field WAIT[1] (RW)
 *
 * This write-once bit enables the watchdog to operate when the chip is in wait
 * mode.
 *
 * Values:
 * - 0b0 - Watchdog disabled in chip wait mode.
 * - 0b1 - Watchdog enabled in chip wait mode.
 */
/*@{*/
/*! @brief Read current value of the WDOG_CS_WAIT field. */
#define WDOG_RD_CS_WAIT(base) ((WDOG_CS_REG(base) & WDOG_CS_WAIT_MASK) >> WDOG_CS_WAIT_SHIFT)
#define WDOG_BRD_CS_WAIT(base) (BME_UBFX32(&WDOG_CS_REG(base), WDOG_CS_WAIT_SHIFT, WDOG_CS_WAIT_WIDTH))

/*! @brief Set the WAIT field to a new value. */
#define WDOG_WR_CS_WAIT(base, value) (WDOG_RMW_CS(base, (WDOG_CS_WAIT_MASK | WDOG_CS_FLG_MASK), WDOG_CS_WAIT(value)))
#define WDOG_BWR_CS_WAIT(base, value) (BME_BFI32(&WDOG_CS_REG(base), ((uint32_t)(value) << WDOG_CS_WAIT_SHIFT), WDOG_CS_WAIT_SHIFT, WDOG_CS_WAIT_WIDTH))
/*@}*/

/*!
 * @name Register WDOG_CS, field DBG[2] (RW)
 *
 * This write-once bit enables the watchdog to operate when the chip is in debug
 * mode.
 *
 * Values:
 * - 0b0 - Watchdog disabled in chip debug mode.
 * - 0b1 - Watchdog enabled in chip debug mode.
 */
/*@{*/
/*! @brief Read current value of the WDOG_CS_DBG field. */
#define WDOG_RD_CS_DBG(base) ((WDOG_CS_REG(base) & WDOG_CS_DBG_MASK) >> WDOG_CS_DBG_SHIFT)
#define WDOG_BRD_CS_DBG(base) (BME_UBFX32(&WDOG_CS_REG(base), WDOG_CS_DBG_SHIFT, WDOG_CS_DBG_WIDTH))

/*! @brief Set the DBG field to a new value. */
#define WDOG_WR_CS_DBG(base, value) (WDOG_RMW_CS(base, (WDOG_CS_DBG_MASK | WDOG_CS_FLG_MASK), WDOG_CS_DBG(value)))
#define WDOG_BWR_CS_DBG(base, value) (BME_BFI32(&WDOG_CS_REG(base), ((uint32_t)(value) << WDOG_CS_DBG_SHIFT), WDOG_CS_DBG_SHIFT, WDOG_CS_DBG_WIDTH))
/*@}*/

/*!
 * @name Register WDOG_CS, field TST[4:3] (RW)
 *
 * Enables the fast test mode. The test mode allows software to exercise all
 * bits of the counter to demonstrate that the watchdog is functioning properly. See
 * the Fast testing of the watchdog section. This write-once field is cleared
 * (0:0) on POR only. Any other reset does not affect the value of this field.
 *
 * Values:
 * - 0b00 - Watchdog test mode disabled.
 * - 0b01 - Watchdog user mode enabled. (Watchdog test mode disabled.) After
 *     testing the watchdog, software should use this setting to indicate that the
 *     watchdog is functioning normally in user mode.
 * - 0b10 - Watchdog test mode enabled, only the low byte is used. CNT[CNTLOW]
 *     is compared with TOVAL[TOVALLOW].
 * - 0b11 - Watchdog test mode enabled, only the high byte is used. CNT[CNTHIGH]
 *     is compared with TOVAL[TOVALHIGH].
 */
/*@{*/
/*! @brief Read current value of the WDOG_CS_TST field. */
#define WDOG_RD_CS_TST(base) ((WDOG_CS_REG(base) & WDOG_CS_TST_MASK) >> WDOG_CS_TST_SHIFT)
#define WDOG_BRD_CS_TST(base) (BME_UBFX32(&WDOG_CS_REG(base), WDOG_CS_TST_SHIFT, WDOG_CS_TST_WIDTH))

/*! @brief Set the TST field to a new value. */
#define WDOG_WR_CS_TST(base, value) (WDOG_RMW_CS(base, (WDOG_CS_TST_MASK | WDOG_CS_FLG_MASK), WDOG_CS_TST(value)))
#define WDOG_BWR_CS_TST(base, value) (BME_BFI32(&WDOG_CS_REG(base), ((uint32_t)(value) << WDOG_CS_TST_SHIFT), WDOG_CS_TST_SHIFT, WDOG_CS_TST_WIDTH))
/*@}*/

/*!
 * @name Register WDOG_CS, field UPDATE[5] (RW)
 *
 * This write-once bit allows software to reconfigure the watchdog without a
 * reset.
 *
 * Values:
 * - 0b0 - Updates not allowed. After the initial configuration, the watchdog
 *     cannot be later modified without forcing a reset.
 * - 0b1 - Updates allowed. Software can modify the watchdog configuration
 *     registers within 128 bus clocks after performing the unlock write sequence.
 */
/*@{*/
/*! @brief Read current value of the WDOG_CS_UPDATE field. */
#define WDOG_RD_CS_UPDATE(base) ((WDOG_CS_REG(base) & WDOG_CS_UPDATE_MASK) >> WDOG_CS_UPDATE_SHIFT)
#define WDOG_BRD_CS_UPDATE(base) (BME_UBFX32(&WDOG_CS_REG(base), WDOG_CS_UPDATE_SHIFT, WDOG_CS_UPDATE_WIDTH))

/*! @brief Set the UPDATE field to a new value. */
#define WDOG_WR_CS_UPDATE(base, value) (WDOG_RMW_CS(base, (WDOG_CS_UPDATE_MASK | WDOG_CS_FLG_MASK), WDOG_CS_UPDATE(value)))
#define WDOG_BWR_CS_UPDATE(base, value) (BME_BFI32(&WDOG_CS_REG(base), ((uint32_t)(value) << WDOG_CS_UPDATE_SHIFT), WDOG_CS_UPDATE_SHIFT, WDOG_CS_UPDATE_WIDTH))
/*@}*/

/*!
 * @name Register WDOG_CS, field INT[6] (RW)
 *
 * This write-once bit configures the watchdog to immediately generate an
 * interrupt request upon a reset-triggering event (timeout or illegal write to the
 * watchdog), before forcing a reset. After the interrupt vector fetch (which comes
 * after the reset-triggering event), the reset occurs after a delay of 128 bus
 * clocks.
 *
 * Values:
 * - 0b0 - Watchdog interrupts are disabled. Watchdog resets are not delayed.
 * - 0b1 - Watchdog interrupts are enabled. Watchdog resets are delayed by 128
 *     bus clocks from the interrupt vector fetch.
 */
/*@{*/
/*! @brief Read current value of the WDOG_CS_INT field. */
#define WDOG_RD_CS_INT(base) ((WDOG_CS_REG(base) & WDOG_CS_INT_MASK) >> WDOG_CS_INT_SHIFT)
#define WDOG_BRD_CS_INT(base) (BME_UBFX32(&WDOG_CS_REG(base), WDOG_CS_INT_SHIFT, WDOG_CS_INT_WIDTH))

/*! @brief Set the INT field to a new value. */
#define WDOG_WR_CS_INT(base, value) (WDOG_RMW_CS(base, (WDOG_CS_INT_MASK | WDOG_CS_FLG_MASK), WDOG_CS_INT(value)))
#define WDOG_BWR_CS_INT(base, value) (BME_BFI32(&WDOG_CS_REG(base), ((uint32_t)(value) << WDOG_CS_INT_SHIFT), WDOG_CS_INT_SHIFT, WDOG_CS_INT_WIDTH))
/*@}*/

/*!
 * @name Register WDOG_CS, field EN[7] (RW)
 *
 * This write-once bit enables the watchdog counter to start counting.
 *
 * Values:
 * - 0b0 - Watchdog disabled.
 * - 0b1 - Watchdog enabled.
 */
/*@{*/
/*! @brief Read current value of the WDOG_CS_EN field. */
#define WDOG_RD_CS_EN(base)  ((WDOG_CS_REG(base) & WDOG_CS_EN_MASK) >> WDOG_CS_EN_SHIFT)
#define WDOG_BRD_CS_EN(base) (BME_UBFX32(&WDOG_CS_REG(base), WDOG_CS_EN_SHIFT, WDOG_CS_EN_WIDTH))

/*! @brief Set the EN field to a new value. */
#define WDOG_WR_CS_EN(base, value) (WDOG_RMW_CS(base, (WDOG_CS_EN_MASK | WDOG_CS_FLG_MASK), WDOG_CS_EN(value)))
#define WDOG_BWR_CS_EN(base, value) (BME_BFI32(&WDOG_CS_REG(base), ((uint32_t)(value) << WDOG_CS_EN_SHIFT), WDOG_CS_EN_SHIFT, WDOG_CS_EN_WIDTH))
/*@}*/

/*!
 * @name Register WDOG_CS, field CLK[9:8] (RW)
 *
 * This write-once field indicates the clock source that feeds the watchdog
 * counter. See the Clock source section.
 *
 * Values:
 * - 0b00 - Bus clock.
 * - 0b01 - Internal low-power oscillator (LPOCLK).
 * - 0b10 - 8 MHz internal reference clock.
 * - 0b11 - External clock source.
 */
/*@{*/
/*! @brief Read current value of the WDOG_CS_CLK field. */
#define WDOG_RD_CS_CLK(base) ((WDOG_CS_REG(base) & WDOG_CS_CLK_MASK) >> WDOG_CS_CLK_SHIFT)
#define WDOG_BRD_CS_CLK(base) (BME_UBFX32(&WDOG_CS_REG(base), WDOG_CS_CLK_SHIFT, WDOG_CS_CLK_WIDTH))

/*! @brief Set the CLK field to a new value. */
#define WDOG_WR_CS_CLK(base, value) (WDOG_RMW_CS(base, (WDOG_CS_CLK_MASK | WDOG_CS_FLG_MASK), WDOG_CS_CLK(value)))
#define WDOG_BWR_CS_CLK(base, value) (BME_BFI32(&WDOG_CS_REG(base), ((uint32_t)(value) << WDOG_CS_CLK_SHIFT), WDOG_CS_CLK_SHIFT, WDOG_CS_CLK_WIDTH))
/*@}*/

/*!
 * @name Register WDOG_CS, field PRES[12] (RW)
 *
 * This write-once bit enables a fixed 256 pre-scaling of watchdog counter
 * reference clock. (The block diagram shows this clock divider option.)
 *
 * Values:
 * - 0b0 - 256 prescalar disabled.
 * - 0b1 - 256 prescalar enabled.
 */
/*@{*/
/*! @brief Read current value of the WDOG_CS_PRES field. */
#define WDOG_RD_CS_PRES(base) ((WDOG_CS_REG(base) & WDOG_CS_PRES_MASK) >> WDOG_CS_PRES_SHIFT)
#define WDOG_BRD_CS_PRES(base) (BME_UBFX32(&WDOG_CS_REG(base), WDOG_CS_PRES_SHIFT, WDOG_CS_PRES_WIDTH))

