pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * Constants & macros for individual WDOG_TOVAL bitfields
 */

/*!
 * @name Register WDOG_TOVAL, field TOVALLOW[7:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the WDOG_TOVAL_TOVALLOW field. */
#define WDOG_RD_TOVAL_TOVALLOW(base) ((WDOG_TOVAL_REG(base) & WDOG_TOVAL_TOVALLOW_MASK) >> WDOG_TOVAL_TOVALLOW_SHIFT)
#define WDOG_BRD_TOVAL_TOVALLOW(base) (BME_UBFX32(&WDOG_TOVAL_REG(base), WDOG_TOVAL_TOVALLOW_SHIFT, WDOG_TOVAL_TOVALLOW_WIDTH))

/*! @brief Set the TOVALLOW field to a new value. */
#define WDOG_WR_TOVAL_TOVALLOW(base, value) (WDOG_RMW_TOVAL(base, WDOG_TOVAL_TOVALLOW_MASK, WDOG_TOVAL_TOVALLOW(value)))
#define WDOG_BWR_TOVAL_TOVALLOW(base, value) (BME_BFI32(&WDOG_TOVAL_REG(base), ((uint32_t)(value) << WDOG_TOVAL_TOVALLOW_SHIFT), WDOG_TOVAL_TOVALLOW_SHIFT, WDOG_TOVAL_TOVALLOW_WIDTH))
/*@}*/

/*!
 * @name Register WDOG_TOVAL, field TOVALHIGH[15:8] (RW)
 */
/*@{*/
/*! @brief Read current value of the WDOG_TOVAL_TOVALHIGH field. */
#define WDOG_RD_TOVAL_TOVALHIGH(base) ((WDOG_TOVAL_REG(base) & WDOG_TOVAL_TOVALHIGH_MASK) >> WDOG_TOVAL_TOVALHIGH_SHIFT)
#define WDOG_BRD_TOVAL_TOVALHIGH(base) (BME_UBFX32(&WDOG_TOVAL_REG(base), WDOG_TOVAL_TOVALHIGH_SHIFT, WDOG_TOVAL_TOVALHIGH_WIDTH))

/*! @brief Set the TOVALHIGH field to a new value. */
#define WDOG_WR_TOVAL_TOVALHIGH(base, value) (WDOG_RMW_TOVAL(base, WDOG_TOVAL_TOVALHIGH_MASK, WDOG_TOVAL_TOVALHIGH(value)))
#define WDOG_BWR_TOVAL_TOVALHIGH(base, value) (BME_BFI32(&WDOG_TOVAL_REG(base), ((uint32_t)(value) << WDOG_TOVAL_TOVALHIGH_SHIFT), WDOG_TOVAL_TOVALHIGH_SHIFT, WDOG_TOVAL_TOVALHIGH_WIDTH))
/*@}*/

/*******************************************************************************
 * WDOG_WIN - Watchdog Window Register
 ******************************************************************************/

/*!
 * @brief WDOG_WIN - Watchdog Window Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This section describes the watchdog window register. When window mode is
 * enabled (CS[WIN] is set), The WIN register determines the earliest time that a
 * refresh sequence is considered valid. See the Watchdog refresh mechanism section.
 * The WIN register value must be less than the TOVAL register value.
 */
/*!
 * @name Constants and macros for entire WDOG_WIN register
 */
/*@{*/
#define WDOG_RD_WIN(base)        (WDOG_WIN_REG(base))
#define WDOG_WR_WIN(base, value) (WDOG_WIN_REG(base) = (value))
#define WDOG_RMW_WIN(base, mask, value) (WDOG_WR_WIN(base, (WDOG_RD_WIN(base) & ~(mask)) | (value)))
#define WDOG_SET_WIN(base, value) (BME_OR32(&WDOG_WIN_REG(base), (uint32_t)(value)))
#define WDOG_CLR_WIN(base, value) (BME_AND32(&WDOG_WIN_REG(base), (uint32_t)(~(value))))
#define WDOG_TOG_WIN(base, value) (BME_XOR32(&WDOG_WIN_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual WDOG_WIN bitfields
 */

/*!
 * @name Register WDOG_WIN, field WINLOW[7:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the WDOG_WIN_WINLOW field. */
#define WDOG_RD_WIN_WINLOW(base) ((WDOG_WIN_REG(base) & WDOG_WIN_WINLOW_MASK) >> WDOG_WIN_WINLOW_SHIFT)
#define WDOG_BRD_WIN_WINLOW(base) (BME_UBFX32(&WDOG_WIN_REG(base), WDOG_WIN_WINLOW_SHIFT, WDOG_WIN_WINLOW_WIDTH))

/*! @brief Set the WINLOW field to a new value. */
#define WDOG_WR_WIN_WINLOW(base, value) (WDOG_RMW_WIN(base, WDOG_WIN_WINLOW_MASK, WDOG_WIN_WINLOW(value)))
#define WDOG_BWR_WIN_WINLOW(base, value) (BME_BFI32(&WDOG_WIN_REG(base), ((uint32_t)(value) << WDOG_WIN_WINLOW_SHIFT), WDOG_WIN_WINLOW_SHIFT, WDOG_WIN_WINLOW_WIDTH))
/*@}*/

/*!
 * @name Register WDOG_WIN, field WINHIGH[15:8] (RW)
 */
/*@{*/
/*! @brief Read current value of the WDOG_WIN_WINHIGH field. */
#define WDOG_RD_WIN_WINHIGH(base) ((WDOG_WIN_REG(base) & WDOG_WIN_WINHIGH_MASK) >> WDOG_WIN_WINHIGH_SHIFT)
#define WDOG_BRD_WIN_WINHIGH(base) (BME_UBFX32(&WDOG_WIN_REG(base), WDOG_WIN_WINHIGH_SHIFT, WDOG_WIN_WINHIGH_WIDTH))

/*! @brief Set the WINHIGH field to a new value. */
#define WDOG_WR_WIN_WINHIGH(base, value) (WDOG_RMW_WIN(base, WDOG_WIN_WINHIGH_MASK, WDOG_WIN_WINHIGH(value)))
#define WDOG_BWR_WIN_WINHIGH(base, value) (BME_BFI32(&WDOG_WIN_REG(base), ((uint32_t)(value) << WDOG_WIN_WINHIGH_SHIFT), WDOG_WIN_WINHIGH_SHIFT, WDOG_WIN_WINHIGH_WIDTH))
/*@}*/

/*
 * MKL28Z7 XRDC
 *
 * XRDC
 *
 * Registers defined in this header file:
 * - XRDC_CR - Control Register
 * - XRDC_HWCFG0 - Hardware Configuration Register 0
 * - XRDC_HWCFG1 - Hardware Configuration Register 1
 * - XRDC_HWCFG2 - Hardware Configuration Register 2
 * - XRDC_HWCFG3 - Hardware Configuration Register 3
 * - XRDC_MDACFG - Master Domain Assignment Configuration Register
 * - XRDC_MRCFG - Memory Region Configuration Register
 * - XRDC_DERRLOC - Domain Error Location Register
 * - XRDC_DERR_W - Domain Error Word0 Register
 * - XRDC_PID - Process Identifier
 * - XRDC_MDA_W - Master Domain Assignment W0
 * - XRDC_PDAC_W - Peripheral Domain Access Control W0
 * - XRDC_MRGD_W - Memory Region Descriptor W0
 */

#define XRDC_INSTANCE_COUNT (1U) /*!< Number of instances of the XRDC module. */
#define XRDC_IDX (0U) /*!< Instance number for XRDC. */

/*******************************************************************************
 * XRDC_CR - Control Register
 ******************************************************************************/

/*!
 * @brief XRDC_CR - Control Register (RW)
 *
 * Reset value: 0x0000000AU
 *
 * This register provides read-only status about the XRDC and a global enable
 * bit for the entire module's operation. Access: Secure Privileged Read/write
 */
/*!
 * @name Constants and macros for entire XRDC_CR register
 */
/*@{*/
#define XRDC_RD_CR(base)         (XRDC_CR_REG(base))
#define XRDC_WR_CR(base, value)  (XRDC_CR_REG(base) = (value))
#define XRDC_RMW_CR(base, mask, value) (XRDC_WR_CR(base, (XRDC_RD_CR(base) & ~(mask)) | (value)))
#define XRDC_SET_CR(base, value) (BME_OR32(&XRDC_CR_REG(base), (uint32_t)(value)))
#define XRDC_CLR_CR(base, value) (BME_AND32(&XRDC_CR_REG(base), (uint32_t)(~(value))))
#define XRDC_TOG_CR(base, value) (BME_XOR32(&XRDC_CR_REG(base), (uint32_t)(value)))
/*@}*/

