pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * Constants & macros for individual XRDC_CR bitfields
 */

/*!
 * @name Register XRDC_CR, field GVLD[0] (RW)
 *
 * Global Valid (XRDC global enable/disable).
 *
 * Values:
 * - 0b0 - XRDC is disabled. All accesses from all bus masters to all slaves are
 *     allowed.
 * - 0b1 - XRDC is enabled.
 */
/*@{*/
/*! @brief Read current value of the XRDC_CR_GVLD field. */
#define XRDC_RD_CR_GVLD(base) ((XRDC_CR_REG(base) & XRDC_CR_GVLD_MASK) >> XRDC_CR_GVLD_SHIFT)
#define XRDC_BRD_CR_GVLD(base) (BME_UBFX32(&XRDC_CR_REG(base), XRDC_CR_GVLD_SHIFT, XRDC_CR_GVLD_WIDTH))

/*! @brief Set the GVLD field to a new value. */
#define XRDC_WR_CR_GVLD(base, value) (XRDC_RMW_CR(base, XRDC_CR_GVLD_MASK, XRDC_CR_GVLD(value)))
#define XRDC_BWR_CR_GVLD(base, value) (BME_BFI32(&XRDC_CR_REG(base), ((uint32_t)(value) << XRDC_CR_GVLD_SHIFT), XRDC_CR_GVLD_SHIFT, XRDC_CR_GVLD_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_CR, field HRL[4:1] (RO)
 *
 * Hardware Revision Level. This field specifies the XRDC's hardware and
 * definition revision level. It can be read by software to determine the functional
 * definition of the module. It is hardwired to 5 as it represents an architectural
 * descendent from previous {system} memory protection units ({S}MPU).
 */
/*@{*/
/*! @brief Read current value of the XRDC_CR_HRL field. */
#define XRDC_RD_CR_HRL(base) ((XRDC_CR_REG(base) & XRDC_CR_HRL_MASK) >> XRDC_CR_HRL_SHIFT)
#define XRDC_BRD_CR_HRL(base) (BME_UBFX32(&XRDC_CR_REG(base), XRDC_CR_HRL_SHIFT, XRDC_CR_HRL_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_CR, field MRF[7] (RO)
 *
 * Memory Region Format. This field signals the format of the memory region
 * descriptors and is defined by SoC requirements.
 *
 * Values:
 * - 0b0 - Kinetis format based on ARM Cortex-M processor core definition.
 * - 0b1 - Reserved
 */
/*@{*/
/*! @brief Read current value of the XRDC_CR_MRF field. */
#define XRDC_RD_CR_MRF(base) ((XRDC_CR_REG(base) & XRDC_CR_MRF_MASK) >> XRDC_CR_MRF_SHIFT)
#define XRDC_BRD_CR_MRF(base) (BME_UBFX32(&XRDC_CR_REG(base), XRDC_CR_MRF_SHIFT, XRDC_CR_MRF_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_CR, field VAW[8] (RO)
 *
 * Virtualization aware. This field signals the domain assignments support the
 * optional inclusion of a logical partition identifier (also known as an
 * operating system number).
 *
 * Values:
 * - 0b0 - Implementation is not virtualization aware.
 * - 0b1 - Implementation is virtualization aware.
 */
/*@{*/
/*! @brief Read current value of the XRDC_CR_VAW field. */
#define XRDC_RD_CR_VAW(base) ((XRDC_CR_REG(base) & XRDC_CR_VAW_MASK) >> XRDC_CR_VAW_SHIFT)
#define XRDC_BRD_CR_VAW(base) (BME_UBFX32(&XRDC_CR_REG(base), XRDC_CR_VAW_SHIFT, XRDC_CR_VAW_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_CR, field LK1[30] (RW)
 *
 * 1-bit Lock. This field provides a locking mechanism that can be used to limit
 * the ability to write the register. Once set, this bit remains asserted until
 * the next reset.
 *
 * Values:
 * - 0b0 - Register can be written by any secure privileged write.
 * - 0b1 - Register is locked (read-only) until the next reset.
 */
/*@{*/
/*! @brief Read current value of the XRDC_CR_LK1 field. */
#define XRDC_RD_CR_LK1(base) ((XRDC_CR_REG(base) & XRDC_CR_LK1_MASK) >> XRDC_CR_LK1_SHIFT)
#define XRDC_BRD_CR_LK1(base) (BME_UBFX32(&XRDC_CR_REG(base), XRDC_CR_LK1_SHIFT, XRDC_CR_LK1_WIDTH))

/*! @brief Set the LK1 field to a new value. */
#define XRDC_WR_CR_LK1(base, value) (XRDC_RMW_CR(base, XRDC_CR_LK1_MASK, XRDC_CR_LK1(value)))
#define XRDC_BWR_CR_LK1(base, value) (BME_BFI32(&XRDC_CR_REG(base), ((uint32_t)(value) << XRDC_CR_LK1_SHIFT), XRDC_CR_LK1_SHIFT, XRDC_CR_LK1_WIDTH))
/*@}*/

/*******************************************************************************
 * XRDC_HWCFG0 - Hardware Configuration Register 0
 ******************************************************************************/

/*!
 * @brief XRDC_HWCFG0 - Hardware Configuration Register 0 (RO)
 *
 * Reset value: 0x10000000U
 *
 * This register contains information on the XRDC's hardware configuration.
 * Specifically, it defines the number of implemented domains and bus masters along
 * with the number of instances of memory region controllers (MRCs) and peripheral
 * access controllers (PACs). The register value at reset is device-specific.
 * Attempted writes are error terminated. Access: Secure Privileged Read
 */
/*!
 * @name Constants and macros for entire XRDC_HWCFG0 register
 */
/*@{*/
#define XRDC_RD_HWCFG0(base)     (XRDC_HWCFG0_REG(base))
/*@}*/

/*
 * Constants & macros for individual XRDC_HWCFG0 bitfields
 */

/*!
 * @name Register XRDC_HWCFG0, field NDID[7:0] (RO)
 *
 * Number of domains. This field defines the number of domains minus 1 in the
 * device. Add one to the field value to get the actual number of domains [1-16].
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG0_NDID field. */
#define XRDC_RD_HWCFG0_NDID(base) ((XRDC_HWCFG0_REG(base) & XRDC_HWCFG0_NDID_MASK) >> XRDC_HWCFG0_NDID_SHIFT)
#define XRDC_BRD_HWCFG0_NDID(base) (BME_UBFX32(&XRDC_HWCFG0_REG(base), XRDC_HWCFG0_NDID_SHIFT, XRDC_HWCFG0_NDID_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG0, field NMSTR[15:8] (RO)
 *
 * Number of bus masters. This field defines the number of bus masters minus 1
 * in the device. Add one to the field value to get the actual number of bus
 * masters [1-64].
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG0_NMSTR field. */
#define XRDC_RD_HWCFG0_NMSTR(base) ((XRDC_HWCFG0_REG(base) & XRDC_HWCFG0_NMSTR_MASK) >> XRDC_HWCFG0_NMSTR_SHIFT)
#define XRDC_BRD_HWCFG0_NMSTR(base) (BME_UBFX32(&XRDC_HWCFG0_REG(base), XRDC_HWCFG0_NMSTR_SHIFT, XRDC_HWCFG0_NMSTR_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG0, field NMRC[23:16] (RO)
 *
 * Number of memory region controllers. This field defines the number of MRCs
 * minus 1 in the device. Add one to the field value to get the actual number of
 * memory region controllers [1-16].
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG0_NMRC field. */
#define XRDC_RD_HWCFG0_NMRC(base) ((XRDC_HWCFG0_REG(base) & XRDC_HWCFG0_NMRC_MASK) >> XRDC_HWCFG0_NMRC_SHIFT)
#define XRDC_BRD_HWCFG0_NMRC(base) (BME_UBFX32(&XRDC_HWCFG0_REG(base), XRDC_HWCFG0_NMRC_SHIFT, XRDC_HWCFG0_NMRC_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG0, field NPAC[27:24] (RO)
 *
 * Number of peripheral access controllers. This field defines the number of
 * PACs minus 1 in the device. Add one to the field value to get the actual number
 * of peripheral access controllers [1-4].
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG0_NPAC field. */
#define XRDC_RD_HWCFG0_NPAC(base) ((XRDC_HWCFG0_REG(base) & XRDC_HWCFG0_NPAC_MASK) >> XRDC_HWCFG0_NPAC_SHIFT)
#define XRDC_BRD_HWCFG0_NPAC(base) (BME_UBFX32(&XRDC_HWCFG0_REG(base), XRDC_HWCFG0_NPAC_SHIFT, XRDC_HWCFG0_NPAC_WIDTH))
/*@}*/

