pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * XRDC_HWCFG1 - Hardware Configuration Register 1
 ******************************************************************************/

/*!
 * @brief XRDC_HWCFG1 - Hardware Configuration Register 1 (RO)
 *
 * Reset value: 0x00000000U
 *
 * This register contains information on the XRDC's hardware configuration. It
 * provides a mechanism for software to determine its domain number by simply
 * reading the register. See Domain error capture management for more details on
 * typical usage. Attempted writes are error terminated. Access: Secure Privileged
 * Read
 */
/*!
 * @name Constants and macros for entire XRDC_HWCFG1 register
 */
/*@{*/
#define XRDC_RD_HWCFG1(base)     (XRDC_HWCFG1_REG(base))
/*@}*/

/*
 * Constants & macros for individual XRDC_HWCFG1 bitfields
 */

/*!
 * @name Register XRDC_HWCFG1, field DID[3:0] (RO)
 *
 * Domain identifier number. This field provides the domain number [0-15] of the
 * requesting bus master.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG1_DID field. */
#define XRDC_RD_HWCFG1_DID(base) ((XRDC_HWCFG1_REG(base) & XRDC_HWCFG1_DID_MASK) >> XRDC_HWCFG1_DID_SHIFT)
#define XRDC_BRD_HWCFG1_DID(base) (BME_UBFX32(&XRDC_HWCFG1_REG(base), XRDC_HWCFG1_DID_SHIFT, XRDC_HWCFG1_DID_WIDTH))
/*@}*/

/*******************************************************************************
 * XRDC_HWCFG2 - Hardware Configuration Register 2
 ******************************************************************************/

/*!
 * @brief XRDC_HWCFG2 - Hardware Configuration Register 2 (RO)
 *
 * Reset value: 0x00000000U
 *
 * This register contains information on the XRDC's hardware configuration. It
 * provides a bitmap signaling the presence of a process identifier (PID) register
 * sourced from the given bus master. The HWCFG2 register is associated with bus
 * masters [31-0], while the HWCFG3 register covers bus masters [63-32].
 * Attempted writes are error terminated. Access: Secure Privileged Read
 */
/*!
 * @name Constants and macros for entire XRDC_HWCFG2 register
 */
/*@{*/
#define XRDC_RD_HWCFG2(base)     (XRDC_HWCFG2_REG(base))
/*@}*/

/*
 * Constants & macros for individual XRDC_HWCFG2 bitfields
 */

/*!
 * @name Register XRDC_HWCFG2, field PIDP0[0] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP0 field. */
#define XRDC_RD_HWCFG2_PIDP0(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP0_MASK) >> XRDC_HWCFG2_PIDP0_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP0(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP0_SHIFT, XRDC_HWCFG2_PIDP0_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP1[1] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP1 field. */
#define XRDC_RD_HWCFG2_PIDP1(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP1_MASK) >> XRDC_HWCFG2_PIDP1_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP1(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP1_SHIFT, XRDC_HWCFG2_PIDP1_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP2[2] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP2 field. */
#define XRDC_RD_HWCFG2_PIDP2(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP2_MASK) >> XRDC_HWCFG2_PIDP2_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP2(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP2_SHIFT, XRDC_HWCFG2_PIDP2_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP3[3] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP3 field. */
#define XRDC_RD_HWCFG2_PIDP3(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP3_MASK) >> XRDC_HWCFG2_PIDP3_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP3(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP3_SHIFT, XRDC_HWCFG2_PIDP3_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP4[4] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP4 field. */
#define XRDC_RD_HWCFG2_PIDP4(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP4_MASK) >> XRDC_HWCFG2_PIDP4_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP4(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP4_SHIFT, XRDC_HWCFG2_PIDP4_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP5[5] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP5 field. */
#define XRDC_RD_HWCFG2_PIDP5(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP5_MASK) >> XRDC_HWCFG2_PIDP5_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP5(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP5_SHIFT, XRDC_HWCFG2_PIDP5_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP6[6] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP6 field. */
#define XRDC_RD_HWCFG2_PIDP6(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP6_MASK) >> XRDC_HWCFG2_PIDP6_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP6(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP6_SHIFT, XRDC_HWCFG2_PIDP6_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP7[7] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP7 field. */
#define XRDC_RD_HWCFG2_PIDP7(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP7_MASK) >> XRDC_HWCFG2_PIDP7_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP7(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP7_SHIFT, XRDC_HWCFG2_PIDP7_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP8[8] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP8 field. */
#define XRDC_RD_HWCFG2_PIDP8(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP8_MASK) >> XRDC_HWCFG2_PIDP8_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP8(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP8_SHIFT, XRDC_HWCFG2_PIDP8_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP9[9] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP9 field. */
#define XRDC_RD_HWCFG2_PIDP9(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP9_MASK) >> XRDC_HWCFG2_PIDP9_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP9(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP9_SHIFT, XRDC_HWCFG2_PIDP9_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP10[10] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP10 field. */
#define XRDC_RD_HWCFG2_PIDP10(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP10_MASK) >> XRDC_HWCFG2_PIDP10_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP10(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP10_SHIFT, XRDC_HWCFG2_PIDP10_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP11[11] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP11 field. */
#define XRDC_RD_HWCFG2_PIDP11(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP11_MASK) >> XRDC_HWCFG2_PIDP11_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP11(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP11_SHIFT, XRDC_HWCFG2_PIDP11_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP12[12] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP12 field. */
#define XRDC_RD_HWCFG2_PIDP12(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP12_MASK) >> XRDC_HWCFG2_PIDP12_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP12(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP12_SHIFT, XRDC_HWCFG2_PIDP12_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP13[13] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP13 field. */
#define XRDC_RD_HWCFG2_PIDP13(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP13_MASK) >> XRDC_HWCFG2_PIDP13_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP13(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP13_SHIFT, XRDC_HWCFG2_PIDP13_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP14[14] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP14 field. */
#define XRDC_RD_HWCFG2_PIDP14(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP14_MASK) >> XRDC_HWCFG2_PIDP14_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP14(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP14_SHIFT, XRDC_HWCFG2_PIDP14_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP15[15] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP15 field. */
#define XRDC_RD_HWCFG2_PIDP15(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP15_MASK) >> XRDC_HWCFG2_PIDP15_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP15(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP15_SHIFT, XRDC_HWCFG2_PIDP15_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP16[16] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP16 field. */
#define XRDC_RD_HWCFG2_PIDP16(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP16_MASK) >> XRDC_HWCFG2_PIDP16_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP16(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP16_SHIFT, XRDC_HWCFG2_PIDP16_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP17[17] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP17 field. */
#define XRDC_RD_HWCFG2_PIDP17(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP17_MASK) >> XRDC_HWCFG2_PIDP17_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP17(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP17_SHIFT, XRDC_HWCFG2_PIDP17_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP18[18] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP18 field. */
#define XRDC_RD_HWCFG2_PIDP18(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP18_MASK) >> XRDC_HWCFG2_PIDP18_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP18(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP18_SHIFT, XRDC_HWCFG2_PIDP18_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP19[19] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP19 field. */
#define XRDC_RD_HWCFG2_PIDP19(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP19_MASK) >> XRDC_HWCFG2_PIDP19_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP19(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP19_SHIFT, XRDC_HWCFG2_PIDP19_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP20[20] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP20 field. */
#define XRDC_RD_HWCFG2_PIDP20(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP20_MASK) >> XRDC_HWCFG2_PIDP20_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP20(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP20_SHIFT, XRDC_HWCFG2_PIDP20_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP21[21] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP21 field. */
#define XRDC_RD_HWCFG2_PIDP21(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP21_MASK) >> XRDC_HWCFG2_PIDP21_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP21(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP21_SHIFT, XRDC_HWCFG2_PIDP21_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP22[22] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP22 field. */
#define XRDC_RD_HWCFG2_PIDP22(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP22_MASK) >> XRDC_HWCFG2_PIDP22_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP22(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP22_SHIFT, XRDC_HWCFG2_PIDP22_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP23[23] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP23 field. */
#define XRDC_RD_HWCFG2_PIDP23(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP23_MASK) >> XRDC_HWCFG2_PIDP23_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP23(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP23_SHIFT, XRDC_HWCFG2_PIDP23_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP24[24] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP24 field. */
#define XRDC_RD_HWCFG2_PIDP24(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP24_MASK) >> XRDC_HWCFG2_PIDP24_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP24(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP24_SHIFT, XRDC_HWCFG2_PIDP24_WIDTH))
/*@}*/

