pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*!
 * @name Register XRDC_HWCFG2, field PIDP25[25] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP25 field. */
#define XRDC_RD_HWCFG2_PIDP25(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP25_MASK) >> XRDC_HWCFG2_PIDP25_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP25(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP25_SHIFT, XRDC_HWCFG2_PIDP25_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP26[26] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP26 field. */
#define XRDC_RD_HWCFG2_PIDP26(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP26_MASK) >> XRDC_HWCFG2_PIDP26_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP26(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP26_SHIFT, XRDC_HWCFG2_PIDP26_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP27[27] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP27 field. */
#define XRDC_RD_HWCFG2_PIDP27(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP27_MASK) >> XRDC_HWCFG2_PIDP27_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP27(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP27_SHIFT, XRDC_HWCFG2_PIDP27_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP28[28] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP28 field. */
#define XRDC_RD_HWCFG2_PIDP28(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP28_MASK) >> XRDC_HWCFG2_PIDP28_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP28(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP28_SHIFT, XRDC_HWCFG2_PIDP28_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP29[29] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP29 field. */
#define XRDC_RD_HWCFG2_PIDP29(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP29_MASK) >> XRDC_HWCFG2_PIDP29_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP29(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP29_SHIFT, XRDC_HWCFG2_PIDP29_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP30[30] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP30 field. */
#define XRDC_RD_HWCFG2_PIDP30(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP30_MASK) >> XRDC_HWCFG2_PIDP30_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP30(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP30_SHIFT, XRDC_HWCFG2_PIDP30_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG2, field PIDP31[31] (RO)
 *
 * Process identifier present from bus master n, where n = [31-0]. This field
 * provides a bitmap to signal that bus master n (where n matches the bit number)
 * sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG2_PIDP31 field. */
#define XRDC_RD_HWCFG2_PIDP31(base) ((XRDC_HWCFG2_REG(base) & XRDC_HWCFG2_PIDP31_MASK) >> XRDC_HWCFG2_PIDP31_SHIFT)
#define XRDC_BRD_HWCFG2_PIDP31(base) (BME_UBFX32(&XRDC_HWCFG2_REG(base), XRDC_HWCFG2_PIDP31_SHIFT, XRDC_HWCFG2_PIDP31_WIDTH))
/*@}*/

