pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * XRDC_HWCFG3 - Hardware Configuration Register 3
 ******************************************************************************/

/*!
 * @brief XRDC_HWCFG3 - Hardware Configuration Register 3 (RO)
 *
 * Reset value: 0x00000000U
 *
 * This register contains information on the XRDC's hardware configuration.
 * Specifically, it provides a bitmap signaling the presence of a process identifier
 * (PID) register sourced from the given bus master. The HWCFG3 register is
 * associated with bus masters [63-32], while the HWCFG2 register covers bus masters
 * [31-0]. Attempted writes are error terminated. Access: Secure Privileged Read
 */
/*!
 * @name Constants and macros for entire XRDC_HWCFG3 register
 */
/*@{*/
#define XRDC_RD_HWCFG3(base)     (XRDC_HWCFG3_REG(base))
/*@}*/

/*
 * Constants & macros for individual XRDC_HWCFG3 bitfields
 */

/*!
 * @name Register XRDC_HWCFG3, field PIDP32[0] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP32 field. */
#define XRDC_RD_HWCFG3_PIDP32(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP32_MASK) >> XRDC_HWCFG3_PIDP32_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP32(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP32_SHIFT, XRDC_HWCFG3_PIDP32_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP33[1] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP33 field. */
#define XRDC_RD_HWCFG3_PIDP33(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP33_MASK) >> XRDC_HWCFG3_PIDP33_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP33(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP33_SHIFT, XRDC_HWCFG3_PIDP33_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP34[2] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP34 field. */
#define XRDC_RD_HWCFG3_PIDP34(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP34_MASK) >> XRDC_HWCFG3_PIDP34_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP34(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP34_SHIFT, XRDC_HWCFG3_PIDP34_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP35[3] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP35 field. */
#define XRDC_RD_HWCFG3_PIDP35(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP35_MASK) >> XRDC_HWCFG3_PIDP35_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP35(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP35_SHIFT, XRDC_HWCFG3_PIDP35_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP36[4] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP36 field. */
#define XRDC_RD_HWCFG3_PIDP36(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP36_MASK) >> XRDC_HWCFG3_PIDP36_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP36(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP36_SHIFT, XRDC_HWCFG3_PIDP36_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP37[5] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP37 field. */
#define XRDC_RD_HWCFG3_PIDP37(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP37_MASK) >> XRDC_HWCFG3_PIDP37_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP37(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP37_SHIFT, XRDC_HWCFG3_PIDP37_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP38[6] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP38 field. */
#define XRDC_RD_HWCFG3_PIDP38(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP38_MASK) >> XRDC_HWCFG3_PIDP38_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP38(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP38_SHIFT, XRDC_HWCFG3_PIDP38_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP39[7] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP39 field. */
#define XRDC_RD_HWCFG3_PIDP39(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP39_MASK) >> XRDC_HWCFG3_PIDP39_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP39(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP39_SHIFT, XRDC_HWCFG3_PIDP39_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP40[8] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP40 field. */
#define XRDC_RD_HWCFG3_PIDP40(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP40_MASK) >> XRDC_HWCFG3_PIDP40_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP40(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP40_SHIFT, XRDC_HWCFG3_PIDP40_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP41[9] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP41 field. */
#define XRDC_RD_HWCFG3_PIDP41(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP41_MASK) >> XRDC_HWCFG3_PIDP41_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP41(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP41_SHIFT, XRDC_HWCFG3_PIDP41_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP42[10] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP42 field. */
#define XRDC_RD_HWCFG3_PIDP42(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP42_MASK) >> XRDC_HWCFG3_PIDP42_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP42(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP42_SHIFT, XRDC_HWCFG3_PIDP42_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP43[11] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP43 field. */
#define XRDC_RD_HWCFG3_PIDP43(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP43_MASK) >> XRDC_HWCFG3_PIDP43_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP43(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP43_SHIFT, XRDC_HWCFG3_PIDP43_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP44[12] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP44 field. */
#define XRDC_RD_HWCFG3_PIDP44(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP44_MASK) >> XRDC_HWCFG3_PIDP44_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP44(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP44_SHIFT, XRDC_HWCFG3_PIDP44_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP45[13] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP45 field. */
#define XRDC_RD_HWCFG3_PIDP45(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP45_MASK) >> XRDC_HWCFG3_PIDP45_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP45(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP45_SHIFT, XRDC_HWCFG3_PIDP45_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP46[14] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP46 field. */
#define XRDC_RD_HWCFG3_PIDP46(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP46_MASK) >> XRDC_HWCFG3_PIDP46_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP46(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP46_SHIFT, XRDC_HWCFG3_PIDP46_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP47[15] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP47 field. */
#define XRDC_RD_HWCFG3_PIDP47(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP47_MASK) >> XRDC_HWCFG3_PIDP47_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP47(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP47_SHIFT, XRDC_HWCFG3_PIDP47_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP48[16] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP48 field. */
#define XRDC_RD_HWCFG3_PIDP48(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP48_MASK) >> XRDC_HWCFG3_PIDP48_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP48(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP48_SHIFT, XRDC_HWCFG3_PIDP48_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP49[17] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP49 field. */
#define XRDC_RD_HWCFG3_PIDP49(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP49_MASK) >> XRDC_HWCFG3_PIDP49_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP49(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP49_SHIFT, XRDC_HWCFG3_PIDP49_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP50[18] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP50 field. */
#define XRDC_RD_HWCFG3_PIDP50(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP50_MASK) >> XRDC_HWCFG3_PIDP50_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP50(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP50_SHIFT, XRDC_HWCFG3_PIDP50_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP51[19] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP51 field. */
#define XRDC_RD_HWCFG3_PIDP51(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP51_MASK) >> XRDC_HWCFG3_PIDP51_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP51(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP51_SHIFT, XRDC_HWCFG3_PIDP51_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP52[20] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP52 field. */
#define XRDC_RD_HWCFG3_PIDP52(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP52_MASK) >> XRDC_HWCFG3_PIDP52_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP52(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP52_SHIFT, XRDC_HWCFG3_PIDP52_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP53[21] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP53 field. */
#define XRDC_RD_HWCFG3_PIDP53(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP53_MASK) >> XRDC_HWCFG3_PIDP53_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP53(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP53_SHIFT, XRDC_HWCFG3_PIDP53_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP54[22] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP54 field. */
#define XRDC_RD_HWCFG3_PIDP54(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP54_MASK) >> XRDC_HWCFG3_PIDP54_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP54(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP54_SHIFT, XRDC_HWCFG3_PIDP54_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP55[23] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP55 field. */
#define XRDC_RD_HWCFG3_PIDP55(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP55_MASK) >> XRDC_HWCFG3_PIDP55_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP55(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP55_SHIFT, XRDC_HWCFG3_PIDP55_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP56[24] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP56 field. */
#define XRDC_RD_HWCFG3_PIDP56(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP56_MASK) >> XRDC_HWCFG3_PIDP56_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP56(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP56_SHIFT, XRDC_HWCFG3_PIDP56_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP57[25] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP57 field. */
#define XRDC_RD_HWCFG3_PIDP57(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP57_MASK) >> XRDC_HWCFG3_PIDP57_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP57(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP57_SHIFT, XRDC_HWCFG3_PIDP57_WIDTH))
/*@}*/

