pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*!
 * @name Register XRDC_HWCFG3, field PIDP58[26] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP58 field. */
#define XRDC_RD_HWCFG3_PIDP58(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP58_MASK) >> XRDC_HWCFG3_PIDP58_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP58(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP58_SHIFT, XRDC_HWCFG3_PIDP58_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP59[27] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP59 field. */
#define XRDC_RD_HWCFG3_PIDP59(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP59_MASK) >> XRDC_HWCFG3_PIDP59_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP59(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP59_SHIFT, XRDC_HWCFG3_PIDP59_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP60[28] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP60 field. */
#define XRDC_RD_HWCFG3_PIDP60(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP60_MASK) >> XRDC_HWCFG3_PIDP60_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP60(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP60_SHIFT, XRDC_HWCFG3_PIDP60_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP61[29] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP61 field. */
#define XRDC_RD_HWCFG3_PIDP61(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP61_MASK) >> XRDC_HWCFG3_PIDP61_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP61(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP61_SHIFT, XRDC_HWCFG3_PIDP61_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP62[30] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP62 field. */
#define XRDC_RD_HWCFG3_PIDP62(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP62_MASK) >> XRDC_HWCFG3_PIDP62_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP62(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP62_SHIFT, XRDC_HWCFG3_PIDP62_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_HWCFG3, field PIDP63[31] (RO)
 *
 * Process identifier present from bus master n, where n = [63-32]. This field
 * provides a bitmap to signal that bus master n (where n is defined as 32 + bit
 * number) sources a process identifier register to the XRDC_MDAC logic.
 *
 * Values:
 * - 0b0 - Bus master "n" does not source a process identifier register. The
 *     XRDC_MDAC logic provides the needed PID for processor cores.
 * - 0b1 - Bus master "n" sources a process identifier register to the XRDC_MDAC
 *     logic.
 */
/*@{*/
/*! @brief Read current value of the XRDC_HWCFG3_PIDP63 field. */
#define XRDC_RD_HWCFG3_PIDP63(base) ((XRDC_HWCFG3_REG(base) & XRDC_HWCFG3_PIDP63_MASK) >> XRDC_HWCFG3_PIDP63_SHIFT)
#define XRDC_BRD_HWCFG3_PIDP63(base) (BME_UBFX32(&XRDC_HWCFG3_REG(base), XRDC_HWCFG3_PIDP63_SHIFT, XRDC_HWCFG3_PIDP63_WIDTH))
/*@}*/

/*******************************************************************************
 * XRDC_MDACFG - Master Domain Assignment Configuration Register
 ******************************************************************************/

/*!
 * @brief XRDC_MDACFG - Master Domain Assignment Configuration Register (RO)
 *
 * Reset value: 0x00U
 *
 * This register defines the number of implemented domain assignment registers
 * [1-8] for bus master n, where n+1 can specify from 1 to 64 bus masters. These
 * registers are organized as a byte-sized data array and can be read using 8-,
 * 16- or 32-bit accesses. An all-zero value (NCM = 0, NMDAR = 0) indicates a
 * non-existent bus master. Attempted writes are error terminated. Typically,
 * processor bus masters have one or more domain assignment registers, while
 * non-processor masters have a single domain assignment register. Access: Secure Privileged
 * Read
 */
/*!
 * @name Constants and macros for entire XRDC_MDACFG register
 */
/*@{*/
#define XRDC_RD_MDACFG(base, index) (XRDC_MDACFG_REG(base, index))
/*@}*/

