pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * Constants & macros for individual XRDC_MDACFG bitfields
 */

/*!
 * @name Register XRDC_MDACFG, field NMDAR[3:0] (RO)
 *
 * Number of master domain assignment registers for bus master n. This field
 * specifies the number of registers associated with the master domain assignment
 * register for a given bus master. The value is limited to the range [0-8], where
 * zero indicates a non-existent bus master and non-zero values indicate the
 * number of implemented registers associated with this MDAn.
 */
/*@{*/
/*! @brief Read current value of the XRDC_MDACFG_NMDAR field. */
#define XRDC_RD_MDACFG_NMDAR(base, index) ((XRDC_MDACFG_REG(base, index) & XRDC_MDACFG_NMDAR_MASK) >> XRDC_MDACFG_NMDAR_SHIFT)
#define XRDC_BRD_MDACFG_NMDAR(base, index) (BME_UBFX8(&XRDC_MDACFG_REG(base, index), XRDC_MDACFG_NMDAR_SHIFT, XRDC_MDACFG_NMDAR_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_MDACFG, field NCM[7] (RO)
 *
 * Non-CPU Master. This field signals that bus master n is a non-CPU master. It
 * specifies that the format of the associated MDA_Wm_n register defines a
 * non-processor domain assignment. This field is zero for a non-existent bus master.
 *
 * Values:
 * - 0b0 - Bus master is a processor.
 * - 0b1 - Bus master is a non-processor.
 */
/*@{*/
/*! @brief Read current value of the XRDC_MDACFG_NCM field. */
#define XRDC_RD_MDACFG_NCM(base, index) ((XRDC_MDACFG_REG(base, index) & XRDC_MDACFG_NCM_MASK) >> XRDC_MDACFG_NCM_SHIFT)
#define XRDC_BRD_MDACFG_NCM(base, index) (BME_UBFX8(&XRDC_MDACFG_REG(base, index), XRDC_MDACFG_NCM_SHIFT, XRDC_MDACFG_NCM_WIDTH))
/*@}*/

/*******************************************************************************
 * XRDC_MRCFG - Memory Region Configuration Register
 ******************************************************************************/

/*!
 * @brief XRDC_MRCFG - Memory Region Configuration Register (RO)
 *
 * Reset value: 0x00U
 *
 * This register defines the number of implemented memory region descriptors
 * [1-16] for each MRCn, where n+1 can specify up to 16 instances. Implementations
 * of 4, 8, 12 or 16 region descriptors are supported. These registers are
 * organized as a byte-sized data array and can be read using 8-, 16- or 32-bit
 * accesses. A zero value indicates a non-existent memory region controller instance.
 * Attempted writes are error terminated. Access: Secure Privileged Read
 */
/*!
 * @name Constants and macros for entire XRDC_MRCFG register
 */
/*@{*/
#define XRDC_RD_MRCFG(base, index) (XRDC_MRCFG_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual XRDC_MRCFG bitfields
 */

/*!
 * @name Register XRDC_MRCFG, field NMGD[4:0] (RO)
 *
 * Number of memory region descriptors for memory region controller n. This
 * field specifies the number of memory region descriptors associated with a given
 * memory region controller instance. The value is limited to the range [0-16],
 * where zero indicates a non-existent memory region controller instance and
 * non-zero values indicate the number of implemented memory region descriptors [4,
 * 8,12,16] associated with the XRDC_MRCn submodule.
 */
/*@{*/
/*! @brief Read current value of the XRDC_MRCFG_NMGD field. */
#define XRDC_RD_MRCFG_NMGD(base, index) ((XRDC_MRCFG_REG(base, index) & XRDC_MRCFG_NMGD_MASK) >> XRDC_MRCFG_NMGD_SHIFT)
#define XRDC_BRD_MRCFG_NMGD(base, index) (BME_UBFX8(&XRDC_MRCFG_REG(base, index), XRDC_MRCFG_NMGD_SHIFT, XRDC_MRCFG_NMGD_WIDTH))
/*@}*/

/*******************************************************************************
 * XRDC_DERRLOC - Domain Error Location Register
 ******************************************************************************/

/*!
 * @brief XRDC_DERRLOC - Domain Error Location Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * When an access violation is detected by either a memory region controller or
 * a peripheral access controller, address and attribute information of the
 * offending access is captured. Using the faulting domainID number as the index (n),
 * this array of read-only registers provide additional information signaling the
 * instance number of the submodule where the access violation(s) occurred.
 * Since the resulting exception handler needs the submodule instance to retrieve the
 * captured address and attribute information from DERR_W0_n and DERR_W1_n,
 * these registers provide the instance number details. These registers are organized
 * as a word array, indexed by the faulting domain number, with the contents of
 * each register providing a bitmap signaling the instance number(s) associated
 * with all submodules containing captured error information for that domain.
 * There may be multiple access violations, across multiple instances, pending for a
 * given domain. It is suggested that exception handler software use a "find
 * first one" instruction (alternatively known as "count leading zeroes") to quickly
 * and efficiently find the instance number containing access violation details.
 * Once the instance number has been determined, the captured error address and
 * attribute information can easily be retrieved from the domain error registers
 * (DERR_W0_n, DERR_W1_n). See Domain error capture management for more details.
 * Attempted writes are error terminated. Access: Secure Privileged Read
 */
/*!
 * @name Constants and macros for entire XRDC_DERRLOC register
 */
/*@{*/
#define XRDC_RD_DERRLOC(base, index) (XRDC_DERRLOC_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual XRDC_DERRLOC bitfields
 */

/*!
 * @name Register XRDC_DERRLOC, field MRCINST[15:0] (RO)
 *
 * Memory region controller instance number. This field provides a bitmap
 * signaling the presence of a detected access violation for domain n in the
 * implemented instances of the memory region controller. Memory region controller instance
 * 0 corresponds to bit 0, instance 1 to bit 1, instance 2 to bit 2, etc.
 * Multiple bits can be set at any time indicating access violations for this domain
 * have been detected across multiple instances of the memory region controllers.
 * For each bit in this field: 0:The memory region controller has not detected an
 * access violation or is not physically present. 1:The memory region controller
 * has detected one or more access violations for this domain.
 */
/*@{*/
/*! @brief Read current value of the XRDC_DERRLOC_MRCINST field. */
#define XRDC_RD_DERRLOC_MRCINST(base, index) ((XRDC_DERRLOC_REG(base, index) & XRDC_DERRLOC_MRCINST_MASK) >> XRDC_DERRLOC_MRCINST_SHIFT)
#define XRDC_BRD_DERRLOC_MRCINST(base, index) (XRDC_RD_DERRLOC_MRCINST(base, index))
/*@}*/

/*!
 * @name Register XRDC_DERRLOC, field PACINST[19:16] (RO)
 *
 * Peripheral access controller instance number. This field provides a bitmap
 * signaling the presence of a detected access violation for domain n in the
 * implemented instances of the peripheral access controller. Peripheral access
 * controller instance 0 corresponds to bit 16, instance 1 to bit 17, etc. Multiple bits
 * can be set at any time indicating access violations for this domain have been
 * detected across multiple instances of the peripheral access controllers. For
 * each bit in this field: 0: The peripheral access controller has not detected
 * an access violation or is not physically present. 1: The peripheral access
 * controller has detected one or more access violations for this domain.
 */
/*@{*/
/*! @brief Read current value of the XRDC_DERRLOC_PACINST field. */
#define XRDC_RD_DERRLOC_PACINST(base, index) ((XRDC_DERRLOC_REG(base, index) & XRDC_DERRLOC_PACINST_MASK) >> XRDC_DERRLOC_PACINST_SHIFT)
#define XRDC_BRD_DERRLOC_PACINST(base, index) (BME_UBFX32(&XRDC_DERRLOC_REG(base, index), XRDC_DERRLOC_PACINST_SHIFT, XRDC_DERRLOC_PACINST_WIDTH))
/*@}*/

