pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * XRDC_DERR_W - Domain Error Word0 Register
 ******************************************************************************/

/*!
 * @brief XRDC_DERR_W - Domain Error Word0 Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * When an access violation is detected by either a memory region controller or
 * a peripheral access controller, address and attribute information of the
 * offending access is captured. This read-only register array provides the captured
 * error access address. The registers are organized in a data structure based on
 * instance number, that is, n = the instance number of the submodule which
 * detected the access violation and are read using information directly extracted
 * from the DERRLOCn registers. The memory-mapped error capture detail registers are
 * organized as twenty sequential 16-byte entries, first the 16 register sets
 * associated with the memory region controllers, then the 4 registers sets
 * associated with the peripheral access controllers. Each 16-byte structure contains
 * DERR_W0_n, DERR_W1_n, DERR_W2_n and DERR_W3_n. The error capture registers in
 * the memory region controller and peripheral access controller submodules contain
 * physical registers for each domain, but are organized in the DERR_W0_n and
 * DERR_W1_n registers to provide the information for the requesting domain only.
 * Thus, the access violation exception handler for each domain only has
 * visibility into the captured error information for its own domain. See Domain error
 * capture management for more details. When an access violation is detected and the
 * offending information captured, subsequent updates to this register are
 * disabled until the required data pattern is written to the DERR_W3_n register. At
 * that time, this register is cleared and re-enabled to capture the next access
 * violation. Attempted writes are error terminated as are attempted reads of an
 * MRC or PAC instance that is not physically present. Access: Secure Privileged
 * Read
 */
/*!
 * @name Constants and macros for entire XRDC_DERR_W register
 */
/*@{*/
#define XRDC_RD_DERR_W(base, index, index2) (XRDC_DERR_W_REG(base, index, index2))
/*@}*/

/*
 * Constants & macros for individual XRDC_DERR_W bitfields
 */

/*!
 * @name Register XRDC_DERR_W, field EDID[3:0] (RO)
 *
 * Error domain identifier. This field captures the domain identifier of the
 * access violation.
 */
/*@{*/
/*! @brief Read current value of the XRDC_DERR_W_EDID field. */
#define XRDC_RD_DERR_W_EDID(base, index, index2) ((XRDC_DERR_W_REG(base, index, index2) & XRDC_DERR_W_EDID_MASK) >> XRDC_DERR_W_EDID_SHIFT)
#define XRDC_BRD_DERR_W_EDID(base, index, index2) (BME_UBFX32(&XRDC_DERR_W_REG(base, index, index2), XRDC_DERR_W_EDID_SHIFT, XRDC_DERR_W_EDID_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_DERR_W, field EATR[10:8] (RO)
 *
 * Error attributes. This field captures certain attributes of the access
 * violation.
 *
 * Values:
 * - 0b000 - Secure user mode, instruction fetch access
 * - 0b001 - Secure user mode, data access
 * - 0b010 - Secure privileged mode, instruction fetch access
 * - 0b011 - Secure privileged mode, data access
 * - 0b100 - Nonsecure user mode, instruction fetch access
 * - 0b101 - Nonsecure user mode, data access
 * - 0b110 - Nonsecure privileged mode, instruction fetch access
 * - 0b111 - Nonsecure privileged mode, data access
 */
/*@{*/
/*! @brief Read current value of the XRDC_DERR_W_EATR field. */
#define XRDC_RD_DERR_W_EATR(base, index, index2) ((XRDC_DERR_W_REG(base, index, index2) & XRDC_DERR_W_EATR_MASK) >> XRDC_DERR_W_EATR_SHIFT)
#define XRDC_BRD_DERR_W_EATR(base, index, index2) (BME_UBFX32(&XRDC_DERR_W_REG(base, index, index2), XRDC_DERR_W_EATR_SHIFT, XRDC_DERR_W_EATR_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_DERR_W, field ERW[11] (RO)
 *
 * Error read/write. This field signals whether the captured access violation
 * occurred on a read or write reference.
 *
 * Values:
 * - 0b0 - Read access
 * - 0b1 - Write access
 */
/*@{*/
/*! @brief Read current value of the XRDC_DERR_W_ERW field. */
#define XRDC_RD_DERR_W_ERW(base, index, index2) ((XRDC_DERR_W_REG(base, index, index2) & XRDC_DERR_W_ERW_MASK) >> XRDC_DERR_W_ERW_SHIFT)
#define XRDC_BRD_DERR_W_ERW(base, index, index2) (BME_UBFX32(&XRDC_DERR_W_REG(base, index, index2), XRDC_DERR_W_ERW_SHIFT, XRDC_DERR_W_ERW_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_DERR_W, field EPORT[26:24] (RO)
 *
 * Error port. This field identifies the encoded port number of the memory
 * region controller that detected the access violation. The MRC port number
 * connection is device-specific. See the chip configuration details for more information.
 * For access violations detected by the peripheral access controller, this
 * field is cleared.
 */
/*@{*/
/*! @brief Read current value of the XRDC_DERR_W_EPORT field. */
#define XRDC_RD_DERR_W_EPORT(base, index, index2) ((XRDC_DERR_W_REG(base, index, index2) & XRDC_DERR_W_EPORT_MASK) >> XRDC_DERR_W_EPORT_SHIFT)
#define XRDC_BRD_DERR_W_EPORT(base, index, index2) (BME_UBFX32(&XRDC_DERR_W_REG(base, index, index2), XRDC_DERR_W_EPORT_SHIFT, XRDC_DERR_W_EPORT_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_DERR_W, field EST[31:30] (RO)
 *
 * Error state. This field signals the state of access violations for this
 * domain in this instance of the memory region controller or peripheral access
 * controller. Once an access violation has been detected and the faulting address and
 * attribute information stored, subsequent errors are simply recorded as an
 * overrun condition without any data captured. After retrieving the faulting address
 * and attributes, the error capture mechanism must be rearmed by performing a
 * write to DERR_W3_n.
 *
 * Values:
 * - 0b00 - No access violation has been detected.
 * - 0b01 - No access violation has been detected.
 * - 0b10 - A single access violation has been detected.
 * - 0b11 - Multiple access violations for this domain have been detected by
 *     this submodule instance. Only the address and attribute information for the
 *     first error have been captured in DERR_W0_n and DERR_W1_n.
 */
/*@{*/
/*! @brief Read current value of the XRDC_DERR_W_EST field. */
#define XRDC_RD_DERR_W_EST(base, index, index2) ((XRDC_DERR_W_REG(base, index, index2) & XRDC_DERR_W_EST_MASK) >> XRDC_DERR_W_EST_SHIFT)
#define XRDC_BRD_DERR_W_EST(base, index, index2) (BME_UBFX32(&XRDC_DERR_W_REG(base, index, index2), XRDC_DERR_W_EST_SHIFT, XRDC_DERR_W_EST_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_DERR_W, field RECR[31:30] (WORZ)
 *
 * Rearm Error Capture Registers. This 2-bit write-only field controls the
 * rearming of the domain error capture registers. access controller. Once an access
 * violation has been detected with the faulting address and attribute information
 * stored, subsequent errors are simply recorded as an overrun condition without
 * any data captured. A write with the appropriate value in this field rearms
 * the error capture mechanism and clears the DERR_W0_n and DERR_W1_n registers. if
 * RECR == 01b then DERR_W0_n and DERR_W1_n are cleared, and re-enabled to
 * capture the next access violation else no operation is performed.
 */
/*@{*/
/*! @brief Set the RECR field to a new value. */
#define XRDC_WR_DERR_W_RECR(base, index, index2, value) (XRDC_RMW_DERR_W(base, index, index2, XRDC_DERR_W_RECR_MASK, XRDC_DERR_W_RECR(value)))
#define XRDC_BWR_DERR_W_RECR(base, index, index2, value) (BME_BFI32(&XRDC_DERR_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_DERR_W_RECR_SHIFT), XRDC_DERR_W_RECR_SHIFT, XRDC_DERR_W_RECR_WIDTH))
/*@}*/

