pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * XRDC_PID - Process Identifier
 ******************************************************************************/

/*!
 * @brief XRDC_PID - Process Identifier (RW)
 *
 * Reset value: 0x00000000U
 *
 * In the XRDC's access control definition, each processor has a corresponding
 * process identifier (PID) which performs two important functions: the PID[5] bit
 * defines the secure/nonsecure attribute associated with an executing task, and
 * the entire value can be used to group tasks into different domains. While
 * certain processors include this register in their programming model definitions,
 * others do not. This register is provided for those processors that do not
 * include a PID register in their programming models. Secure privileged software
 * saves and restores the PID as part of any context switch. This data structure
 * defines an array of 32-bit values, one per bus master, that define the PID. Since
 * this register resource is only applicable to processor cores, the data
 * structure is typically sparsely populated. The HWCFG[2-3] registers provide a bitmap
 * of the implemented PIDn registers. This data structure is indexed using the
 * physical bus master number. For processors only supporting the 3-state access
 * control model (SecurePriv, SecureUser, NonsecureUser), the nonsecure_n output
 * signal from the MDAC submodule is forced to zero while in privileged mode to
 * enable precise state transitions between user and privileged modes.
 * Specifically, the MDAC logic for bus master n forms the nonsecure attribute output signal
 * as a function of 2 configuration bits: PIDn[TSM] and HWCFG{2,3}[n]. The MDAC
 * operates as described in Master Domain Assignment Controller (XRDC_MDAC). Reads
 * of the PIDn register return the contents of this register, or the PIDn value
 * directly sourced from a processor. For non-processor bus masters, this
 * register does not exist and any attempted read is error terminated. Generation of the
 * nonsecure_out[n] Attribute Configuration {PIDn[TSM], HWCFG{2,3}[n]}
 * local_nonsecure[n] nonsecure_out[n] 00b nonsecure_in[n] local_nonsecure[n] 01b
 * nonsecure_in[n] local_nonsecure[n] & ~priv_in[n] 10b PIDn[5] local_nonsecure[n] &
 * ~priv_in[n] 11b pid_in[n][5] local_nonsecure[n] & ~priv_in[n]
 */
/*!
 * @name Constants and macros for entire XRDC_PID register
 */
/*@{*/
#define XRDC_RD_PID(base, index) (XRDC_PID_REG(base, index))
#define XRDC_WR_PID(base, index, value) (XRDC_PID_REG(base, index) = (value))
#define XRDC_RMW_PID(base, index, mask, value) (XRDC_WR_PID(base, index, (XRDC_RD_PID(base, index) & ~(mask)) | (value)))
#define XRDC_SET_PID(base, index, value) (BME_OR32(&XRDC_PID_REG(base, index), (uint32_t)(value)))
#define XRDC_CLR_PID(base, index, value) (BME_AND32(&XRDC_PID_REG(base, index), (uint32_t)(~(value))))
#define XRDC_TOG_PID(base, index, value) (BME_XOR32(&XRDC_PID_REG(base, index), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XRDC_PID bitfields
 */

/*!
 * @name Register XRDC_PID, field PID[5:0] (RW)
 *
 * Process identifier. The PIDn[5] bit determines the secure (PID[5] = 0) or
 * nonsecure (PID[5] = 1) attribute for transactions associated with the
 * corresponding processor. If the processor sources its PIDn directly, then secure
 * privileged reads of this memory location return the processor register for this field.
 */
/*@{*/
/*! @brief Read current value of the XRDC_PID_PID field. */
#define XRDC_RD_PID_PID(base, index) ((XRDC_PID_REG(base, index) & XRDC_PID_PID_MASK) >> XRDC_PID_PID_SHIFT)
#define XRDC_BRD_PID_PID(base, index) (BME_UBFX32(&XRDC_PID_REG(base, index), XRDC_PID_PID_SHIFT, XRDC_PID_PID_WIDTH))

/*! @brief Set the PID field to a new value. */
#define XRDC_WR_PID_PID(base, index, value) (XRDC_RMW_PID(base, index, XRDC_PID_PID_MASK, XRDC_PID_PID(value)))
#define XRDC_BWR_PID_PID(base, index, value) (BME_BFI32(&XRDC_PID_REG(base, index), ((uint32_t)(value) << XRDC_PID_PID_SHIFT), XRDC_PID_PID_SHIFT, XRDC_PID_PID_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_PID, field TSM[28] (RW)
 *
 * Three-state model. If asserted, this bit indicates the associated processor
 * core only supports the 3-state access control model. This indicator is
 * "sticky", that is, once set, it remains set until the next reset. For processors only
 * supporting the 3-state access control model, this field must be set before
 * loading any nonsecure value into the PID. See for the specification of the
 * privileged and nonsecure attributes generated by MDAC.
 */
/*@{*/
/*! @brief Read current value of the XRDC_PID_TSM field. */
#define XRDC_RD_PID_TSM(base, index) ((XRDC_PID_REG(base, index) & XRDC_PID_TSM_MASK) >> XRDC_PID_TSM_SHIFT)
#define XRDC_BRD_PID_TSM(base, index) (BME_UBFX32(&XRDC_PID_REG(base, index), XRDC_PID_TSM_SHIFT, XRDC_PID_TSM_WIDTH))

/*! @brief Set the TSM field to a new value. */
#define XRDC_WR_PID_TSM(base, index, value) (XRDC_RMW_PID(base, index, XRDC_PID_TSM_MASK, XRDC_PID_TSM(value)))
#define XRDC_BWR_PID_TSM(base, index, value) (BME_BFI32(&XRDC_PID_REG(base, index), ((uint32_t)(value) << XRDC_PID_TSM_SHIFT), XRDC_PID_TSM_SHIFT, XRDC_PID_TSM_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_PID, field LK2[30:29] (RW)
 *
 * Lock. This field provides a locking mechanism that can be used to limit the
 * ability to write the register. Once set, these bits individually remain
 * asserted until the next reset. If the processor sources its PIDn directly, that is,
 * HWCFG{2-3}[PIDPn = 1], then secure privileged reads of this memory location
 * return zero for this field.
 *
 * Values:
 * - 0b00 - Register can be written by any secure privileged write.
 * - 0b01 - Register can be written by any secure privileged write.
 * - 0b10 - Register can only be written by a secure privileged write from bus
 *     master n.
 * - 0b11 - Register is locked (read-only) until the next reset.
 */
/*@{*/
/*! @brief Read current value of the XRDC_PID_LK2 field. */
#define XRDC_RD_PID_LK2(base, index) ((XRDC_PID_REG(base, index) & XRDC_PID_LK2_MASK) >> XRDC_PID_LK2_SHIFT)
#define XRDC_BRD_PID_LK2(base, index) (BME_UBFX32(&XRDC_PID_REG(base, index), XRDC_PID_LK2_SHIFT, XRDC_PID_LK2_WIDTH))

/*! @brief Set the LK2 field to a new value. */
#define XRDC_WR_PID_LK2(base, index, value) (XRDC_RMW_PID(base, index, XRDC_PID_LK2_MASK, XRDC_PID_LK2(value)))
#define XRDC_BWR_PID_LK2(base, index, value) (BME_BFI32(&XRDC_PID_REG(base, index), ((uint32_t)(value) << XRDC_PID_LK2_SHIFT), XRDC_PID_LK2_SHIFT, XRDC_PID_LK2_WIDTH))
/*@}*/

