pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*******************************************************************************
 * XRDC_MDA_W - Master Domain Assignment W0
 ******************************************************************************/

/*!
 * @brief XRDC_MDA_W - Master Domain Assignment W0 (RW)
 *
 * Reset value: 0x00000000U
 *
 * The MDA_Wm_n registers provide a 2-dimensional data structure for assigning
 * bus masters to domains. There are up to 8 word-sized registers available for
 * each bus master (Wm), although the number of implemented registers is typically
 * less than the maximum and is defined by MDACFGn[NMDAR]. This per-master domain
 * assignment is then repeated for each bus master (MDAn). Thus, "n" specifies
 * the master number and "m" refers to the specific MDA register for a given bus
 * master. Each Wm within the MDAn structure is a word-sized definition; there are
 * two formats supported, one for processor cores and another for
 * non-processors. Processor masters typically support one or more Wm domain definitions, while
 * non-processor masters support a single Wm. The MDAC submodule is responsible
 * for the generation of domain identifiers for every transaction from every bus
 * master. If there is a single Wm for a given master, then the specified domain
 * identifier is used directly. If there are multiple Wm values for a given
 * master, then the MDAC evaluates the conditional terms to determine a "hit". For all
 * Wm "hits", their corresponding domain identifiers are simply logically summed
 * together (boolean OR). Use cases are typically expected to hit in a single Wm
 * for a processor master. Special care is needed if none of the conditional
 * terms "hit" in any Wm evaluation; for this case, the generated DID = 0 and
 * software needs to be aware of any potential access rights granted for this DID. The
 * domain format (DFMT = 0) definition allows three different specifications of
 * the DID for processors, while the DFMT = 1 supports two different
 * specifications of the DID for non-core bus masters. Access: Secure Privileged Read/write
 */
/*!
 * @name Constants and macros for entire XRDC_MDA_W register
 */
/*@{*/
#define XRDC_RD_MDA_W(base, index, index2) (XRDC_MDA_W_REG(base, index, index2))
#define XRDC_WR_MDA_W(base, index, index2, value) (XRDC_MDA_W_REG(base, index, index2) = (value))
#define XRDC_RMW_MDA_W(base, index, index2, mask, value) (XRDC_WR_MDA_W(base, index, index2, (XRDC_RD_MDA_W(base, index, index2) & ~(mask)) | (value)))
#define XRDC_SET_MDA_W(base, index, index2, value) (BME_OR32(&XRDC_MDA_W_REG(base, index, index2), (uint32_t)(value)))
#define XRDC_CLR_MDA_W(base, index, index2, value) (BME_AND32(&XRDC_MDA_W_REG(base, index, index2), (uint32_t)(~(value))))
#define XRDC_TOG_MDA_W(base, index, index2, value) (BME_XOR32(&XRDC_MDA_W_REG(base, index, index2), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XRDC_MDA_W bitfields
 */

/*!
 * @name Register XRDC_MDA_W, field DID[3:0] (RW)
 *
 * Domain identifier.
 */
/*@{*/
/*! @brief Read current value of the XRDC_MDA_W_DID field. */
#define XRDC_RD_MDA_W_DID(base, index, index2) ((XRDC_MDA_W_REG(base, index, index2) & XRDC_MDA_W_DID_MASK) >> XRDC_MDA_W_DID_SHIFT)
#define XRDC_BRD_MDA_W_DID(base, index, index2) (BME_UBFX32(&XRDC_MDA_W_REG(base, index, index2), XRDC_MDA_W_DID_SHIFT, XRDC_MDA_W_DID_WIDTH))

/*! @brief Set the DID field to a new value. */
#define XRDC_WR_MDA_W_DID(base, index, index2, value) (XRDC_RMW_MDA_W(base, index, index2, XRDC_MDA_W_DID_MASK, XRDC_MDA_W_DID(value)))
#define XRDC_BWR_MDA_W_DID(base, index, index2, value) (BME_BFI32(&XRDC_MDA_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_MDA_W_DID_SHIFT), XRDC_MDA_W_DID_SHIFT, XRDC_MDA_W_DID_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_MDA_W, field DIDSPA[5:4] (RW)
 *
 * The functionality of this field changes based on the value of DFMT: For
 * DFMT=0: Bits 1:0 define the logcal field DIDS, DID Select. This field selects the
 * source of the domain identifier. 00: Use MDAn[3:0] as the domain identifier.
 * 01: Use the input DID as the domain identifier. 10: Use MDAn[3:2] concatenated
 * with the low-order 2 bits of the input DID (DID_in[1:0]) as the domain
 * identifier. 11: Reserved for future use. For DFMT=1: Bits 1:0 define the logical field
 * PA, Privileged attribute. This field defines the privileged/user attribute
 * for non-processor cores. 00: Force the bus attribute for this master to user.
 * 01: Force the bus attribute for this master to privileged. 10: Use the bus
 * master's privileged/user attribute directly. 11: Use the bus master's
 * privileged/user attribute directly. The bus master's input privileged/user attribute is
 * used if PA = 1-, or this VLD = 0.
 */
/*@{*/
/*! @brief Read current value of the XRDC_MDA_W_DIDSPA field. */
#define XRDC_RD_MDA_W_DIDSPA(base, index, index2) ((XRDC_MDA_W_REG(base, index, index2) & XRDC_MDA_W_DIDSPA_MASK) >> XRDC_MDA_W_DIDSPA_SHIFT)
#define XRDC_BRD_MDA_W_DIDSPA(base, index, index2) (BME_UBFX32(&XRDC_MDA_W_REG(base, index, index2), XRDC_MDA_W_DIDSPA_SHIFT, XRDC_MDA_W_DIDSPA_WIDTH))

/*! @brief Set the DIDSPA field to a new value. */
#define XRDC_WR_MDA_W_DIDSPA(base, index, index2, value) (XRDC_RMW_MDA_W(base, index, index2, XRDC_MDA_W_DIDSPA_MASK, XRDC_MDA_W_DIDSPA(value)))
#define XRDC_BWR_MDA_W_DIDSPA(base, index, index2, value) (BME_BFI32(&XRDC_MDA_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_MDA_W_DIDSPA_SHIFT), XRDC_MDA_W_DIDSPA_SHIFT, XRDC_MDA_W_DIDSPA_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_MDA_W, field PESA[7:6] (RW)
 *
 * The functionality of this field changes based on the value of DFMT: For
 * DFMT=0: Bits 1:0 define the logical field PE, Process identifier enable. This field
 * controls the optional inclusion of the PID, qualified by PIDM, into the
 * domain hit evaluation. It provides the ability to include inclusive or exclusive
 * sets of masked PID values. 00: No process identifier is included in the domain
 * hit evaluation 01: No process identifier is included in the domain hit
 * evaluation 10: The process identifier is included in the domain hit evaluation as
 * defined by the expression:partial_domain_hit = (PE[7:6] == 10) && ((PID[21:16] &
 * ~PIDM[13:8]) == (PID & ~PIDM[13:8])) 11: The process identifier is included in
 * the domain hit evaluation as defined by the expression:partial_domain_hit =
 * (PE[7:6] == 11) && ~((PID[21:16] & ~PIDM[13:8]) == (PID & ~PIDM[13:8])) For
 * DFMT=0: Bits 1:0 define the logical field SA, Secure attribute. This field defines
 * the secure/nonsecure attribute for non-processor cores. 00: Force the bus
 * attribute for this master to secure. 01: Force the bus attribute for this master
 * to nonsecure. 10: Use the bus master's secure/nonsecure attribute directly.
 * 11: Use the bus master's secure/nonsecure attribute directly. The bus master's
 * input secure/nonsecure attribute is used if SA = 1-, or this VLD = 0.
 */
/*@{*/
/*! @brief Read current value of the XRDC_MDA_W_PESA field. */
#define XRDC_RD_MDA_W_PESA(base, index, index2) ((XRDC_MDA_W_REG(base, index, index2) & XRDC_MDA_W_PESA_MASK) >> XRDC_MDA_W_PESA_SHIFT)
#define XRDC_BRD_MDA_W_PESA(base, index, index2) (BME_UBFX32(&XRDC_MDA_W_REG(base, index, index2), XRDC_MDA_W_PESA_SHIFT, XRDC_MDA_W_PESA_WIDTH))

/*! @brief Set the PESA field to a new value. */
#define XRDC_WR_MDA_W_PESA(base, index, index2, value) (XRDC_RMW_MDA_W(base, index, index2, XRDC_MDA_W_PESA_MASK, XRDC_MDA_W_PESA(value)))
#define XRDC_BWR_MDA_W_PESA(base, index, index2, value) (BME_BFI32(&XRDC_MDA_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_MDA_W_PESA_SHIFT), XRDC_MDA_W_PESA_SHIFT, XRDC_MDA_W_PESA_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_MDA_W, field PIDMDIDB[21:8] (RW)
 *
 * The functionality of this field changes based on the value of DFMT: For
 * DFMT=0: Bits 13-8 define logical field PIDM, Process Identifier. This field
 * specifies that the process identifier is to be combined with the PIDM field and
 * included in the domain hit determination. The optional inclusion of the PID and
 * PIDM is controlled by the MDA_Wm_n[PE] field. Bits 7-6 are reserved. Bits 5-0
 * define logical field PIDM, Process Identifier Mask. This field provides a masking
 * capability so that multiple process identifiers can be included as part of
 * the domain hit determination. If a bit in the PIDM is set, then the
 * corresponding bit of the PID is ignored in the comparison. The optional inclusion of the
 * PID and PIDM is controlled by the MDA_Wm_n[PE] field. For DFMT=1: Bits 13-1 are
 * reserved. Bit 0 defines logical field DIDB, DID Bypass. If asserted, this
 * field enables the bypassing of an input DID value as the domain identifier for
 * this non-processor bus master. This capability allows non-processor bus masters,
 * for example, a DMA to masquerade as a processor. Once set, this field is
 * "sticky" and remains set until the next reset. 0: Use MDAn[3:0] as the domain
 * identifier. 1: Use the DID input as the domain identifier.
 */
/*@{*/
/*! @brief Read current value of the XRDC_MDA_W_PIDMDIDB field. */
#define XRDC_RD_MDA_W_PIDMDIDB(base, index, index2) ((XRDC_MDA_W_REG(base, index, index2) & XRDC_MDA_W_PIDMDIDB_MASK) >> XRDC_MDA_W_PIDMDIDB_SHIFT)
#define XRDC_BRD_MDA_W_PIDMDIDB(base, index, index2) (XRDC_RD_MDA_W_PIDMDIDB(base, index, index2))

/*! @brief Set the PIDMDIDB field to a new value. */
#define XRDC_WR_MDA_W_PIDMDIDB(base, index, index2, value) (XRDC_RMW_MDA_W(base, index, index2, XRDC_MDA_W_PIDMDIDB_MASK, XRDC_MDA_W_PIDMDIDB(value)))
#define XRDC_BWR_MDA_W_PIDMDIDB(base, index, index2, value) (XRDC_WR_MDA_W_PIDMDIDB(base, index, index2, value))
/*@}*/

/*!
 * @name Register XRDC_MDA_W, field LPID[27:24] (RW)
 *
 * Logical partition Identifier. This 4-bit field defines an optional logical
 * partition identifier (as known as an operating system number) to be included in
 * the domain hit evaluation. This functionality is only available if the XRDC is
 * virtualization aware (signaled by CR[VAW] = 1).
 */
/*@{*/
/*! @brief Read current value of the XRDC_MDA_W_LPID field. */
#define XRDC_RD_MDA_W_LPID(base, index, index2) ((XRDC_MDA_W_REG(base, index, index2) & XRDC_MDA_W_LPID_MASK) >> XRDC_MDA_W_LPID_SHIFT)
#define XRDC_BRD_MDA_W_LPID(base, index, index2) (BME_UBFX32(&XRDC_MDA_W_REG(base, index, index2), XRDC_MDA_W_LPID_SHIFT, XRDC_MDA_W_LPID_WIDTH))

/*! @brief Set the LPID field to a new value. */
#define XRDC_WR_MDA_W_LPID(base, index, index2, value) (XRDC_RMW_MDA_W(base, index, index2, XRDC_MDA_W_LPID_MASK, XRDC_MDA_W_LPID(value)))
#define XRDC_BWR_MDA_W_LPID(base, index, index2, value) (BME_BFI32(&XRDC_MDA_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_MDA_W_LPID_SHIFT), XRDC_MDA_W_LPID_SHIFT, XRDC_MDA_W_LPID_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_MDA_W, field LPE[28] (RW)
 *
 * Logical partition enable. If the XRDC is virtualization aware (signaled by
 * CR[VAW] = 1), this field enables the inclusion of a logical partition identifier
 * to be included in the domain hit evaluation. 0 The LPID field is not included
 * in the domain hit evaluation. 1 The LPID field is included in the domain hit
 * evaluation
 */
/*@{*/
/*! @brief Read current value of the XRDC_MDA_W_LPE field. */
#define XRDC_RD_MDA_W_LPE(base, index, index2) ((XRDC_MDA_W_REG(base, index, index2) & XRDC_MDA_W_LPE_MASK) >> XRDC_MDA_W_LPE_SHIFT)
#define XRDC_BRD_MDA_W_LPE(base, index, index2) (BME_UBFX32(&XRDC_MDA_W_REG(base, index, index2), XRDC_MDA_W_LPE_SHIFT, XRDC_MDA_W_LPE_WIDTH))

/*! @brief Set the LPE field to a new value. */
#define XRDC_WR_MDA_W_LPE(base, index, index2, value) (XRDC_RMW_MDA_W(base, index, index2, XRDC_MDA_W_LPE_MASK, XRDC_MDA_W_LPE(value)))
#define XRDC_BWR_MDA_W_LPE(base, index, index2, value) (BME_BFI32(&XRDC_MDA_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_MDA_W_LPE_SHIFT), XRDC_MDA_W_LPE_SHIFT, XRDC_MDA_W_LPE_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_MDA_W, field DFMT[29] (RW)
 *
 * Domain format. This field identifies the MDA_Wm_n as a processor core domain
 * assignment (DFMT = 0) or a non-processor domain assignment (DFMT = 1).
 */
/*@{*/
/*! @brief Read current value of the XRDC_MDA_W_DFMT field. */
#define XRDC_RD_MDA_W_DFMT(base, index, index2) ((XRDC_MDA_W_REG(base, index, index2) & XRDC_MDA_W_DFMT_MASK) >> XRDC_MDA_W_DFMT_SHIFT)
#define XRDC_BRD_MDA_W_DFMT(base, index, index2) (BME_UBFX32(&XRDC_MDA_W_REG(base, index, index2), XRDC_MDA_W_DFMT_SHIFT, XRDC_MDA_W_DFMT_WIDTH))

