pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the DFMT field to a new value. */
#define XRDC_WR_MDA_W_DFMT(base, index, index2, value) (XRDC_RMW_MDA_W(base, index, index2, XRDC_MDA_W_DFMT_MASK, XRDC_MDA_W_DFMT(value)))
#define XRDC_BWR_MDA_W_DFMT(base, index, index2, value) (BME_BFI32(&XRDC_MDA_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_MDA_W_DFMT_SHIFT), XRDC_MDA_W_DFMT_SHIFT, XRDC_MDA_W_DFMT_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_MDA_W, field LK1[30] (RW)
 *
 * 1-bit Lock. This field provides a locking mechanism that can be used to limit
 * the ability to write the register. Once set, this bit remains asserted until
 * the next reset.
 *
 * Values:
 * - 0b0 - Register can be written by any secure privileged write.
 * - 0b1 - Register is locked (read-only) until the next reset.
 */
/*@{*/
/*! @brief Read current value of the XRDC_MDA_W_LK1 field. */
#define XRDC_RD_MDA_W_LK1(base, index, index2) ((XRDC_MDA_W_REG(base, index, index2) & XRDC_MDA_W_LK1_MASK) >> XRDC_MDA_W_LK1_SHIFT)
#define XRDC_BRD_MDA_W_LK1(base, index, index2) (BME_UBFX32(&XRDC_MDA_W_REG(base, index, index2), XRDC_MDA_W_LK1_SHIFT, XRDC_MDA_W_LK1_WIDTH))

/*! @brief Set the LK1 field to a new value. */
#define XRDC_WR_MDA_W_LK1(base, index, index2, value) (XRDC_RMW_MDA_W(base, index, index2, XRDC_MDA_W_LK1_MASK, XRDC_MDA_W_LK1(value)))
#define XRDC_BWR_MDA_W_LK1(base, index, index2, value) (BME_BFI32(&XRDC_MDA_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_MDA_W_LK1_SHIFT), XRDC_MDA_W_LK1_SHIFT, XRDC_MDA_W_LK1_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_MDA_W, field VLD[31] (RW)
 *
 * Valid. This field indicates the domain assignment is valid. It is further
 * qualified by CR[GVLD] = 1. The DID output is only enabled when both MDA_Wm_n[VLD]
 * and CR[GVLD] are asserted.
 *
 * Values:
 * - 0b0 - The Wm domain assignment is invalid.
 * - 0b1 - The Wm domain assignment is valid.
 */
/*@{*/
/*! @brief Read current value of the XRDC_MDA_W_VLD field. */
#define XRDC_RD_MDA_W_VLD(base, index, index2) ((XRDC_MDA_W_REG(base, index, index2) & XRDC_MDA_W_VLD_MASK) >> XRDC_MDA_W_VLD_SHIFT)
#define XRDC_BRD_MDA_W_VLD(base, index, index2) (BME_UBFX32(&XRDC_MDA_W_REG(base, index, index2), XRDC_MDA_W_VLD_SHIFT, XRDC_MDA_W_VLD_WIDTH))

/*! @brief Set the VLD field to a new value. */
#define XRDC_WR_MDA_W_VLD(base, index, index2, value) (XRDC_RMW_MDA_W(base, index, index2, XRDC_MDA_W_VLD_MASK, XRDC_MDA_W_VLD(value)))
#define XRDC_BWR_MDA_W_VLD(base, index, index2, value) (BME_BFI32(&XRDC_MDA_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_MDA_W_VLD_SHIFT), XRDC_MDA_W_VLD_SHIFT, XRDC_MDA_W_VLD_WIDTH))
/*@}*/

/*******************************************************************************
 * XRDC_PDAC_W - Peripheral Domain Access Control W0
 ******************************************************************************/

/*!
 * @brief XRDC_PDAC_W - Peripheral Domain Access Control W0 (RW)
 *
 * Reset value: 0x00000000U
 *
 * The PDAC_Wm_n registers provide a 2-dimensional data structure for defining
 * access control policies per domain for each implemented slave peripheral. There
 * are 2 word-sized registers assigned for each peripheral "address slot" (Wm)
 * and up to 512 peripheral assignments (up to 4 peripheral access controllers,
 * each supporting up to 128 peripheral slots). The actual number of implemented
 * peripheral access controllers is defined by MDACFGn[NPAC]. Each Wm within the
 * PDACn structure is a word-sized definition; a total of two words (64 bits) is
 * needed to define the access control policies for all the domains. These
 * registers also allow a hardware semaphore to be optionally included in the access
 * control evaluation for peripherals shared by multiple domains. If enabled, the
 * state of the semaphore dynamically modifies the access control policies so that
 * only the domain "owning" it has write permission into the peripheral. The write
 * permissions for all other domains are revoked based on the semaphore state.
 * If the semaphore is not owned by any domain, the DxACP fields are evaluated
 * normally. The PAC submodule uses the peripheral access address to select the
 * appropriate PDACn register, and then uses the domain identifier associated with
 * the access to select the appropriate DxACP field. The selected DxACP field is
 * then evaluated against the attributes associated with the memory transaction to
 * determine the validity of the access. See DxACP evaluation for more details.
 * If allowed, the access proceeds, else an access violation is signaled, the
 * transfer error terminated and the appropriate address and attribute information
 * captured in the corresponding error detail registers. Access: Secure Privileged
 * Read/write
 */
/*!
 * @name Constants and macros for entire XRDC_PDAC_W register
 */
/*@{*/
#define XRDC_RD_PDAC_W(base, index, index2) (XRDC_PDAC_W_REG(base, index, index2))
#define XRDC_WR_PDAC_W(base, index, index2, value) (XRDC_PDAC_W_REG(base, index, index2) = (value))
#define XRDC_RMW_PDAC_W(base, index, index2, mask, value) (XRDC_WR_PDAC_W(base, index, index2, (XRDC_RD_PDAC_W(base, index, index2) & ~(mask)) | (value)))
#define XRDC_SET_PDAC_W(base, index, index2, value) (BME_OR32(&XRDC_PDAC_W_REG(base, index, index2), (uint32_t)(value)))
#define XRDC_CLR_PDAC_W(base, index, index2, value) (BME_AND32(&XRDC_PDAC_W_REG(base, index, index2), (uint32_t)(~(value))))
#define XRDC_TOG_PDAC_W(base, index, index2, value) (BME_XOR32(&XRDC_PDAC_W_REG(base, index, index2), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XRDC_PDAC_W bitfields
 */

/*!
 * @name Register XRDC_PDAC_W, field D0ACP[2:0] (RW)
 *
 * Domain "x" access control policy. This 3-bit field defines the access control
 * rights for the selected domain. The encodings specify read and write access
 * capabilities based on the 4 operating states. These fields are only implemented
 * for supported domainIDs; unsupported domainIDs are not implemented and
 * default to a zero value providing no access rights. Policy SecurePriv SecureUser
 * NonsecurePriv NonsecureUser 111 r, w r, w r, w r, w 110 r, w r, w r, w none 101
 * r, w r, w r r 100 r, w r, w r none 011 r, w r, w none none 010 r, w none none
 * none 001 r r none none 000 none none none none
 */
/*@{*/
/*! @brief Read current value of the XRDC_PDAC_W_D0ACP field. */
#define XRDC_RD_PDAC_W_D0ACP(base, index, index2) ((XRDC_PDAC_W_REG(base, index, index2) & XRDC_PDAC_W_D0ACP_MASK) >> XRDC_PDAC_W_D0ACP_SHIFT)
#define XRDC_BRD_PDAC_W_D0ACP(base, index, index2) (BME_UBFX32(&XRDC_PDAC_W_REG(base, index, index2), XRDC_PDAC_W_D0ACP_SHIFT, XRDC_PDAC_W_D0ACP_WIDTH))

