pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the D0ACP field to a new value. */
#define XRDC_WR_PDAC_W_D0ACP(base, index, index2, value) (XRDC_RMW_PDAC_W(base, index, index2, XRDC_PDAC_W_D0ACP_MASK, XRDC_PDAC_W_D0ACP(value)))
#define XRDC_BWR_PDAC_W_D0ACP(base, index, index2, value) (BME_BFI32(&XRDC_PDAC_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_PDAC_W_D0ACP_SHIFT), XRDC_PDAC_W_D0ACP_SHIFT, XRDC_PDAC_W_D0ACP_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_PDAC_W, field D8ACP[2:0] (RW)
 *
 * Domain "x" access control policy. This 3-bit field defines the access control
 * rights for the selected domain. The encodings specify read and write access
 * capabilities based on the 4 operating states. These fields are only implemented
 * for supported domainIDs; unsupported domainIDs are not implemented and
 * default to a zero value providing no access rights. Policy SecurePriv SecureUser
 * NonsecurePriv NonsecureUser 111 r, w r, w r, w r, w 110 r, w r, w r, w none 101
 * r, w r, w r r 100 r, w r, w r none 011 r, w r, w none none 010 r, w none none
 * none 001 r r none none 000 none none none none
 */
/*@{*/
/*! @brief Read current value of the XRDC_PDAC_W_D8ACP field. */
#define XRDC_RD_PDAC_W_D8ACP(base, index, index2) ((XRDC_PDAC_W_REG(base, index, index2) & XRDC_PDAC_W_D8ACP_MASK) >> XRDC_PDAC_W_D8ACP_SHIFT)
#define XRDC_BRD_PDAC_W_D8ACP(base, index, index2) (BME_UBFX32(&XRDC_PDAC_W_REG(base, index, index2), XRDC_PDAC_W_D8ACP_SHIFT, XRDC_PDAC_W_D8ACP_WIDTH))

/*! @brief Set the D8ACP field to a new value. */
#define XRDC_WR_PDAC_W_D8ACP(base, index, index2, value) (XRDC_RMW_PDAC_W(base, index, index2, XRDC_PDAC_W_D8ACP_MASK, XRDC_PDAC_W_D8ACP(value)))
#define XRDC_BWR_PDAC_W_D8ACP(base, index, index2, value) (BME_BFI32(&XRDC_PDAC_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_PDAC_W_D8ACP_SHIFT), XRDC_PDAC_W_D8ACP_SHIFT, XRDC_PDAC_W_D8ACP_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_PDAC_W, field D1ACP[5:3] (RW)
 *
 * Domain "x" access control policy. This 3-bit field defines the access control
 * rights for the selected domain. The encodings specify read and write access
 * capabilities based on the 4 operating states. These fields are only implemented
 * for supported domainIDs; unsupported domainIDs are not implemented and
 * default to a zero value providing no access rights. Policy SecurePriv SecureUser
 * NonsecurePriv NonsecureUser 111 r, w r, w r, w r, w 110 r, w r, w r, w none 101
 * r, w r, w r r 100 r, w r, w r none 011 r, w r, w none none 010 r, w none none
 * none 001 r r none none 000 none none none none
 */
/*@{*/
/*! @brief Read current value of the XRDC_PDAC_W_D1ACP field. */
#define XRDC_RD_PDAC_W_D1ACP(base, index, index2) ((XRDC_PDAC_W_REG(base, index, index2) & XRDC_PDAC_W_D1ACP_MASK) >> XRDC_PDAC_W_D1ACP_SHIFT)
#define XRDC_BRD_PDAC_W_D1ACP(base, index, index2) (BME_UBFX32(&XRDC_PDAC_W_REG(base, index, index2), XRDC_PDAC_W_D1ACP_SHIFT, XRDC_PDAC_W_D1ACP_WIDTH))

/*! @brief Set the D1ACP field to a new value. */
#define XRDC_WR_PDAC_W_D1ACP(base, index, index2, value) (XRDC_RMW_PDAC_W(base, index, index2, XRDC_PDAC_W_D1ACP_MASK, XRDC_PDAC_W_D1ACP(value)))
#define XRDC_BWR_PDAC_W_D1ACP(base, index, index2, value) (BME_BFI32(&XRDC_PDAC_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_PDAC_W_D1ACP_SHIFT), XRDC_PDAC_W_D1ACP_SHIFT, XRDC_PDAC_W_D1ACP_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_PDAC_W, field D9ACP[5:3] (RW)
 *
 * Domain "x" access control policy. This 3-bit field defines the access control
 * rights for the selected domain. The encodings specify read and write access
 * capabilities based on the 4 operating states. These fields are only implemented
 * for supported domainIDs; unsupported domainIDs are not implemented and
 * default to a zero value providing no access rights. Policy SecurePriv SecureUser
 * NonsecurePriv NonsecureUser 111 r, w r, w r, w r, w 110 r, w r, w r, w none 101
 * r, w r, w r r 100 r, w r, w r none 011 r, w r, w none none 010 r, w none none
 * none 001 r r none none 000 none none none none
 */
/*@{*/
/*! @brief Read current value of the XRDC_PDAC_W_D9ACP field. */
#define XRDC_RD_PDAC_W_D9ACP(base, index, index2) ((XRDC_PDAC_W_REG(base, index, index2) & XRDC_PDAC_W_D9ACP_MASK) >> XRDC_PDAC_W_D9ACP_SHIFT)
#define XRDC_BRD_PDAC_W_D9ACP(base, index, index2) (BME_UBFX32(&XRDC_PDAC_W_REG(base, index, index2), XRDC_PDAC_W_D9ACP_SHIFT, XRDC_PDAC_W_D9ACP_WIDTH))

/*! @brief Set the D9ACP field to a new value. */
#define XRDC_WR_PDAC_W_D9ACP(base, index, index2, value) (XRDC_RMW_PDAC_W(base, index, index2, XRDC_PDAC_W_D9ACP_MASK, XRDC_PDAC_W_D9ACP(value)))
#define XRDC_BWR_PDAC_W_D9ACP(base, index, index2, value) (BME_BFI32(&XRDC_PDAC_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_PDAC_W_D9ACP_SHIFT), XRDC_PDAC_W_D9ACP_SHIFT, XRDC_PDAC_W_D9ACP_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_PDAC_W, field D10ACP[8:6] (RW)
 *
 * Domain "x" access control policy. This 3-bit field defines the access control
 * rights for the selected domain. The encodings specify read and write access
 * capabilities based on the 4 operating states. These fields are only implemented
 * for supported domainIDs; unsupported domainIDs are not implemented and
 * default to a zero value providing no access rights. Policy SecurePriv SecureUser
 * NonsecurePriv NonsecureUser 111 r, w r, w r, w r, w 110 r, w r, w r, w none 101
 * r, w r, w r r 100 r, w r, w r none 011 r, w r, w none none 010 r, w none none
 * none 001 r r none none 000 none none none none
 */
/*@{*/
/*! @brief Read current value of the XRDC_PDAC_W_D10ACP field. */
#define XRDC_RD_PDAC_W_D10ACP(base, index, index2) ((XRDC_PDAC_W_REG(base, index, index2) & XRDC_PDAC_W_D10ACP_MASK) >> XRDC_PDAC_W_D10ACP_SHIFT)
#define XRDC_BRD_PDAC_W_D10ACP(base, index, index2) (BME_UBFX32(&XRDC_PDAC_W_REG(base, index, index2), XRDC_PDAC_W_D10ACP_SHIFT, XRDC_PDAC_W_D10ACP_WIDTH))

/*! @brief Set the D10ACP field to a new value. */
#define XRDC_WR_PDAC_W_D10ACP(base, index, index2, value) (XRDC_RMW_PDAC_W(base, index, index2, XRDC_PDAC_W_D10ACP_MASK, XRDC_PDAC_W_D10ACP(value)))
#define XRDC_BWR_PDAC_W_D10ACP(base, index, index2, value) (BME_BFI32(&XRDC_PDAC_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_PDAC_W_D10ACP_SHIFT), XRDC_PDAC_W_D10ACP_SHIFT, XRDC_PDAC_W_D10ACP_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_PDAC_W, field D2ACP[8:6] (RW)
 *
 * Domain "x" access control policy. This 3-bit field defines the access control
 * rights for the selected domain. The encodings specify read and write access
 * capabilities based on the 4 operating states. These fields are only implemented
 * for supported domainIDs; unsupported domainIDs are not implemented and
 * default to a zero value providing no access rights. Policy SecurePriv SecureUser
 * NonsecurePriv NonsecureUser 111 r, w r, w r, w r, w 110 r, w r, w r, w none 101
 * r, w r, w r r 100 r, w r, w r none 011 r, w r, w none none 010 r, w none none
 * none 001 r r none none 000 none none none none
 */
/*@{*/
/*! @brief Read current value of the XRDC_PDAC_W_D2ACP field. */
#define XRDC_RD_PDAC_W_D2ACP(base, index, index2) ((XRDC_PDAC_W_REG(base, index, index2) & XRDC_PDAC_W_D2ACP_MASK) >> XRDC_PDAC_W_D2ACP_SHIFT)
#define XRDC_BRD_PDAC_W_D2ACP(base, index, index2) (BME_UBFX32(&XRDC_PDAC_W_REG(base, index, index2), XRDC_PDAC_W_D2ACP_SHIFT, XRDC_PDAC_W_D2ACP_WIDTH))

