pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the D2ACP field to a new value. */
#define XRDC_WR_PDAC_W_D2ACP(base, index, index2, value) (XRDC_RMW_PDAC_W(base, index, index2, XRDC_PDAC_W_D2ACP_MASK, XRDC_PDAC_W_D2ACP(value)))
#define XRDC_BWR_PDAC_W_D2ACP(base, index, index2, value) (BME_BFI32(&XRDC_PDAC_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_PDAC_W_D2ACP_SHIFT), XRDC_PDAC_W_D2ACP_SHIFT, XRDC_PDAC_W_D2ACP_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_PDAC_W, field D11ACP[11:9] (RW)
 *
 * Domain "x" access control policy. This 3-bit field defines the access control
 * rights for the selected domain. The encodings specify read and write access
 * capabilities based on the 4 operating states. These fields are only implemented
 * for supported domainIDs; unsupported domainIDs are not implemented and
 * default to a zero value providing no access rights. Policy SecurePriv SecureUser
 * NonsecurePriv NonsecureUser 111 r, w r, w r, w r, w 110 r, w r, w r, w none 101
 * r, w r, w r r 100 r, w r, w r none 011 r, w r, w none none 010 r, w none none
 * none 001 r r none none 000 none none none none
 */
/*@{*/
/*! @brief Read current value of the XRDC_PDAC_W_D11ACP field. */
#define XRDC_RD_PDAC_W_D11ACP(base, index, index2) ((XRDC_PDAC_W_REG(base, index, index2) & XRDC_PDAC_W_D11ACP_MASK) >> XRDC_PDAC_W_D11ACP_SHIFT)
#define XRDC_BRD_PDAC_W_D11ACP(base, index, index2) (BME_UBFX32(&XRDC_PDAC_W_REG(base, index, index2), XRDC_PDAC_W_D11ACP_SHIFT, XRDC_PDAC_W_D11ACP_WIDTH))

/*! @brief Set the D11ACP field to a new value. */
#define XRDC_WR_PDAC_W_D11ACP(base, index, index2, value) (XRDC_RMW_PDAC_W(base, index, index2, XRDC_PDAC_W_D11ACP_MASK, XRDC_PDAC_W_D11ACP(value)))
#define XRDC_BWR_PDAC_W_D11ACP(base, index, index2, value) (BME_BFI32(&XRDC_PDAC_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_PDAC_W_D11ACP_SHIFT), XRDC_PDAC_W_D11ACP_SHIFT, XRDC_PDAC_W_D11ACP_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_PDAC_W, field D3ACP[11:9] (RW)
 *
 * Domain "x" access control policy. This 3-bit field defines the access control
 * rights for the selected domain. The encodings specify read and write access
 * capabilities based on the 4 operating states. These fields are only implemented
 * for supported domainIDs; unsupported domainIDs are not implemented and
 * default to a zero value providing no access rights. Policy SecurePriv SecureUser
 * NonsecurePriv NonsecureUser 111 r, w r, w r, w r, w 110 r, w r, w r, w none 101
 * r, w r, w r r 100 r, w r, w r none 011 r, w r, w none none 010 r, w none none
 * none 001 r r none none 000 none none none none
 */
/*@{*/
/*! @brief Read current value of the XRDC_PDAC_W_D3ACP field. */
#define XRDC_RD_PDAC_W_D3ACP(base, index, index2) ((XRDC_PDAC_W_REG(base, index, index2) & XRDC_PDAC_W_D3ACP_MASK) >> XRDC_PDAC_W_D3ACP_SHIFT)
#define XRDC_BRD_PDAC_W_D3ACP(base, index, index2) (BME_UBFX32(&XRDC_PDAC_W_REG(base, index, index2), XRDC_PDAC_W_D3ACP_SHIFT, XRDC_PDAC_W_D3ACP_WIDTH))

/*! @brief Set the D3ACP field to a new value. */
#define XRDC_WR_PDAC_W_D3ACP(base, index, index2, value) (XRDC_RMW_PDAC_W(base, index, index2, XRDC_PDAC_W_D3ACP_MASK, XRDC_PDAC_W_D3ACP(value)))
#define XRDC_BWR_PDAC_W_D3ACP(base, index, index2, value) (BME_BFI32(&XRDC_PDAC_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_PDAC_W_D3ACP_SHIFT), XRDC_PDAC_W_D3ACP_SHIFT, XRDC_PDAC_W_D3ACP_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_PDAC_W, field D4ACP[14:12] (RW)
 *
 * Domain "x" access control policy. This 3-bit field defines the access control
 * rights for the selected domain. The encodings specify read and write access
 * capabilities based on the 4 operating states. These fields are only implemented
 * for supported domainIDs; unsupported domainIDs are not implemented and
 * default to a zero value providing no access rights. Policy SecurePriv SecureUser
 * NonsecurePriv NonsecureUser 111 r, w r, w r, w r, w 110 r, w r, w r, w none 101
 * r, w r, w r r 100 r, w r, w r none 011 r, w r, w none none 010 r, w none none
 * none 001 r r none none 000 none none none none
 */
/*@{*/
/*! @brief Read current value of the XRDC_PDAC_W_D4ACP field. */
#define XRDC_RD_PDAC_W_D4ACP(base, index, index2) ((XRDC_PDAC_W_REG(base, index, index2) & XRDC_PDAC_W_D4ACP_MASK) >> XRDC_PDAC_W_D4ACP_SHIFT)
#define XRDC_BRD_PDAC_W_D4ACP(base, index, index2) (BME_UBFX32(&XRDC_PDAC_W_REG(base, index, index2), XRDC_PDAC_W_D4ACP_SHIFT, XRDC_PDAC_W_D4ACP_WIDTH))

/*! @brief Set the D4ACP field to a new value. */
#define XRDC_WR_PDAC_W_D4ACP(base, index, index2, value) (XRDC_RMW_PDAC_W(base, index, index2, XRDC_PDAC_W_D4ACP_MASK, XRDC_PDAC_W_D4ACP(value)))
#define XRDC_BWR_PDAC_W_D4ACP(base, index, index2, value) (BME_BFI32(&XRDC_PDAC_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_PDAC_W_D4ACP_SHIFT), XRDC_PDAC_W_D4ACP_SHIFT, XRDC_PDAC_W_D4ACP_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_PDAC_W, field D12ACP[14:12] (RW)
 *
 * Domain "x" access control policy. This 3-bit field defines the access control
 * rights for the selected domain. The encodings specify read and write access
 * capabilities based on the 4 operating states. These fields are only implemented
 * for supported domainIDs; unsupported domainIDs are not implemented and
 * default to a zero value providing no access rights. Policy SecurePriv SecureUser
 * NonsecurePriv NonsecureUser 111 r, w r, w r, w r, w 110 r, w r, w r, w none 101
 * r, w r, w r r 100 r, w r, w r none 011 r, w r, w none none 010 r, w none none
 * none 001 r r none none 000 none none none none
 */
/*@{*/
/*! @brief Read current value of the XRDC_PDAC_W_D12ACP field. */
#define XRDC_RD_PDAC_W_D12ACP(base, index, index2) ((XRDC_PDAC_W_REG(base, index, index2) & XRDC_PDAC_W_D12ACP_MASK) >> XRDC_PDAC_W_D12ACP_SHIFT)
#define XRDC_BRD_PDAC_W_D12ACP(base, index, index2) (BME_UBFX32(&XRDC_PDAC_W_REG(base, index, index2), XRDC_PDAC_W_D12ACP_SHIFT, XRDC_PDAC_W_D12ACP_WIDTH))

/*! @brief Set the D12ACP field to a new value. */
#define XRDC_WR_PDAC_W_D12ACP(base, index, index2, value) (XRDC_RMW_PDAC_W(base, index, index2, XRDC_PDAC_W_D12ACP_MASK, XRDC_PDAC_W_D12ACP(value)))
#define XRDC_BWR_PDAC_W_D12ACP(base, index, index2, value) (BME_BFI32(&XRDC_PDAC_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_PDAC_W_D12ACP_SHIFT), XRDC_PDAC_W_D12ACP_SHIFT, XRDC_PDAC_W_D12ACP_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_PDAC_W, field D5ACP[17:15] (RW)
 *
 * Domain "x" access control policy. This 3-bit field defines the access control
 * rights for the selected domain. The encodings specify read and write access
 * capabilities based on the 4 operating states. These fields are only implemented
 * for supported domainIDs; unsupported domainIDs are not implemented and
 * default to a zero value providing no access rights. Policy SecurePriv SecureUser
 * NonsecurePriv NonsecureUser 111 r, w r, w r, w r, w 110 r, w r, w r, w none 101
 * r, w r, w r r 100 r, w r, w r none 011 r, w r, w none none 010 r, w none none
 * none 001 r r none none 000 none none none none
 */
/*@{*/
/*! @brief Read current value of the XRDC_PDAC_W_D5ACP field. */
#define XRDC_RD_PDAC_W_D5ACP(base, index, index2) ((XRDC_PDAC_W_REG(base, index, index2) & XRDC_PDAC_W_D5ACP_MASK) >> XRDC_PDAC_W_D5ACP_SHIFT)
#define XRDC_BRD_PDAC_W_D5ACP(base, index, index2) (BME_UBFX32(&XRDC_PDAC_W_REG(base, index, index2), XRDC_PDAC_W_D5ACP_SHIFT, XRDC_PDAC_W_D5ACP_WIDTH))

/*! @brief Set the D5ACP field to a new value. */
#define XRDC_WR_PDAC_W_D5ACP(base, index, index2, value) (XRDC_RMW_PDAC_W(base, index, index2, XRDC_PDAC_W_D5ACP_MASK, XRDC_PDAC_W_D5ACP(value)))
#define XRDC_BWR_PDAC_W_D5ACP(base, index, index2, value) (BME_BFI32(&XRDC_PDAC_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_PDAC_W_D5ACP_SHIFT), XRDC_PDAC_W_D5ACP_SHIFT, XRDC_PDAC_W_D5ACP_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_PDAC_W, field D13ACP[17:15] (RW)
 *
 * Domain "x" access control policy. This 3-bit field defines the access control
 * rights for the selected domain. The encodings specify read and write access
 * capabilities based on the 4 operating states. These fields are only implemented
 * for supported domainIDs; unsupported domainIDs are not implemented and
 * default to a zero value providing no access rights. Policy SecurePriv SecureUser
 * NonsecurePriv NonsecureUser 111 r, w r, w r, w r, w 110 r, w r, w r, w none 101
 * r, w r, w r r 100 r, w r, w r none 011 r, w r, w none none 010 r, w none none
 * none 001 r r none none 000 none none none none
 */
/*@{*/
/*! @brief Read current value of the XRDC_PDAC_W_D13ACP field. */
#define XRDC_RD_PDAC_W_D13ACP(base, index, index2) ((XRDC_PDAC_W_REG(base, index, index2) & XRDC_PDAC_W_D13ACP_MASK) >> XRDC_PDAC_W_D13ACP_SHIFT)
#define XRDC_BRD_PDAC_W_D13ACP(base, index, index2) (BME_UBFX32(&XRDC_PDAC_W_REG(base, index, index2), XRDC_PDAC_W_D13ACP_SHIFT, XRDC_PDAC_W_D13ACP_WIDTH))

