pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the SNUM field to a new value. */
#define XRDC_WR_PDAC_W_SNUM(base, index, index2, value) (XRDC_RMW_PDAC_W(base, index, index2, XRDC_PDAC_W_SNUM_MASK, XRDC_PDAC_W_SNUM(value)))
#define XRDC_BWR_PDAC_W_SNUM(base, index, index2, value) (BME_BFI32(&XRDC_PDAC_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_PDAC_W_SNUM_SHIFT), XRDC_PDAC_W_SNUM_SHIFT, XRDC_PDAC_W_SNUM_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_PDAC_W, field LK2[30:29] (RW)
 *
 * Lock. This 2-bit field provides a mechanism to limit writes to the PDACn
 * register to protect its contents. Once set, these bits individually remain
 * asserted until the next reset
 *
 * Values:
 * - 0b00 - Entire PDACn can be written.
 * - 0b01 - Entire PDACn can be written.
 * - 0b10 - Domain "x" can only update the DxACP field; no other PDACn fields
 *     can be written.
 * - 0b11 - PDACn is locked (read-only) until the next reset.
 */
/*@{*/
/*! @brief Read current value of the XRDC_PDAC_W_LK2 field. */
#define XRDC_RD_PDAC_W_LK2(base, index, index2) ((XRDC_PDAC_W_REG(base, index, index2) & XRDC_PDAC_W_LK2_MASK) >> XRDC_PDAC_W_LK2_SHIFT)
#define XRDC_BRD_PDAC_W_LK2(base, index, index2) (BME_UBFX32(&XRDC_PDAC_W_REG(base, index, index2), XRDC_PDAC_W_LK2_SHIFT, XRDC_PDAC_W_LK2_WIDTH))

/*! @brief Set the LK2 field to a new value. */
#define XRDC_WR_PDAC_W_LK2(base, index, index2, value) (XRDC_RMW_PDAC_W(base, index, index2, XRDC_PDAC_W_LK2_MASK, XRDC_PDAC_W_LK2(value)))
#define XRDC_BWR_PDAC_W_LK2(base, index, index2, value) (BME_BFI32(&XRDC_PDAC_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_PDAC_W_LK2_SHIFT), XRDC_PDAC_W_LK2_SHIFT, XRDC_PDAC_W_LK2_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_PDAC_W, field SE[30] (RW)
 *
 * Semaphore enable. This field indicates if a semaphore (SNUM) is to be
 * included in the DxACP access evaluation.
 *
 * Values:
 * - 0b0 - Do not include a semaphore in the DxACP evaluation.
 * - 0b1 - Include the semaphore defined by W0[SNUM] in the DxACP evaluation.
 */
/*@{*/
/*! @brief Read current value of the XRDC_PDAC_W_SE field. */
#define XRDC_RD_PDAC_W_SE(base, index, index2) ((XRDC_PDAC_W_REG(base, index, index2) & XRDC_PDAC_W_SE_MASK) >> XRDC_PDAC_W_SE_SHIFT)
#define XRDC_BRD_PDAC_W_SE(base, index, index2) (BME_UBFX32(&XRDC_PDAC_W_REG(base, index, index2), XRDC_PDAC_W_SE_SHIFT, XRDC_PDAC_W_SE_WIDTH))

/*! @brief Set the SE field to a new value. */
#define XRDC_WR_PDAC_W_SE(base, index, index2, value) (XRDC_RMW_PDAC_W(base, index, index2, XRDC_PDAC_W_SE_MASK, XRDC_PDAC_W_SE(value)))
#define XRDC_BWR_PDAC_W_SE(base, index, index2, value) (BME_BFI32(&XRDC_PDAC_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_PDAC_W_SE_SHIFT), XRDC_PDAC_W_SE_SHIFT, XRDC_PDAC_W_SE_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_PDAC_W, field VLD[31] (RW)
 *
 * Valid. This field indicates the peripheral domain access control definition
 * is valid. It is further qualified by CR[GVLD] = 1. If either CR[GVLD] or this
 * VLD flag is cleared, all accesses to the peripheral are allowed. Any write to
 * PDAC_W0_n clears the PDAC_W1_n[VLD] indicator so a coherent register state can
 * be supported.
 *
 * Values:
 * - 0b0 - The PDACn assignment is invalid.
 * - 0b1 - The PDACn assignment is valid.
 */
/*@{*/
/*! @brief Read current value of the XRDC_PDAC_W_VLD field. */
#define XRDC_RD_PDAC_W_VLD(base, index, index2) ((XRDC_PDAC_W_REG(base, index, index2) & XRDC_PDAC_W_VLD_MASK) >> XRDC_PDAC_W_VLD_SHIFT)
#define XRDC_BRD_PDAC_W_VLD(base, index, index2) (BME_UBFX32(&XRDC_PDAC_W_REG(base, index, index2), XRDC_PDAC_W_VLD_SHIFT, XRDC_PDAC_W_VLD_WIDTH))

/*! @brief Set the VLD field to a new value. */
#define XRDC_WR_PDAC_W_VLD(base, index, index2, value) (XRDC_RMW_PDAC_W(base, index, index2, XRDC_PDAC_W_VLD_MASK, XRDC_PDAC_W_VLD(value)))
#define XRDC_BWR_PDAC_W_VLD(base, index, index2, value) (BME_BFI32(&XRDC_PDAC_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_PDAC_W_VLD_SHIFT), XRDC_PDAC_W_VLD_SHIFT, XRDC_PDAC_W_VLD_WIDTH))
/*@}*/

/*******************************************************************************
 * XRDC_MRGD_W - Memory Region Descriptor W0
 ******************************************************************************/

/*!
 * @brief XRDC_MRGD_W - Memory Region Descriptor W0 (RW)
 *
 * Reset value: 0x00000000U
 *
 * The MRGD_Wm_n registers provide a 2-dimensional data structure for defining
 * access control policies per domain for each supported memory region. There are
 * 4 word-size registers currently defined (and space for 8 word-sized registers)
 * in each memory region (Wm) and up to 256 memory regions (up to 16 memory
 * region controllers, each supporting up to 16 memory region descriptors). The
 * actual number of implemented memory region controllers is defined by MDACFGn[NMRC].
 * Each instance of a memory region controller (MRC) submodule can monitor up to
 * 8 system buses concurrently. Note, an AXI port counts as two system buses
 * since the read address and write address channels operate independently. Each Wm
 * within the MRGDn structure is a word-sized definition; a total of four words
 * (128 bits, W0-W3) are needed to completely define the memory region descriptor.
 * Additionally, there are another four words (W4-W7) included in each MRGDn
 * definition that are currently unused and reserved for future enhancements. XRDC
 * uses a base address plus a size (0-modulo-size) to specify memory regions. This
 * format provides addressing capabilities that are equivalent to those provided
 * in the ARM Cortex-M processor core memory protection unit. The region
 * descriptor also allows a hardware semaphore to be optionally included in the access
 * control evaluation for memory regions shared by multiple domains. If enabled,
 * the state of the semaphore dynamically modifies the access control policies so
 * that only the domain "owning" it has write permission into the region. The
 * write permissions for all other domains are revoked based on the semaphore state.
 * If the semaphore is not owned by any domain, the DxACP fields are evaluated
 * normally. The MRC submodule evaluates multiple system bus access addresses
 * versus the programmed address ranges to determine a region hit. Once a region hit
 * has been determined, the MRC then uses the domain identifier associated with
 * the access to select the appropriate DxACP field from the corresponding MRGDn.
 * The selected DxACP field is then evaluated against the attributes associated
 * with the memory transaction to determine the validity of the access. See Memory
 * region descriptor hit determination and Memory region DxACP evaluation for
 * more details. If allowed, the access proceeds, else an access violation is
 * signaled, the transfer error terminated and the appropriate address and attribute
 * information captured in the corresponding error detail registers.
 */
/*!
 * @name Constants and macros for entire XRDC_MRGD_W register
 */
/*@{*/
#define XRDC_RD_MRGD_W(base, index, index2) (XRDC_MRGD_W_REG(base, index, index2))
#define XRDC_WR_MRGD_W(base, index, index2, value) (XRDC_MRGD_W_REG(base, index, index2) = (value))
#define XRDC_RMW_MRGD_W(base, index, index2, mask, value) (XRDC_WR_MRGD_W(base, index, index2, (XRDC_RD_MRGD_W(base, index, index2) & ~(mask)) | (value)))
#define XRDC_SET_MRGD_W(base, index, index2, value) (BME_OR32(&XRDC_MRGD_W_REG(base, index, index2), (uint32_t)(value)))
#define XRDC_CLR_MRGD_W(base, index, index2, value) (BME_AND32(&XRDC_MRGD_W_REG(base, index, index2), (uint32_t)(~(value))))
#define XRDC_TOG_MRGD_W(base, index, index2, value) (BME_XOR32(&XRDC_MRGD_W_REG(base, index, index2), (uint32_t)(value)))
/*@}*/

