pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*
 * Constants & macros for individual XRDC_MRGD_W bitfields
 */

/*!
 * @name Register XRDC_MRGD_W, field SRD[7:0] (RW)
 *
 * Subregion disable. For regions of 256 bytes or larger, this field is a bitmap
 * enabling or disabling each of the eight equal-size subregions. SRD[0]
 * disables the subregion with the lowest address range, while SRD[7] disables the
 * subregion with the highest address range. If any SRD bits are asserted to disable a
 * subregion and the total region size is less than 256 bytes, the ARM
 * definition of UNPREDICTABLE behavior applies. 0: Subregion is enabled. 1: Subregion is
 * disabled.
 */
/*@{*/
/*! @brief Read current value of the XRDC_MRGD_W_SRD field. */
#define XRDC_RD_MRGD_W_SRD(base, index, index2) ((XRDC_MRGD_W_REG(base, index, index2) & XRDC_MRGD_W_SRD_MASK) >> XRDC_MRGD_W_SRD_SHIFT)
#define XRDC_BRD_MRGD_W_SRD(base, index, index2) (BME_UBFX32(&XRDC_MRGD_W_REG(base, index, index2), XRDC_MRGD_W_SRD_SHIFT, XRDC_MRGD_W_SRD_WIDTH))

/*! @brief Set the SRD field to a new value. */
#define XRDC_WR_MRGD_W_SRD(base, index, index2, value) (XRDC_RMW_MRGD_W(base, index, index2, XRDC_MRGD_W_SRD_MASK, XRDC_MRGD_W_SRD(value)))
#define XRDC_BWR_MRGD_W_SRD(base, index, index2, value) (BME_BFI32(&XRDC_MRGD_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_MRGD_W_SRD_SHIFT), XRDC_MRGD_W_SRD_SHIFT, XRDC_MRGD_W_SRD_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_MRGD_W, field D8ACP[2:0] (RW)
 *
 * Domain "x" access control policy. This field defines the access control
 * rights for the selected domain. The encodings specify read and write access
 * capabilities based on the 4 operating states. These fields are only implemented for
 * supported domainIDs; unsupported domainIDs are not implemented and default to a
 * zero value providing no access rights. Policy SecurePriv SecureUser
 * NonsecurePriv NonsecureUser 111 r, w r, w r, w r, w 110 r, w r, w r, w none 101 r, w r,
 * w r r 100 r, w r, w r none 011 r, w r, w none none 010 r, w none none none
 * 001 r r none none 000 none none none none
 */
/*@{*/
/*! @brief Read current value of the XRDC_MRGD_W_D8ACP field. */
#define XRDC_RD_MRGD_W_D8ACP(base, index, index2) ((XRDC_MRGD_W_REG(base, index, index2) & XRDC_MRGD_W_D8ACP_MASK) >> XRDC_MRGD_W_D8ACP_SHIFT)
#define XRDC_BRD_MRGD_W_D8ACP(base, index, index2) (BME_UBFX32(&XRDC_MRGD_W_REG(base, index, index2), XRDC_MRGD_W_D8ACP_SHIFT, XRDC_MRGD_W_D8ACP_WIDTH))

/*! @brief Set the D8ACP field to a new value. */
#define XRDC_WR_MRGD_W_D8ACP(base, index, index2, value) (XRDC_RMW_MRGD_W(base, index, index2, XRDC_MRGD_W_D8ACP_MASK, XRDC_MRGD_W_D8ACP(value)))
#define XRDC_BWR_MRGD_W_D8ACP(base, index, index2, value) (BME_BFI32(&XRDC_MRGD_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_MRGD_W_D8ACP_SHIFT), XRDC_MRGD_W_D8ACP_SHIFT, XRDC_MRGD_W_D8ACP_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_MRGD_W, field D0ACP[2:0] (RW)
 *
 * Domain "x" access control policy. This field defines the access control
 * rights for the selected domain. The encodings specify read and write access
 * capabilities based on the 4 operating states. These fields are only implemented for
 * supported domainIDs; unsupported domainIDs are not implemented and default to a
 * zero value providing no access rights. Policy SecurePriv SecureUser
 * NonsecurePriv NonsecureUser 111 r, w r, w r, w r, w 110 r, w r, w r, w none 101 r, w r,
 * w r r 100 r, w r, w r none 011 r, w r, w none none 010 r, w none none none
 * 001 r r none none 000 none none none none
 */
/*@{*/
/*! @brief Read current value of the XRDC_MRGD_W_D0ACP field. */
#define XRDC_RD_MRGD_W_D0ACP(base, index, index2) ((XRDC_MRGD_W_REG(base, index, index2) & XRDC_MRGD_W_D0ACP_MASK) >> XRDC_MRGD_W_D0ACP_SHIFT)
#define XRDC_BRD_MRGD_W_D0ACP(base, index, index2) (BME_UBFX32(&XRDC_MRGD_W_REG(base, index, index2), XRDC_MRGD_W_D0ACP_SHIFT, XRDC_MRGD_W_D0ACP_WIDTH))

/*! @brief Set the D0ACP field to a new value. */
#define XRDC_WR_MRGD_W_D0ACP(base, index, index2, value) (XRDC_RMW_MRGD_W(base, index, index2, XRDC_MRGD_W_D0ACP_MASK, XRDC_MRGD_W_D0ACP(value)))
#define XRDC_BWR_MRGD_W_D0ACP(base, index, index2, value) (BME_BFI32(&XRDC_MRGD_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_MRGD_W_D0ACP_SHIFT), XRDC_MRGD_W_D0ACP_SHIFT, XRDC_MRGD_W_D0ACP_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_MRGD_W, field D1ACP[5:3] (RW)
 *
 * Domain "x" access control policy. This field defines the access control
 * rights for the selected domain. The encodings specify read and write access
 * capabilities based on the 4 operating states. These fields are only implemented for
 * supported domainIDs; unsupported domainIDs are not implemented and default to a
 * zero value providing no access rights. Policy SecurePriv SecureUser
 * NonsecurePriv NonsecureUser 111 r, w r, w r, w r, w 110 r, w r, w r, w none 101 r, w r,
 * w r r 100 r, w r, w r none 011 r, w r, w none none 010 r, w none none none
 * 001 r r none none 000 none none none none
 */
/*@{*/
/*! @brief Read current value of the XRDC_MRGD_W_D1ACP field. */
#define XRDC_RD_MRGD_W_D1ACP(base, index, index2) ((XRDC_MRGD_W_REG(base, index, index2) & XRDC_MRGD_W_D1ACP_MASK) >> XRDC_MRGD_W_D1ACP_SHIFT)
#define XRDC_BRD_MRGD_W_D1ACP(base, index, index2) (BME_UBFX32(&XRDC_MRGD_W_REG(base, index, index2), XRDC_MRGD_W_D1ACP_SHIFT, XRDC_MRGD_W_D1ACP_WIDTH))

/*! @brief Set the D1ACP field to a new value. */
#define XRDC_WR_MRGD_W_D1ACP(base, index, index2, value) (XRDC_RMW_MRGD_W(base, index, index2, XRDC_MRGD_W_D1ACP_MASK, XRDC_MRGD_W_D1ACP(value)))
#define XRDC_BWR_MRGD_W_D1ACP(base, index, index2, value) (BME_BFI32(&XRDC_MRGD_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_MRGD_W_D1ACP_SHIFT), XRDC_MRGD_W_D1ACP_SHIFT, XRDC_MRGD_W_D1ACP_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_MRGD_W, field D9ACP[5:3] (RW)
 *
 * Domain "x" access control policy. This field defines the access control
 * rights for the selected domain. The encodings specify read and write access
 * capabilities based on the 4 operating states. These fields are only implemented for
 * supported domainIDs; unsupported domainIDs are not implemented and default to a
 * zero value providing no access rights. Policy SecurePriv SecureUser
 * NonsecurePriv NonsecureUser 111 r, w r, w r, w r, w 110 r, w r, w r, w none 101 r, w r,
 * w r r 100 r, w r, w r none 011 r, w r, w none none 010 r, w none none none
 * 001 r r none none 000 none none none none
 */
/*@{*/
/*! @brief Read current value of the XRDC_MRGD_W_D9ACP field. */
#define XRDC_RD_MRGD_W_D9ACP(base, index, index2) ((XRDC_MRGD_W_REG(base, index, index2) & XRDC_MRGD_W_D9ACP_MASK) >> XRDC_MRGD_W_D9ACP_SHIFT)
#define XRDC_BRD_MRGD_W_D9ACP(base, index, index2) (BME_UBFX32(&XRDC_MRGD_W_REG(base, index, index2), XRDC_MRGD_W_D9ACP_SHIFT, XRDC_MRGD_W_D9ACP_WIDTH))

/*! @brief Set the D9ACP field to a new value. */
#define XRDC_WR_MRGD_W_D9ACP(base, index, index2, value) (XRDC_RMW_MRGD_W(base, index, index2, XRDC_MRGD_W_D9ACP_MASK, XRDC_MRGD_W_D9ACP(value)))
#define XRDC_BWR_MRGD_W_D9ACP(base, index, index2, value) (BME_BFI32(&XRDC_MRGD_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_MRGD_W_D9ACP_SHIFT), XRDC_MRGD_W_D9ACP_SHIFT, XRDC_MRGD_W_D9ACP_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_MRGD_W, field BASEADDR[31:5] (RW)
 *
 * Base Address.This field defines the most significant bits of the base address
 * of the memory region (minimum size = 32 bytes). The Base Address is aligned
 * to a 0-modulo-2(SZ+1) byte address.
 */
/*@{*/
/*! @brief Read current value of the XRDC_MRGD_W_BASEADDR field. */
#define XRDC_RD_MRGD_W_BASEADDR(base, index, index2) ((XRDC_MRGD_W_REG(base, index, index2) & XRDC_MRGD_W_BASEADDR_MASK) >> XRDC_MRGD_W_BASEADDR_SHIFT)
#define XRDC_BRD_MRGD_W_BASEADDR(base, index, index2) (XRDC_RD_MRGD_W_BASEADDR(base, index, index2))

