pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the BASEADDR field to a new value. */
#define XRDC_WR_MRGD_W_BASEADDR(base, index, index2, value) (XRDC_RMW_MRGD_W(base, index, index2, XRDC_MRGD_W_BASEADDR_MASK, XRDC_MRGD_W_BASEADDR(value)))
#define XRDC_BWR_MRGD_W_BASEADDR(base, index, index2, value) (XRDC_WR_MRGD_W_BASEADDR(base, index, index2, value))
/*@}*/

/*!
 * @name Register XRDC_MRGD_W, field D2ACP[8:6] (RW)
 *
 * Domain "x" access control policy. This field defines the access control
 * rights for the selected domain. The encodings specify read and write access
 * capabilities based on the 4 operating states. These fields are only implemented for
 * supported domainIDs; unsupported domainIDs are not implemented and default to a
 * zero value providing no access rights. Policy SecurePriv SecureUser
 * NonsecurePriv NonsecureUser 111 r, w r, w r, w r, w 110 r, w r, w r, w none 101 r, w r,
 * w r r 100 r, w r, w r none 011 r, w r, w none none 010 r, w none none none
 * 001 r r none none 000 none none none none
 */
/*@{*/
/*! @brief Read current value of the XRDC_MRGD_W_D2ACP field. */
#define XRDC_RD_MRGD_W_D2ACP(base, index, index2) ((XRDC_MRGD_W_REG(base, index, index2) & XRDC_MRGD_W_D2ACP_MASK) >> XRDC_MRGD_W_D2ACP_SHIFT)
#define XRDC_BRD_MRGD_W_D2ACP(base, index, index2) (BME_UBFX32(&XRDC_MRGD_W_REG(base, index, index2), XRDC_MRGD_W_D2ACP_SHIFT, XRDC_MRGD_W_D2ACP_WIDTH))

/*! @brief Set the D2ACP field to a new value. */
#define XRDC_WR_MRGD_W_D2ACP(base, index, index2, value) (XRDC_RMW_MRGD_W(base, index, index2, XRDC_MRGD_W_D2ACP_MASK, XRDC_MRGD_W_D2ACP(value)))
#define XRDC_BWR_MRGD_W_D2ACP(base, index, index2, value) (BME_BFI32(&XRDC_MRGD_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_MRGD_W_D2ACP_SHIFT), XRDC_MRGD_W_D2ACP_SHIFT, XRDC_MRGD_W_D2ACP_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_MRGD_W, field D10ACP[8:6] (RW)
 *
 * Domain "x" access control policy. This field defines the access control
 * rights for the selected domain. The encodings specify read and write access
 * capabilities based on the 4 operating states. These fields are only implemented for
 * supported domainIDs; unsupported domainIDs are not implemented and default to a
 * zero value providing no access rights. Policy SecurePriv SecureUser
 * NonsecurePriv NonsecureUser 111 r, w r, w r, w r, w 110 r, w r, w r, w none 101 r, w r,
 * w r r 100 r, w r, w r none 011 r, w r, w none none 010 r, w none none none
 * 001 r r none none 000 none none none none
 */
/*@{*/
/*! @brief Read current value of the XRDC_MRGD_W_D10ACP field. */
#define XRDC_RD_MRGD_W_D10ACP(base, index, index2) ((XRDC_MRGD_W_REG(base, index, index2) & XRDC_MRGD_W_D10ACP_MASK) >> XRDC_MRGD_W_D10ACP_SHIFT)
#define XRDC_BRD_MRGD_W_D10ACP(base, index, index2) (BME_UBFX32(&XRDC_MRGD_W_REG(base, index, index2), XRDC_MRGD_W_D10ACP_SHIFT, XRDC_MRGD_W_D10ACP_WIDTH))

/*! @brief Set the D10ACP field to a new value. */
#define XRDC_WR_MRGD_W_D10ACP(base, index, index2, value) (XRDC_RMW_MRGD_W(base, index, index2, XRDC_MRGD_W_D10ACP_MASK, XRDC_MRGD_W_D10ACP(value)))
#define XRDC_BWR_MRGD_W_D10ACP(base, index, index2, value) (BME_BFI32(&XRDC_MRGD_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_MRGD_W_D10ACP_SHIFT), XRDC_MRGD_W_D10ACP_SHIFT, XRDC_MRGD_W_D10ACP_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_MRGD_W, field SZ[12:8] (RW)
 *
 * Region size. The region size is defined as 2(SZ+1) bytes.This field must be
 * >= 4 as the smallest region size is 32 bytes, else the ARM definition of
 * UNPREDICTABLE behavior applies.
 */
/*@{*/
/*! @brief Read current value of the XRDC_MRGD_W_SZ field. */
#define XRDC_RD_MRGD_W_SZ(base, index, index2) ((XRDC_MRGD_W_REG(base, index, index2) & XRDC_MRGD_W_SZ_MASK) >> XRDC_MRGD_W_SZ_SHIFT)
#define XRDC_BRD_MRGD_W_SZ(base, index, index2) (BME_UBFX32(&XRDC_MRGD_W_REG(base, index, index2), XRDC_MRGD_W_SZ_SHIFT, XRDC_MRGD_W_SZ_WIDTH))

/*! @brief Set the SZ field to a new value. */
#define XRDC_WR_MRGD_W_SZ(base, index, index2, value) (XRDC_RMW_MRGD_W(base, index, index2, XRDC_MRGD_W_SZ_MASK, XRDC_MRGD_W_SZ(value)))
#define XRDC_BWR_MRGD_W_SZ(base, index, index2, value) (BME_BFI32(&XRDC_MRGD_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_MRGD_W_SZ_SHIFT), XRDC_MRGD_W_SZ_SHIFT, XRDC_MRGD_W_SZ_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_MRGD_W, field D3ACP[11:9] (RW)
 *
 * Domain "x" access control policy. This field defines the access control
 * rights for the selected domain. The encodings specify read and write access
 * capabilities based on the 4 operating states. These fields are only implemented for
 * supported domainIDs; unsupported domainIDs are not implemented and default to a
 * zero value providing no access rights. Policy SecurePriv SecureUser
 * NonsecurePriv NonsecureUser 111 r, w r, w r, w r, w 110 r, w r, w r, w none 101 r, w r,
 * w r r 100 r, w r, w r none 011 r, w r, w none none 010 r, w none none none
 * 001 r r none none 000 none none none none
 */
/*@{*/
/*! @brief Read current value of the XRDC_MRGD_W_D3ACP field. */
#define XRDC_RD_MRGD_W_D3ACP(base, index, index2) ((XRDC_MRGD_W_REG(base, index, index2) & XRDC_MRGD_W_D3ACP_MASK) >> XRDC_MRGD_W_D3ACP_SHIFT)
#define XRDC_BRD_MRGD_W_D3ACP(base, index, index2) (BME_UBFX32(&XRDC_MRGD_W_REG(base, index, index2), XRDC_MRGD_W_D3ACP_SHIFT, XRDC_MRGD_W_D3ACP_WIDTH))

/*! @brief Set the D3ACP field to a new value. */
#define XRDC_WR_MRGD_W_D3ACP(base, index, index2, value) (XRDC_RMW_MRGD_W(base, index, index2, XRDC_MRGD_W_D3ACP_MASK, XRDC_MRGD_W_D3ACP(value)))
#define XRDC_BWR_MRGD_W_D3ACP(base, index, index2, value) (BME_BFI32(&XRDC_MRGD_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_MRGD_W_D3ACP_SHIFT), XRDC_MRGD_W_D3ACP_SHIFT, XRDC_MRGD_W_D3ACP_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_MRGD_W, field D11ACP[11:9] (RW)
 *
 * Domain "x" access control policy. This field defines the access control
 * rights for the selected domain. The encodings specify read and write access
 * capabilities based on the 4 operating states. These fields are only implemented for
 * supported domainIDs; unsupported domainIDs are not implemented and default to a
 * zero value providing no access rights. Policy SecurePriv SecureUser
 * NonsecurePriv NonsecureUser 111 r, w r, w r, w r, w 110 r, w r, w r, w none 101 r, w r,
 * w r r 100 r, w r, w r none 011 r, w r, w none none 010 r, w none none none
 * 001 r r none none 000 none none none none
 */
/*@{*/
/*! @brief Read current value of the XRDC_MRGD_W_D11ACP field. */
#define XRDC_RD_MRGD_W_D11ACP(base, index, index2) ((XRDC_MRGD_W_REG(base, index, index2) & XRDC_MRGD_W_D11ACP_MASK) >> XRDC_MRGD_W_D11ACP_SHIFT)
#define XRDC_BRD_MRGD_W_D11ACP(base, index, index2) (BME_UBFX32(&XRDC_MRGD_W_REG(base, index, index2), XRDC_MRGD_W_D11ACP_SHIFT, XRDC_MRGD_W_D11ACP_WIDTH))

