pyocd/FlashAlgo/source/freescale/devices/MKL28Z7/MKL28Z7_extension.h
/*! @brief Set the SNUM field to a new value. */
#define XRDC_WR_MRGD_W_SNUM(base, index, index2, value) (XRDC_RMW_MRGD_W(base, index, index2, XRDC_MRGD_W_SNUM_MASK, XRDC_MRGD_W_SNUM(value)))
#define XRDC_BWR_MRGD_W_SNUM(base, index, index2, value) (BME_BFI32(&XRDC_MRGD_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_MRGD_W_SNUM_SHIFT), XRDC_MRGD_W_SNUM_SHIFT, XRDC_MRGD_W_SNUM_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_MRGD_W, field LK2[30:29] (RW)
 *
 * Lock. This 2-bit field provides a mechanism to limit writes to the MRGDn
 * register to protect its contents. Once set, these bits individually remain
 * asserted until the next reset
 *
 * Values:
 * - 0b00 - Entire MRGDn can be written.
 * - 0b01 - Entire MRGDn can be written.
 * - 0b10 - Domain "x" can only update the DxACP field; no other MRGDn fields
 *     can be written
 * - 0b11 - MRGDn is locked (read-only) until the next reset.
 */
/*@{*/
/*! @brief Read current value of the XRDC_MRGD_W_LK2 field. */
#define XRDC_RD_MRGD_W_LK2(base, index, index2) ((XRDC_MRGD_W_REG(base, index, index2) & XRDC_MRGD_W_LK2_MASK) >> XRDC_MRGD_W_LK2_SHIFT)
#define XRDC_BRD_MRGD_W_LK2(base, index, index2) (BME_UBFX32(&XRDC_MRGD_W_REG(base, index, index2), XRDC_MRGD_W_LK2_SHIFT, XRDC_MRGD_W_LK2_WIDTH))

/*! @brief Set the LK2 field to a new value. */
#define XRDC_WR_MRGD_W_LK2(base, index, index2, value) (XRDC_RMW_MRGD_W(base, index, index2, XRDC_MRGD_W_LK2_MASK, XRDC_MRGD_W_LK2(value)))
#define XRDC_BWR_MRGD_W_LK2(base, index, index2, value) (BME_BFI32(&XRDC_MRGD_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_MRGD_W_LK2_SHIFT), XRDC_MRGD_W_LK2_SHIFT, XRDC_MRGD_W_LK2_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_MRGD_W, field SE[30] (RW)
 *
 * Semaphore enable. This field indicates if a semaphore (SNUM) is to be
 * included in the DxACP access evaluation.
 *
 * Values:
 * - 0b0 - Do not include a semaphore in the DxACP evaluation.
 * - 0b1 - Include the semaphore defined by W2[SNUM] in the DxACP evaluation.
 */
/*@{*/
/*! @brief Read current value of the XRDC_MRGD_W_SE field. */
#define XRDC_RD_MRGD_W_SE(base, index, index2) ((XRDC_MRGD_W_REG(base, index, index2) & XRDC_MRGD_W_SE_MASK) >> XRDC_MRGD_W_SE_SHIFT)
#define XRDC_BRD_MRGD_W_SE(base, index, index2) (BME_UBFX32(&XRDC_MRGD_W_REG(base, index, index2), XRDC_MRGD_W_SE_SHIFT, XRDC_MRGD_W_SE_WIDTH))

/*! @brief Set the SE field to a new value. */
#define XRDC_WR_MRGD_W_SE(base, index, index2, value) (XRDC_RMW_MRGD_W(base, index, index2, XRDC_MRGD_W_SE_MASK, XRDC_MRGD_W_SE(value)))
#define XRDC_BWR_MRGD_W_SE(base, index, index2, value) (BME_BFI32(&XRDC_MRGD_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_MRGD_W_SE_SHIFT), XRDC_MRGD_W_SE_SHIFT, XRDC_MRGD_W_SE_WIDTH))
/*@}*/

/*!
 * @name Register XRDC_MRGD_W, field VLD[31] (RW)
 *
 * Valid. This field indicates the memory region descriptor definition is valid.
 * It is further qualified by CR[GVLD] = 1. If either CR[GVLD] or this VLD flag
 * is cleared, all accesses to the memory region are allowed. Any write to
 * MRGD_W[0-2]_n clears the MRGD_W3_n[VLD] indicator so a coherent register state can
 * be supported. 0 The MRGDn assignment is invalid. 1 The MRGDn assignment is
 * valid.
 */
/*@{*/
/*! @brief Read current value of the XRDC_MRGD_W_VLD field. */
#define XRDC_RD_MRGD_W_VLD(base, index, index2) ((XRDC_MRGD_W_REG(base, index, index2) & XRDC_MRGD_W_VLD_MASK) >> XRDC_MRGD_W_VLD_SHIFT)
#define XRDC_BRD_MRGD_W_VLD(base, index, index2) (BME_UBFX32(&XRDC_MRGD_W_REG(base, index, index2), XRDC_MRGD_W_VLD_SHIFT, XRDC_MRGD_W_VLD_WIDTH))

/*! @brief Set the VLD field to a new value. */
#define XRDC_WR_MRGD_W_VLD(base, index, index2, value) (XRDC_RMW_MRGD_W(base, index, index2, XRDC_MRGD_W_VLD_MASK, XRDC_MRGD_W_VLD(value)))
#define XRDC_BWR_MRGD_W_VLD(base, index, index2, value) (BME_BFI32(&XRDC_MRGD_W_REG(base, index, index2), ((uint32_t)(value) << XRDC_MRGD_W_VLD_SHIFT), XRDC_MRGD_W_VLD_SHIFT, XRDC_MRGD_W_VLD_WIDTH))
/*@}*/

/* Instance numbers for core modules */
#define JTAG_IDX (0) /*!< Instance number for JTAG. */
#define TPIU_IDX (0) /*!< Instance number for TPIU. */
#define SCB_IDX (0) /*!< Instance number for SCB. */
#define CoreDebug_IDX (0) /*!< Instance number for CoreDebug. */

#endif /* __MKL28Z7_EXTENSION_H__ */
/* EOF */
